CharsToNumbersComposite_0=Zeichen in Zahlen gem\u00e4\u00df ASCII-256-Codierung umwandeln
CharsToNumbersComposite_1=Zeichen in ihre Indizes in einem ausgew\u00e4hlten Alphabet umwandeln: 
CharsToNumbersComposite_2=Einige Alphabete sind nicht verf\u00fcgbar, da der RSA-Modulus N ({0}) f\u00fcr diese zu klein ist.
CharsToNumbersComposite_5=Zeichenumwandlungs-Alphabet
CompositeNumberInput_10=Zeichen gefunden wurden, die keine Zahlen beschreiben: 
CompositeNumberInput_12=eine Zahl ({0}) gr\u00f6\u00dfer oder gleich dem RSA-Modulus N={1} ist.
CompositeNumberInput_14=Zahleneingabe
CompositeNumberInput_2=Zahlenformat: 
CompositeNumberInput_3=Dezimal
CompositeNumberInput_4=Hex
CompositeNumberInput_5=Bin\u00e4r
CompositeNumberInput_6=Zahlenformat
NumberblocksAndTextViewer_2=Anzeigen als:
NumberblocksAndTextViewer_3=Dezimal
NumberblocksAndTextViewer_4=Hex
NumberblocksAndTextViewer_5=Bin\u00e4r
NumberblocksAndTextViewer_6=Text
TANLBlockConversionPage_10=Bl\u00f6cke:
TANLBlockConversionPage_11=mit den gew\u00e4hlten Einstellungen f\u00fcr Basis und Zahlen-pro-Block der RSA-Modulus N={0} \u00fcberschritten werden k\u00f6nnte (gr\u00f6\u00dfter m\u00f6glicher Block: {1}). F\u00fcr mehr Zahlen pro Block, w\u00e4hlen Sie einen h\u00f6heren RSA-Modulus
TANLBlockConversionPage_12=die Basis gr\u00f6\u00dfer oder gleich der Gr\u00f6\u00dfe des Alphabets f\u00fcr die Zeichen-in-Zahlen-Umwandlung ({0}) sein muss
TANLBlockConversionPage_13=mit dieser Kombination aus Basis und Zahlen-per-Block die Bl\u00f6cke zu gro\u00df werden k\u00f6nnten
TANLBlockConversionPage_14=Blockumwandlung
TANLBlockConversionPage_5=Blockumwandlung
TANLBlockConversionPage_6=Zahlen (Zeichen) per Block: 
TANLBlockConversionPage_7=Basis b f\u00fcr b-adische Bl\u00f6cke: 
TANLBlockConversionPage_8=Vorschau:
TANLBlockConversionPage_9=Numerische Darstellung der Zeichen von der vorigen Seite:
TANLBlockConversionPage_wdescr=Geben Sie an, wie Bl\u00f6cke aus den Zahlen generiert werden sollen.
TANLBlockConversionPage_wtitle=Blockumwandlung
TANLNumberLoaderPage_wdescr=Geben Sie die Zahlenbl\u00f6cke ein, getrennt durch Leerzeichen.
TANLNumberLoaderPage_wtitle=Zahlenblockeingabe
TANLOriginChooserPage_3=Textbasierte Eingabe
TANLOriginChooserPage_5=Text aus einem Editor, einer Datei, oder manueller Eingabe wird in Zahlen bzw. Zahlenbl\u00f6cke umgewandelt. Sie k\u00f6nnen den Text und die Umwandlungsoptionen auf den folgenden Seiten festlegen.
TANLOriginChooserPage_6=Numerische Eingabe
TANLOriginChooserPage_7=Segoe UI
TANLOriginChooserPage_8=Geben Sie die Zahlenbl\u00f6cke manuell in Dezimal-, Hex- oder Bin\u00e4rdarstellung ein.
TANLOriginChooserPage_wdescrorigin=W\u00e4hlen Sie eine Eingabemethode f\u00fcr die Daten
TANLOriginChooserPage_wtitleorigin=Datenbl\u00f6cke laden
TANLTextPage_3=Umwandlung von Text in Zahlen
TANLTextPage_4=Zeichen, die nicht im ausgew\u00e4hlten Alphabet sind, werden nicht beachtet.
TANLTextPage_5=Text als Zahlen - Vorschau
TANLTextPage_6=Auf der n\u00e4chsten Seite k\u00f6nnen Sie die Zahlen noch in Bl\u00f6cke zusammenfassen.
TANLTextPage_wmessage=Legen Sie den Text fest, der in Zahlen umgewandelt werden soll, und die Umwandlungseinstellungen.
TANLTextPage_wtitle=Textauswahl
TextAsNumbersLoaderWizard_wtitle_overall=Eingabe numerischer Daten
