CreateCert_chose_file_btn=Datei ausw\u00e4hlen
CreateCert_gen_pub_key_btn=\u00d6ffentlichen Schl\u00fcssel ausw\u00e4hlen
CreateCert_city=Ort
CreateCert_country=Land
CreateCert_create_csr_headline=CSR erstellen
CreateCert_email=E-Mail
CreateCert_exp_txt0=In dieser Ansicht haben Sie die M\u00f6glichkeit, ein neues Zertifikat anzufordern.\nSie k\u00f6nnen dazu die hier vorgeschlagenen Musterdaten verwenden oder das Formular mit Ihren eigenen Daten bef\u00fcllen. Da dieses Zertifikat auf den Namen einer nat\u00fcrlichen Person lauten soll, ist es notwendig, dem PKI-Betreiber diese Identit\u00e4t zu belegen. F\u00fcr dieses Plugin wird angenommen, dass hierf\u00fcr ein Foto oder Farbscan eines g\u00fcltigen Lichtbildausweises ausreichend ist. Ein Musterausweis wird vom Plugin zur Verf\u00fcgung gestellt. Sie haben aber auch die M\u00f6glichkeit, eine Bilddatei von Ihrem Computer an die Zertifikatsanfrage anzuf\u00fcgen. Mehr dazu, welche Wege PKI-Betreiber in der realen Welt gehen, um Ihre Identit\u00e4t festzustellen, lesen Sie in der Onlinehilfe.\n\n
CreateCert_exp_txt1=Unter "\u00d6ffentlicher Schl\u00fcssel ausw\u00e4hlen" w\u00e4hlen Sie den \u00f6ffentlichen Schl\u00fcssel, f\u00fcr den Sie das Zertifikat anfordern wollen. Sollten Sie \u00fcber noch kein Schl\u00fcsselpaar verf\u00fcgen, so k\u00f6nnen Sie mittels "Schl\u00fcsselpaar generieren" eines generieren lassen.\n\n
CreateCert_exp_txt2=Wenn Sie fertig sind, k\u00f6nnen Sie Ihre Anfrage mittels "CSR abschicken" an den fiktiven PKI-Betreiber weiterleiten. Wechseln Sie anschlie\u00dfend in den Tab "Registration Authority," um mit diesem Plugin fortzufahren und mehr zum Prozess der Identit\u00e4tsfeststellung zu erfahren.\n\n
CreateCert_exp_txt3=Im Fachjargon hei\u00dft eine Zertifikatsanfrage "Certificate Signing Request" oder "CSR." Dieser muss einem bestimmten Format entsprechen, welches im X.509 Standard festgelegt ist. Mehr zu diesem Standard und den technischen Details einer Zertifikatsanfrage lesen Sie in der Onlinehilfe.
CreateCert_first_name=Vornamen
CreateCert_gen_keypair_btn=Schl\u00fcsselpaar generieren
CreateCert_identity_file=Identit\u00e4tsnachweis
CreateCert_last_name=Nachname
CreateCert_pub_key=\u00d6ffentlicher Schl\u00fcssel
CreateCert_send_csr_btn=\ \ \ \ \ \ \ \ \ CSR abschicken         
CreateCert_street=Stra\u00dfe
CreateCert_zip=Postleitzahl   
RevokeCert_dummy_cert0=Zertifikat \#1
RevokeCert_dummy_cert1=Zertifikat \#2
RevokeCert_exp_txt=Hi, I explain what is going on in Revoke Certificate\!
RevokeCert_rev_cert_btn=Zertifikat widerrufen
RevokeCert_rev_cert_headline=Zertifikat widerrufen
ShowCert_city=Ort
ShowCert_common_name=Common Name
ShowCert_common_name_issuer=Common Name
ShowCert_country=Land
ShowCert_dummy_cert0=\ \ \ Zertifikat \#1   
ShowCert_dummy_cert1=\ \ \ Zertifikat \#2   
ShowCert_dummy_cert2=\ \ \ Zertifikat \#3   
ShowCert_dummy_cert3=\ \ \ Zertifikat \#4   
ShowCert_dummy_city=Berlin
ShowCert_dummy_cn_issuer=JCrypTool Certificate Authority
ShowCert_dummy_common_name=Erika Musterfrau
ShowCert_dummy_country=Deutschland
ShowCert_dummy_email=e.musterfrau@gmail.com
ShowCert_dummy_expires_on=10/4/4
ShowCert_dummy_issued_on=9/4/13
ShowCert_dummy_org_issuer=JCrypTool
ShowCert_dummy_organisation=nicht Teil dieses Zertifikats
ShowCert_dummy_ou=nicht Teil dieses Zertifikats
ShowCert_dummy_ou_issuer=Certificate Authority
ShowCert_email=E-Mail
ShowCert_exp_txt0=In dieser Ansicht k\u00f6nnen Sie Ihre bereits ausgestellten Zertifikate anzehen. Die hier angezeigten Felder entsprechen dem bereits erw\u00e4hnten X.509 Standard f\u00fcr digitale Zertifikate. Zuerst k\u00f6nnen Sie sehen, f\u00fcr wen das Zertifikat ausgestellt wurde. Der Common Name ist in diesem Fall der Name, den Sie bei der Erstellung Ihres CSR angegeben haben. Hier k\u00f6nnte aber auch eine E-Mail-Adresse oder der Name einer Firma stehen. Mehr zu den verschiedenen Arten von Zertifikaten lesen Sie in der Onlinehilfe.\n
ShowCert_exp_txt1="Organisation" und "Organisationseinheit" dienen dazu, Firmen, Organisationen und beispielsweise Abteilungen dieser Firma oder Organisation anzugeben. Da dieses Zertifikat auf eine Privatperson ausgestellt wurde, sind diese Felder einfach leer.\n\n
ShowCert_exp_txt2=Nach den Angaben zum Zertifikatsinhaber folgen die Informationen \u00fcber die CA, welche das Zertifikat ausgestellt hat. Zuletzt beinhaltet ein Zertifikat immer auch ein Ausstellungsdatum und ein G\u00fcltigkeitsdatum. Wie sich dieses G\u00fcltigkeitsdatum auf Signaturen auswirkt, wird in der Ansicht "2. Benutzer" behandelt.\n\n
ShowCert_exp_txt3=Mittels "Zertifikat widerrufen" k\u00f6nnen Sie ein Zertifikat, das laut G\u00fcltigkeitsdatum noch g\u00fcltig w\u00e4re, als ung\u00fcltig erkl\u00e4ren. Dies kann beispielsweise notwendig sein, weil der private Schl\u00fcssel kompromittiert (also gestohlen oder gebrochen) oder verloren wurde, weil etwa in eine CA eingebrochen wurde oder einfach auch, weil eine Person aus der im Zertifikat angegebenen Organisation ausgeschieden ist. Mehr zu Information dazu lesen Sie in der Onlinehilfe.
ShowCert_expires_on=G\u00fcltig bis
ShowCert_issued_by=Ausgestellt von
ShowCert_issued_on=Ausgestellt am
ShowCert_issued_to=Ausgestellt f\u00fcr
ShowCert_manage_certs_headline=Zertifikate verwalten
ShowCert_org_issuer=Organisation
ShowCert_organisation=Organisation
ShowCert_ou=Organisationseinheit  
ShowCert_ou_issuer=Organisationseinheit  
ShowCert_rev_cert_btn=Zertifikat widerrufen
ShowCert_validity_period=G\u00fcltigkeitszeitraum
SignCert_dummy_enter_text=...Text zum Signieren eingeben...
SignCert_dummy_privkey0=Privater Schl\u00fcssel \#1
SignCert_dummy_privkey1=Privater Schl\u00fcssel \#2
SignCert_dummy_privkey2=Privater Schl\u00fcssel \#3
SignCert_dummy_privkey3=Privater Schl\u00fcssel \#4
SignCert_exp_txt0=In dieser Ansicht haben Sie die M\u00f6glichkeit, eine Datei auf Ihrem Computer oder den hier eingegebenen Text zu signieren. Signiert wird immer mit dem privaten Schl\u00fcssel eines Schl\u00fcsselpaares. Aus den privaten Schl\u00fcssel, f\u00fcr deren korrespondierenden \u00f6ffentlichen Schl\u00fcssel Sie bereits Zertifikate ausgestellt bekommen haben, k\u00f6nnen Sie in der Dropdownliste ausw\u00e4hlen. Der Text oder die Datei wird mit dem ausgew\u00e4hlten Schl\u00fcssel signiert. Die signierten Daten und die dazugeh\u00f6rige Signatur stehen danach in der Ansicht "2. Benutzer" zur \u00dcberpr\u00fcfung zur Verf\u00fcgung.\n\n
SignCert_exp_txt1=Wenn Sie genauer wissen wollen, was beim Erstellen einer Signatur mathematisch passiert, k\u00f6nnen Sie mittels "Visualisiert signieren" in ein JCrypTool-Plugin wechseln, das sich genauer mit Signaturen auseinandersetzt. Die Daten und Signaturen, die Sie in diesem Plugin erstellen, stehen danach ebenfalls in der Ansicht "2. Benutzer" zur Verf\u00fcgung.
SignCert_get_file_btn=Datei ausw\u00e4hlen...
SignCert_or_headline=oder
SignCert_sig_headline=Text oder Datei signieren
SignCert_sign_with_key_btn=Mit ausgew\u00e4hltem Schl\u00fcssel signieren
SignCert_visualized_sig_btn=Signiervorgang visualisieren
