Func_allSteps=Alle Schritte hintereinander
Func_alpha=Alpha:
Func_analyseCreated=Neuen Analysetext erstellen
Func_analyseGiven=Vorhandenen Text verwenden
Func_analysis=Geheimtexteingabe
Func_animation=Animation
Func_antAnalysis=Ameisen-Steuerung
Func_analysisType=Detailstufe
Func_beta=Beta:
Func_cycle=Bis zum letzten Knoten
Func_doWithNewAnt=Neue Ameisen losschicken
Func_encryption=Geheimtexterzeugung
Func_possibleInputs=Texteingabeart
Func_textLanguage=Sprache des Textes
Func_error=Fehler bei der Ausf\u00fchrung des Tutorials\!
Func_evap=Verdunstung:
Func_initial_plaintext=Ein guter Klartext
Func_keyLength=Vermutete Schl\u00fcssell\u00e4nge
Func_newAnt=Neue Ameise platzieren
Func_permutation=Permutation:
Func_ciphertext=Geheimtext direkt eingeben
Func_general=Allgemein
Func_keytext=Schl\u00fcssel:
Func_oneStep=Knoten f\u00fcr Knoten
Func_proceed=Weiter
Func_proceedToAnalysis=Analyse starten
Func_stopAnalysis=Analyse stoppen
Func_reset=Zur\u00fccksetzen
Func_analyseConfiguration=Konfiguration
Func_analyseGroupLabel=Analyse
Func_step=Zum n\u00e4chsten Knoten
Func_settings=Algorithmus-Einstellungen
Info_description1=In dieser Visualisierung wird die Kryptoanalyse von einfachen Transpositions-Verschl\u00FCsselungen (Permutations-Chiffren) mit Hilfe eines Ameisen-Algorithmus veranschaulicht.  \n\nDaf\u00FCr wird zun\u00E4chst die Verschl\u00FCsselung des Klartextes mit einer Permutationschiffre dargestellt. Hierbei wird der Klartext in eine Matrix geschrieben. Die Schl\u00FCssell\u00E4nge gibt die Anzahl der Spalten der Matrix an. Ist die letzte Zeile nicht vollst\u00E4ndig (weil die Textl\u00E4nge kein Vielfaches der Schl\u00FCssell\u00E4nge ist) werden die restlichen Spalten darin mit zuf\u00E4lligen Zeichen aufgef\u00FCllt. \n\n Den Geheimtext erh\u00E4lt man, indem man entsprechend der Permutation die Spalten nacheinander ausliest. Indem man den Permutationsschl\u00FCssel \u00E4ndert, kann man das Ergebnis der Verschl\u00FCsselung variieren. \n\n Um die Analyse auch graphisch darstellen lassen zu k\u00F6nnen, muss eine Schl\u00FCssell\u00E4nge von 3 - 5 gew\u00E4hlt werden.
Info_description2=Nun geht es weiter mit der Kryptoanalyse mit Hilfe des Ameisen-Algorithmus. \n\n Anhand der Schl\u00FCssell\u00E4nge werden zun\u00E4chst die Spalten der Verschl\u00FCsselungsmatrix rekonstruiert und hieraus ein Graph erstellt, wobei jeder Knoten einer Spalte entspricht. \n\nDie Schl\u00FCssell\u00E4nge l\u00E4sst sich relativ leicht mit statistischen Tests ermitteln, wohingegen die Rekombination der so erhaltenen Spalten den komplizierten Teil der Kryptoanalyse darstellt. Hier setzt der Ameisen-Algorithmus an. Als erstes wird eine Ameise zuf\u00E4llig auf einen der Knoten des Graphen gesetzt.
Info_description3=Jeder Weg durch den Graphen, der alle Knoten genau einmal enth\u00E4lt, stellt einen m\u00F6glichen Schl\u00FCssel f\u00FCr die Entschl\u00FCsselung dar, indem in der Reihenfolge wie die Knoten passiert wurden die Spalten wieder zu einer Matrix zusammengef\u00FCgt werden und der Text zeilenweise ausgelesen wird.\n\nDie Wahrscheinlichkeit, mit der die Ameise zu einem der noch verbliebenen Knoten geht, h\u00E4ngt von zwei Ma\u00DFen ab.\n\nDie Bigramme, die durch die Konkatenationen der Spalten enstehen werden dem Vorkommen von den Bigrammen der ausgew\u00E4hlten Sprache verglichen. Wenn sich die Ameise beispielsweise bei einer mit einem Q beginnenden Spalte befindet, bekommt eine Spalte, die mit einem U beginnt, eine h\u00F6here Bewertung als eine, die mit einem X beginnt, da die Kombination QU deutlich h\u00E4ufiger vorkommt als QX.\n\nDar\u00FCber hinaus sind allen Kanten im Graphen Werte zugeordnet, die ver\u00E4ndert werden nachdem eine Ameise alle Knoten passiert hat. Aufgrund der Analogie zu echten Ameisen spricht man in diesem Zusammenh\u00E4ngen von Pheromonwerten.\nMit den Schiebereglern Alpha (Pheromon) und Beta (Bigramme) k\u00F6nnen die Einfl\u00FCsse der beiden Ma\u00DFe auf die Wegwahl der Ameise ver\u00E4ndert werden.\n\n
Info_description4=Sobald die Ameise ihren Weg durch den Graphen vollendet hat, wird die erhaltene L\u00F6sung bewertet. Hierf\u00FCr wird der erhaltene Text mit einer Wortliste bestehend aus h\u00E4ufigen deutschen W\u00F6rtern mit mindestens drei Buchstaben verglichen. Von den gefundenen W\u00F6rtern werden die Wortl\u00E4ngen quadriert, aufaddiert und durch die L\u00E4nge des Textes geteilt.\nDer so erhaltene Wert wird zu den Werten der Pheromonmatrix, die den Kanten des Weges, den die Ameise genommen hat, entsprechen, addiert. Dar\u00FCber hinaus erfolgt eine Reduktion aller Werte. Dieses entspricht im nat\u00FCrlichen Vorbild der Verdunstung des Pheromons. Auch hierf\u00FCr ist ein Schieberegler vorhanden um die Auswirkungen dieses Parameters zu verdeutlichen. Um zu sehen, wie sich die Pheromonmatrix weiter ver\u00E4ndert, k\u00F6nnen nun weitere Ameisen auf ihre Reise geschickt werden.
Show_decryptedBestKnown=Beste bisherige Entschl\u00fcsselung:
Show_decryptedByAnt1=Anzahl losgeschickter Ameisen:
Show_encryptedText=Verschl\u00fcsselter Text:
Show_encryptionKey=Der gefundene Schl\u00fcssel ist f\u00fcr die Entschl\u00fcsselung\!\nDer entsprechende Verschl\u00fcsselungsschl\u00fcssel lautet:
Show_permutationMatrix=Permutationsmatrix
Show_pheromoneMatrix=Pheromonmatrix
Show_wrongInputTextSize=Die Textl\u00E4nge muss ein vielfaches der Schl\u00FCssell\u00E4nge sein. 
Description_title=Bedienung
Description_tooltip=N\u00E4here Informationen
Func_radioCompleteRound=Mehrere Durchl\u00E4ufe
Control_language1=Deutsch
Control_language2 = Englisch
Control_language_own = Wortliste aus Datei laden
Control_language1_short = de
Control_language2_short = en
Control_generateText = Geheimtext erzeugen
Analysis_multipleCycles = Anzahl an Ameisen
Visual_graphVisualRadio = Visualisierung als Graph
Visual_matrixVisualRadio = Pheromonmatrix anzeigen
Header_title = Ameisenkolonie-Optimierung (ACO)
Header_text = Diese Visualisierung verdeutlicht, wie die Ameisenkolonie-Optimierung verf\u00e4hrt, um einen mit dem Transpositionsverfahren verschl\u00fcsselten Text wieder zu entschl\u00fcsseln. \nAnschaulich betrachtet wird zum Entschl\u00fcsseln ein Graph erzeugt: Die Anzahl der Knoten entspricht der Schl\u00fcssell\u00e4nge des Verfahrens. Die Zeichen des Geheimtextes werden dann auf die Knoten des Graphen verteilt. \nEin Knoten des Graphen wird zuf\u00e4llig ausgew\u00e4hlt, als besucht markiert, und die \u00dcbergangswahrscheinlichkeiten zu den bisher unbesuchten Knoten werden anhand "lokaler Informationen" berechnet. \nBasierend auf den \u00dcbergangswahrscheinlichkeiten wird dann ein bisher unbesuchter Knoten ausgew\u00e4hlt und die Iteration beginnt von vorne, bis alle Knoten besucht sind. Dadurch entsteht ein Pfad im Graphen. \nDurch Aneinanderreihen der Zeichen entlang des gefundenen Pfades im Graphen entsteht ein m\u00f6glicher Klartext. \nIn jedem Durchlauf entsteht ein Kandidat f\u00fcr einen Klartext. Werden viele Durchl\u00e4ufe durchgef\u00fchrt, sollte der urspr\u00fcngliche Klartext die h\u00f6chste Wahrscheinlichkeit haben. \nIn die "lokalen Informationen" zur Berechnung der \u00dcbergangswahrscheinlichkeiten flie\u00dfen auch Informationen \u00fcber vorher gew\u00e4hlte Pfade ein. Daher spricht man in Analogie zu der Orientierung von Ameisen \nvon der Ameisenkolonie-Optimierung.  
Control_or=oder
Control_textLength=Geheimtextl\u00E4nge: 
Control_wrongInputToolTip=Es sind nur Gro\u00DFbuchstaben von A-Z erlaubt. \nKeine Sonderzeichen und keine Leerzeichen! \nKleinbuchstaben werden automatisch konvertiert.
Viusal_ResultGroup = Ergebnis
Visual_GraphMatrixGroupTitle = Visualisierung
Viusal_CurrAntGroup = Aktuelle Entschl\u00FCsselung
Result_currEncryptionLbl = Klartext der aktuellen Ameise
Result_bestEncryptionLbl = Bester gefundener Klartext insgesamt
Viusal_BestAntGroup = Beste Entschl\u00FCsselung
Result_emptyText1 = In dieser Komponente wird sp\u00E4ter
Result_emptyText2 = das Ergebnis des Algorithmus angezeigt.
PherMatrix_knotContent = Zeichen in den Knoten
Result_currTrailLbl = Schl\u00fcssel zur Entschlüsselung
Analysis_newAntButtonToolTip = Die neue Ameise kann jetzt wieder mit \n\u201EBis zum letzten Knoten\u201D oder \u201EZum n\u00E4chsten Knoten\u201D losgeschickt werden. 
graph_probHintLbl = Die Prozentzahlen an den einzelnen Ziel-Knoten des Graphens stellen die \n\u00DCbergangswahrscheinlichkeiten vom aktuell besuchten Knoten zum entsprechenden Zielknoten dar.
PherMatrix_description = Die Eintr\u00E4ge der Pheromonmatrix repr\u00E4sentieren Kantenbewertungen, \njeder Eintrag entspricht genau dem Gewicht einer Kante im Graph.
Result_description = Der m\u00F6gliche Klartext setzt sich wieder durch Auslesen der Zeichen \nin den Knoten des Graphens zusammen. Ausgelesen wird entlang \ndes Pfades, den die Ameise genommen hat. \n\nDer Pfad entspricht dem Schl\u00fcssel zur Entschl\u00fcsselung, jede Zahlen \nsteht f\u00fcr den entsprechenden Knoten im Graph.
Desc_configComp_left = Im ersten Schritt muss zun\u00E4chst ein Geheimtext zur Analyse gew\u00E4hlt werden. \nDieser kann direkt eingegeben oder mit dem Wizard \u201EGeheimtext erzeugen\u201D aus einem Klartext erzeugt werden.  \n\n  \u2022 Vermutete Schl\u00FCssell\u00E4nge n  [n \u2208 \u2115; 3 \u2264 n \u2264 9]:\n    \u2012 Die L\u00E4nge des Schl\u00FCssels, der bei der Verschl\u00FCsselung benutzt wurde. \n    \u2012 Entspricht der Anzahl der Knoten im Analysegraphen.
Desc_configComp_right = \u2022 Sprache des Textes:\n    \u2012 Bei der Analyse werden Buchstabenbigramme mit den H\u00E4ufigkeiten, mit denen sie in der gew\u00e4hlten\n       Sprache vorkommen, verglichen. Die Auswahlbox legt die Sprache fest.\n\n\u2022 Analyse starten:\n    \u2012 Der Button wird aktiv, sobald die Geheimtextl\u00E4nge gr\u00F6\u00DFer oder gleich der vermuteten Schl\u00FCssell\u00E4nge ist.
Desc_analysisComp_left = \u2022 Knoten f\u00FCr Knoten [aktiv f\u00FCr Schl\u00FCssell\u00E4ngen n: 3 \u2264 n \u2264 5]:\n    \u2012 Der Weg einer Ameise im Graphen kann Knoten f\u00FCr Knoten beobachtet werden.\n\n\u2022 Mehrere Durchl\u00E4ufe [automatisch aktiv f\u00FCr Schl\u00FCssell\u00E4ngen n: 6 \u2264 n \u2264 9]:\n    \u2012 Es k\u00F6nnen mehrere Ameisen gleichzeitig losgeschickt werden.\n\n\u2022 Animation [aktiv f\u00FCr Schl\u00FCssell\u00E4ngen n: 3 \u2264 n \u2264 5]:\n    \u2012 Aktiviert Animationen.
Desc_analysisComp_right = \u2022 Zum n\u00E4chsten Knoten:\n    \u2012 Der Pfad der Ameise wird zuf\u00E4llig um einen weiteren Knoten erweitert.\n\n\u2022 Bis zum letzten Knoten:\n    \u2012 Die Ameise setzt ihren Weg durch den Graphen fort, bis jeder Knoten besucht ist.\n\n\u2022 Neue Ameise platzieren [aktiv, sobald eine Ameise ihren Pfad beendet hat]:\n    \u2012 Eine Ameise wird auf einen neuen Knoten gesetzt und ein neuer Pfad (neue Entschl\u00FCsselung) wird angefangen.
Desc_analysisCompMulti_right = \u2022 Neue Ameisen losschicken:\n    \u2012 Startet einen neuen Durchlauf mit der festgelegten Anzahl an Ameisen.\n\n\u2022 Anzahl an Ameisen:\n    \u2012 Legt die Anzahl an Ameisen fest, die mit einem Mal losgeschickt werden.
Desc_analysisAlgoSett_left = In der Gruppe Algorithmus-Einstellungen k\u00F6nnen Parameter des Algorithmus festgelegt werden. \nDiese ver\u00E4ndern die \u00DCbergangswahrscheinlichkeiten von Knoten zu Knoten und damit unter anderem \ndie Konvergenz des Verfahrens.  \n\n  \u2022 Alpha  [x \u2208 [0,1]]:\n    \u2012  Bei jedem Durchlauf hinterl\u00E4sst die Ameise an jeder besuchten Kante ein Pheromon.\n        Nachfolgende Ameisen richten sich nach dem Pheromon, sie w\u00E4hlen Kanten mit h\u00F6herem Pheromonwert \n        eher aus. Der Wert Alpha regelt, wieviel Einfluss die Pheromone auf die Ameise haben.  
Desc_analysisAlgoSett_right = \u2022 Beta  [x \u2208 [0,1]]:\n    \u2012  Dieser Parameter regelt die Gewichtung von den Wahrscheinlichkeiten der Buchstabenbigramme, die entlang\n        der Kante entstehen. Ist der Parameter hoch eingestellt, geht die Ameise eher einen Weg, bei dem die\n        Buchstabenbigramme in der ausgew\u00E4hlten Sprache wahrscheinlicher sind.\n\n  \u2022 Verdunstung  [x \u2208 [0,1]]:\n    \u2012  Eine niedriger Verdunstungparameter bedeutet, dass Ameisen, die weit sp\u00E4ter folgen das Pheromon der\n        aktuellen Ameise noch lange wahrnehmen werden.
Control_noVisualAvailable = Bis Schl\u00fcssell\u00e4ngen der Gr\u00f6\u00dfe 5 kann das Verfahren in einem Graphen visualisiert werden.\nF\u00fcr l\u00e4ngere Schl\u00fcssel kann dann nur noch die Pheromonmatrix angezeigt werden.
