Func_allSteps=Alle Schritte hintereinander
Func_alpha=Alpha:
Func_analyseCreated=Neuen Analysetext erstellen
Func_analyseGiven=Vorhandenen Text verwenden
Func_analysis=Geheimtexteingabe
Func_animation=Animation
Func_antAnalysis=Ameisen-Steuerung
Func_analysisType=Detailstufe
Func_beta=Beta:
Func_cycle=Bis zum letzten Knoten
Func_doWithNewAnt=Durchlauf mit neuer Ameise
Func_encryption=Geheimtexterzeugung
Func_possibleInputs=Texteingabeart
Func_textLanguage=Sprache des Textes
Func_error=Fehler bei der Ausf\u00fchrung des Tutorials\!
Func_evap=Verdunstung:
Func_initial_plaintext=Ein guter Klartext
Func_keyLength=Schl\u00fcssell\u00e4nge:
Func_newAnt=Neue Ameise platzieren
Func_permutation=Permutation:
Func_plaintext=Klartext:
Func_ciphertext=Verschl\u00fcsselter Text:
Func_general=Allgemein
Func_keytext=Schl\u00fcssel:
Func_oneStep=Knoten f\u00fcr Knoten
Func_proceed=Weiter
Func_proceedToAnalysis=Analyse starten
Func_reset=Zur\u00fccksetzen
Func_analyseConfiguration=Konfiguration
Func_analyseGroupLabel=Analyse
Func_step=Schritt
Func_settings=Algorithmus-Einstellungen
Info_description1=In dieser Visualisierung wird die Kryptoanalyse von einfachen Transpositions-Verschl\u00FCsselungen (Permutations-Chiffren) mit Hilfe eines Ameisen-Algorithmus veranschaulicht.  \n\nDaf\u00FCr wird zun\u00E4chst die Verschl\u00FCsselung des Klartextes mit einer Permutationschiffre dargestellt. Hierbei wird der Klartext in eine Matrix geschrieben. Die Schl\u00FCssell\u00E4nge gibt die Anzahl der Spalten der Matrix an. Ist die letzte Zeile nicht vollst\u00E4ndig (weil die Textl\u00E4nge kein Vielfaches der Schl\u00FCssell\u00E4nge ist) werden die restlichen Spalten darin mit zuf\u00E4lligen Zeichen aufgef\u00FCllt. \n\n Den Geheimtext erh\u00E4lt man, indem man entsprechend der Permutation die Spalten nacheinander ausliest. Indem man den Permutationsschl\u00FCssel \u00E4ndert, kann man das Ergebnis der Verschl\u00FCsselung variieren. \n\n Um die Analyse auch graphisch darstellen lassen zu k\u00F6nnen, muss eine Schl\u00FCssell\u00E4nge von 3 - 5 gew\u00E4hlt werden.
Info_description2=Nun geht es weiter mit der Kryptoanalyse mit Hilfe des Ameisen-Algorithmus. \n\n Anhand der Schl\u00FCssell\u00E4nge werden zun\u00E4chst die Spalten der Verschl\u00FCsselungsmatrix rekonstruiert und hieraus ein Graph erstellt, wobei jeder Knoten einer Spalte entspricht. \n\nDie Schl\u00FCssell\u00E4nge l\u00E4sst sich relativ leicht mit statistischen Tests ermitteln, wohingegen die Rekombination der so erhaltenen Spalten den komplizierten Teil der Kryptoanalyse darstellt. Hier setzt der Ameisen-Algorithmus an. Als erstes wird eine Ameise zuf\u00E4llig auf einen der Knoten des Graphen gesetzt.
Info_description3=Jeder Weg durch den Graphen, der alle Knoten genau einmal enth\u00E4lt, stellt einen m\u00F6glichen Schl\u00FCssel f\u00FCr die Entschl\u00FCsselung dar, indem in der Reihenfolge wie die Knoten passiert wurden die Spalten wieder zu einer Matrix zusammengef\u00FCgt werden und der Text zeilenweise ausgelesen wird.\n\nDie Wahrscheinlichkeit, mit der die Ameise zu einem der noch verbliebenen Knoten geht, h\u00E4ngt von zwei Ma\u00DFen ab.\n\nDie Bigramme, die durch die Konkatenationen der Spalten enstehen werden dem Vorkommen von den Bigrammen der ausgew\u00E4hlten Sprache verglichen. Wenn sich die Ameise beispielsweise bei einer mit einem Q beginnenden Spalte befindet, bekommt eine Spalte, die mit einem U beginnt, eine h\u00F6here Bewertung als eine, die mit einem X beginnt, da die Kombination QU deutlich h\u00E4ufiger vorkommt als QX.\n\nDar\u00FCber hinaus sind allen Kanten im Graphen Werte zugeordnet, die ver\u00E4ndert werden nachdem eine Ameise alle Knoten passiert hat. Aufgrund der Analogie zu echten Ameisen spricht man in diesem Zusammenh\u00E4ngen von Pheromonwerten.\nMit den Schiebereglern Alpha (Pheromon) und Beta (Bigramme) k\u00F6nnen die Einfl\u00FCsse der beiden Ma\u00DFe auf die Wegwahl der Ameise ver\u00E4ndert werden.
Info_description4=Sobald die Ameise ihren Weg durch den Graphen vollendet hat, wird die erhaltene L\u00F6sung bewertet. Hierf\u00FCr wird der erhaltene Text mit einer Wortliste bestehend aus h\u00E4ufigen deutschen W\u00F6rtern mit mindestens drei Buchstaben verglichen. Von den gefundenen W\u00F6rtern werden die Wortl\u00E4ngen quadriert, aufaddiert und durch die L\u00E4nge des Textes geteilt.\nDer so erhaltene Wert wird zu den Werten der Pheromonmatrix, die den Kanten des Weges, den die Ameise genommen hat, entsprechen, addiert. Dar\u00FCber hinaus erfolgt eine Reduktion aller Werte. Dieses entspricht im nat\u00FCrlichen Vorbild der Verdunstung des Pheromons. Auch hierf\u00FCr ist ein Schieberegler vorhanden um die Auswirkungen dieses Parameters zu verdeutlichen. Um zu sehen, wie sich die Pheromonmatrix weiter ver\u00E4ndert, k\u00F6nnen nun weitere Ameisen auf ihre Reise geschickt werden.
Show_decryptedBestKnown=Beste bisherige Entschl\u00fcsselung:
Show_decryptedByAnt1=Ameise Nr.
Show_decryptedByAnt2=entschl\u00fcsselt den Text zu:
Show_encryptedText=Verschl\u00fcsselter Text:
Show_encryptionKey=Der gefundene Schl\u00fcssel ist f\u00fcr die Entschl\u00fcsselung\!\nDer entsprechende Verschl\u00fcsselungsschl\u00fcssel lautet:
Show_permutationMatrix=Permutationsmatrix
Show_pheromoneMatrix=Pheromonmatrix
Show_wrongInputTextSize=Die Textl\u00E4nge muss ein vielfaches der Schl\u00FCssell\u00E4nge sein. 
Description_title=Beschreibung
Description_tooltip=N\u00E4here Informationen
Func_radioCompleteRound=Mehrere Durchl\u00E4ufe
Control_language1=Deutsch
Control_language2 = Englisch
Control_language1_short = de
Control_language2_short = en
Analysis_multipleCycles = Anzahl an Wiederholungen