ExtendedRSA_Visual_0=org.jcryptool.visual.extendedrsa.ExtendedRSAView
ExtendedRSA_Visual_1=Alice Whitehat
ExtendedRSA_Visual_10=Erkl\u00e4rungen
ExtendedRSA_Visual_11=RSA
ExtendedRSA_Visual_12=1234
ExtendedRSA_Visual_13=MpRSA
ExtendedRSA_Visual_14=RSA
ExtendedRSA_Visual_15=MpRSA
ExtendedRSA_Visual_16=1234
ExtendedRSA_Visual_17=RSA
ExtendedRSA_Visual_18=1234
ExtendedRSA_Visual_19=none
ExtendedRSA_Visual_2=Bob Whitehat
ExtendedRSA_Visual_20=unknown
ExtendedRSA_Visual_21=RSA
ExtendedRSA_Visual_22=1234
ExtendedRSA_Visual_23=MpRSA
ExtendedRSA_Visual_24=RSA
ExtendedRSA_Visual_25=MpRSA
ExtendedRSA_Visual_26=1234
ExtendedRSA_Visual_27=RSA
ExtendedRSA_Visual_28=1234
ExtendedRSA_Visual_29=none
ExtendedRSA_Visual_3=\ 
ExtendedRSA_Visual_30=unknown
ExtendedRSA_Visual_4=Erweitertes RSA-Kryptosystem (inklusive Identit\u00e4ten und multi-primem RSA)
ExtendedRSA_Visual_5=In diesem Plugin k\u00f6nnen Sie mit dem RSA-Verfahren verschiedene Aktionen durchf\u00fchren. Dazu agieren Sie im Namen unterschiedlicher Identit\u00e4ten. Sie k\u00f6nnen z.B. als 'Alice Whitehat' einen Text verschl\u00fcsseln und an 'Bob Whitehat' senden. Bob Whitehat kann dann die empfangene Nachricht entschl\u00fcsseln, und umgekehrt.
ExtendedRSA_Visual_6=Identit\u00e4ten-Verwaltung
ExtendedRSA_Visual_7=Neue Identit\u00e4t erstellen
ExtendedRSA_Visual_8=Identit\u00e4t ein-/ausblenden
ExtendedRSA_Visual_9=Identit\u00e4t l\u00f6schen
Identity_0=Die Identit\u00e4ten aus Ihrem Schl\u00fcsselspeicher werden in dieser Visualisierung als Tabs (Registerkarten) angezeigt. Schon bei der Auslieferung befinden sich die Identit\u00e4ten \u201EAlice Whitehat\u201C und \u201EBob Whitehat\u201C im Schl\u00fcsselspeicher und werden dehalb auch initial schon als Tabs angezeigt.\n\nJede Registerkarte stellt eine Identit\u00e4t dar. Durch den Button \u201EIdentit\u00e4ten ein-/ausblenden\u201C k\u00f6nnen bestehende Identit\u00e4ten als Registerkarten angezeigt oder ausgeblendet werden. Wenn eine neue Identit\u00e4t erstellt wird, wird diese erst als Registerkarte angezeigt, wenn Sie durch \u201EIdentit\u00e4ten ein-/ausblenden\u201C ausgew\u00e4hlt wurde\!\n\nZu allen Aktionen finden Sie in diesem Bereich Erl\u00e4uterungen.
Identity_1=Aktion: Nachricht verschl\u00fcsseln und senden\n\nF\u00fcr den Verschl\u00fcsselungsvorgang werden die Parameter N und e ben\u00f6tigt. Mehr Informationen zu den einzelnen Parametern finden Sie in der Registerkarte \u201EMeine Schl\u00fcssel\u201C unter der Aktion \u201ESchl\u00fcssel verwalten\u201C.\n\n Vorgehensweise:\n\n1) Geben Sie einen optionalen Betreff und eine beliebige Nachricht ein.\n\n2) W\u00e4hlen Sie einen Empf\u00e4nger aus (zum Beispiel Bob Whitehat). Hinweis: Diese Visualisierung erlaubt nur einen Empf\u00e4nger.\n\n3) W\u00e4hlen Sie einen \u00f6ffentlichen Schl\u00fcssel des Empf\u00e4ngers aus.\n\n4) Klicken Sie auf den Button \u201ENachricht verschl\u00fcsseln\u201C.\n\n5) Klicken Sie auf den Button \u201ENachricht senden\u201C, um die verschl\u00fcsselte Nachricht zu verschicken und im Nachrichtenspeicher abzulegen.
Identity_10=W\u00e4hlen Sie 2 verschiedene Primzahlen p und q, sowie einen Exponenten e:
Identity_100=p
Identity_101=q
Identity_102=r
Identity_103=d
Identity_104=e
Identity_105=N
Identity_106=Algorithmus
Identity_107=Format
Identity_108=p
Identity_109=q
Identity_11=W\u00e4hlen Sie 3 verschiedene Primzahlen p, q, r und einen Exponenten e:
Identity_110=r
Identity_111=s
Identity_112=d
Identity_113=e
Identity_114=N
Identity_115=Algorithmus
Identity_116=Format
Identity_117=p
Identity_118=q
Identity_119=r
Identity_12=W\u00e4hlen Sie 4 verschiedene Primzahlen p, q, r, s und einen Exponenten e:
Identity_120=s
Identity_121=t
Identity_122=d
Identity_123=e
Identity_124=N
Identity_125=Passwort eingeben:
Identity_126=Achtung: Noch keine Schl\u00fcssel f\u00fcr diese Identit\u00e4t vorhanden.
Identity_127=Parameter
Identity_128=Wert
Identity_129=Schl\u00fcssel verwalten
Identity_13=W\u00e4hlen Sie 5 verschiedene Primzahlen p, q, r, s, t und einen Exponenten e:
Identity_130=W\u00e4hlen Sie einen \u00f6ffentlichen Schl\u00fcssel: 
Identity_131=Mit Klick auf "Schl\u00fcssel attackieren" wird versucht, den Modulus N von 
Identity_132=\ zu faktorisieren:\nBitl\u00e4nge von N:
Identity_133= bit \n 
Identity_134=Schl\u00fcssel attackieren
Identity_135=Parameter
Identity_136=Wert
Identity_137=\u00d6ffentlichen Schl\u00fcssel angreifen
Identity_138=Display results
Identity_139=\nDie Faktorisierung war erfolgreich. Folgende Werte konnten in 
Identity_14=Hier k\u00f6nnen Sie neue Schl\u00fcssel mit g\u00e4ngigen Schl\u00fcsselgr\u00f6\u00dfen erstellen:
Identity_140=p
Identity_141=q
Identity_142=p
Identity_143=q
Identity_144=r
Identity_145=p
Identity_146=q
Identity_147=r
Identity_148=s
Identity_149=p
Identity_15=Hier k\u00f6nnen Sie sich Ihre Schl\u00fcsselpaare und die \u00f6ffentlichen Schl\u00fcssel aller Mitspieler ansehen. \n\nHinweis: Um einen Ihrer privaten Schl\u00fcssel anzuzeigen, m\u00fcssen Sie Ihr Passwort eingeben. Die Anzeige \u00f6ffentlicher Schl\u00fcssel (public keys) erfordert keine Passwort-Eingabe.
Identity_150=q
Identity_151=r
Identity_152=s
Identity_153=t
Identity_154=e
Identity_155=d
Identity_156=
Identity_157=
Identity_158=
Identity_159=Kein Betreff
Identity_16=Achtung: Momentan sind keine verschl\u00fcsselten Nachrichten verf\u00fcgbar.
Identity_160=3
Identity_161=65537
Identity_162=Aktionsfenster
Identity_163=Bitte w\u00e4hlen Sie eine Aktion f\u00fcr die Identit\u00e4t im aktuellen Tab (
Identity_164=), oder einen Button im Feld "Identit\u00e4ten-Verwaltung".
Identity_165=Aktionsfenster
Identity_166=Aktionsfenster
Identity_167=Aktionsfenster
Identity_168=17
Identity_169=Multi-primer RSA-Schl\u00fcssel wurde erfolgreich erstellt. Der geheime Exponent d ist: 
Identity_17=Achtung: 'p' ist keine Primzahl\!
Identity_170=Multi-primer RSA-Schl\u00fcssel wurde erfolgreich erstellt. Schl\u00fcsseldetails aufgrund der Gr\u00f6\u00dfe bitte im Tab 'Meine Schl\u00fcssel' betrachten.
Identity_171=MpRSA
Identity_172= Sekunden rekonstruiert werden:
Identity_173=N: 
Identity_174=Absender: 
Identity_175=Empf\u00e4nger: 
Identity_176=Schl\u00fcssel rekonstruieren
Identity_177=Der klassische RSA-Schl\u00fcssel wurde erfolgreich mit dem Passwort '1234' rekonstruiert und in den Schl\u00fcsselbund aufgenommen.
Identity_178=Der multi-prime Schl\u00fcssel wurde erfolgreich mit dem Passwort '1234' rekonstruiert und in den Schl\u00fcsselbund aufgenommen.
Identity_179=Hinweis: Der Wert des gew\u00e4hlten Parameters wird in die Zwischenablage kopiert.
Identity_18=Achtung: 'q' ist keine Primzahl\!
Identity_180=Hinweis: Das Standardpasswort f\u00fcr die privaten Schl\u00fcssel von Alice und Bob Whitehat oder von faktorisierten privaten Schl\u00fcsseln lautet '1234'.
Identity_19=Achtung: 'r' ist keine Primzahl\!
Identity_2=Aktion: Nachricht empfangen und entschl\u00fcsseln\n\nF\u00fcr den Entschl\u00fcsselungsvorgang werden die Parameter N und d ben\u00f6tigt. Mehr Informationen zu den einzelnen Parametern finden Sie in der Registerkarte \u201EMeine Schl\u00fcssel\u201C unter der Aktion \u201ESchl\u00fcssel verwalten\u201C.\n\nVorgehensweise:\n\n1) W\u00e4hlen Sie eine beliebige Nachricht aus dem Nachrichtenspeicher aus.\n\n2) W\u00e4hlen Sie einen Ihrer privaten Schl\u00fcssel aus, und geben Sie das entsprechende Passwort ein.\n\n3) Klicken Sie auf den Button \u201ENachricht entschl\u00fcsseln\u201C. Die Nachricht kann nur mit dem passenden privaten Schl\u00fcssel erfolgreich entschl\u00fcsselt werden.\n\n4) Klicken Sie auf den Button "Nachricht l\u00f6schen", um die verschl\u00fcsselte Nachricht aus dem Nachrichtenspeicher zu l\u00f6schen (nur f\u00fcr den tats\u00e4chlichen Empf\u00e4nger m\u00f6glich).
Identity_20=Achtung: 's' ist keine Primzahl\!
Identity_21=Achtung: 't' ist keine Primzahl\!
Identity_22=Achtung: 'e' ist kein passender Exponent ('e' muss zwischen 3 und phi(N) bzw. 65537 liegen)\!
Identity_222=Achtung: Der 'ggt' von 'e' und 'phi(N)' ist ungleich 1 (Der 'ggt' muss 1 sein)\!
Identity_23=Achtung: Bitte verschiedene Primzahlen ausw\u00e4hlen\!
Identity_24=Achtung: Bitte eine gr\u00f6\u00dfere Primzahl als 13 eingeben\!
Identity_25=Achtung: Es ist noch kein angreifbarer Schl\u00fcssel im Schl\u00fcsselspeicher.
Identity_26=
Identity_27=\ - 
Identity_28=Aktionen:
Identity_29=Betreff der Nachricht:
Identity_3=Die Nachricht wurde erfolgreich in den Nachrichtenspeicher aufgenommen. Sie k\u00f6nnen nun eine neue Nachricht verschl\u00fcssen und senden oder sich die verschl\u00fcsselte Nachricht beim Empf\u00e4nger ansehen.
Identity_30=Nachricht:
Identity_31=Verschl\u00fcsselte Nachricht (hexadezimale Darstellung):
Identity_32=Empf\u00e4nger:
Identity_33=Nachricht senden
Identity_34=Schl\u00fcssel ausw\u00e4hlen:
Identity_35=Nachricht verschl\u00fcsseln
Identity_36=Nachricht verschl\u00fcsseln und senden
Identity_37=Nachricht ausw\u00e4hlen: 
Identity_38=Verschl\u00fcsselte Nachricht (hexadezimale Darstellung):
Identity_39=Entschl\u00fcsselte Nachricht:
Identity_4=Die Nachricht wurde nun endg\u00fcltig aus dem Nachrichtenspeicher gel\u00f6scht. Falls f\u00fcr diese Identit\u00e4ten weitere Nachrichten im Nachrichtenspeicher existieren, k\u00f6nnen Sie sich diese nun ansehen. Andernfalls m\u00fcssen Sie vorher weitere Nachrichten verschl\u00fcsseln und an diese Identit\u00e4t senden.
Identity_40=Schl\u00fcssel ausw\u00e4hlen:
Identity_41=Nachricht l\u00f6schen
Identity_42=Passwort eingeben:
Identity_43=Nachricht entschl\u00fcsseln
Identity_44=Nachricht empfangen und entschl\u00fcsseln
Identity_45=Neuen Schl\u00fcssel erstellen
Identity_46=RSA
Identity_47=p:
Identity_48=q:
Identity_49=e:
Identity_5=Das eingegebene Passwort f\u00fcr den selektierten privaten Schl\u00fcssel ist falsch\!
Identity_50=Zuf\u00e4lliges 'e' w\u00e4hlen
Identity_51=Multi-primer RSA
Identity_52=Anzahl der Primzahlen (3-5):
Identity_53=p:
Identity_54=q:
Identity_55=r:
Identity_56=s:
Identity_57=t:
Identity_58=e:
Identity_59=Zuf\u00e4lliges 'e' w\u00e4hlen
Identity_6=Aktion: Schl\u00fcssel verwalten - Neuen Schl\u00fcssel erstellen\n\nHier kann ein Schl\u00fcssel mit ausgew\u00e4hlten Parametern erstellt werden. Der RSA-Algorithmus ist in zwei Varianten implementiert:\n\n1) F\u00fcr den klassischen RSA-Algorithmus werden zwei verschiedene Primzahlen p und q ben\u00f6tigt. Diese k\u00f6nnen entweder ausgew\u00e4hlt oder eingegeben werden. Sofern p und q zul\u00e4ssig sind, kann ein Exponent e ausgesucht, eingegeben oder generiert werden.\n\n2) Beim \u201Emulti-primen RSA\u201C muss zuerst die Anzahl der Primzahlen (zwischen 3 und 5) festgelegt werden. Die Parameter k\u00f6nnen hier analog zum klassischen RSA angegeben werden.\n\nAm Ende der Schl\u00fcsselerzeugung muss ein Passwort f\u00fcr den privaten Schl\u00fcssel festgelegt werden.\n\nKlicken Sie auf den Button \u201ESchl\u00fcssel erstellen\u201C, um den neuen Schl\u00fcssel mit den gew\u00e4hlten Parametern im Schl\u00fcsselspeicher abzulegen.
Identity_60=Passwort eingeben:
Identity_61=Passwort wiederholen:
Identity_62=Schl\u00fcssel erstellen
Identity_63=Klassischer RSA-Schl\u00fcssel wurde erfolgreich erstellt. Der geheime Exponent d ist: 
Identity_64=.
Identity_65=Klassischer RSA-Schl\u00fcssel wurde erfolgreich erstellt. Schl\u00fcsseldetails aufgrund der Gr\u00f6\u00dfe bitte im Tab 'Meine Schl\u00fcssel' betrachten.
Identity_66=Neuen Schl\u00fcssel erstellen (erweitert)
Identity_67=RSA
Identity_68=Schl\u00fcssell\u00e4nge w\u00e4hlen:
Identity_69=1024
Identity_7=Aktion: Schl\u00fcssel verwalten - Neuen Schl\u00fcssel erstellen (erweitert)\n\nIn dieser Registerkarte k\u00f6nnen Schl\u00fcssel mit aktuell verwendeten Schl\u00fcssell\u00e4ngen erstellt werden. Es muss nur die gew\u00fcnschte Schl\u00fcssell\u00e4nge bzw. die Anzahl der Primzahlen ausgew\u00e4hlt werden.\n\nAm Ende der Schl\u00fcsselerzeugung muss ein Passwort f\u00fcr den privaten Schl\u00fcssel festgelegt werden.\n\nKlicken Sie auf den Button \u201ESchl\u00fcssel erstellen\u201C, um den neuen Schl\u00fcssel mit den gew\u00e4hlten Parametern im Schl\u00fcsselspeicher abzulegen.
Identity_70=2048
Identity_71=Multi-primer RSA
Identity_72=Anzahl der Primzahlen (3-5):
Identity_73=Schl\u00fcssell\u00e4nge w\u00e4hlen:
Identity_74=1024
Identity_75=2048
Identity_76=Passwort eingeben:
Identity_77=Passwort wiederholen:
Identity_78=Schl\u00fcssel erstellen
Identity_79=RSA
Identity_8=Aktion: Schl\u00fcssel verwalten - Meine Schl\u00fcssel\n\nEin Schl\u00fcsselpaar besteht aus einem \u201Eprivaten Schl\u00fcssel\u201C und einem \u201E\u00f6ffentlichen Schl\u00fcssel\u201C:\n\na) Der private Schl\u00fcssel (N, d):\n- Der Modulus N ist sowohl Teil des \u00f6ffentlichen wie des privaten Schl\u00fcssels.\n- Der private Exponent d muss geheim gehalten werden. Er ergab sich aus der Berechnung e^(-1) modulo phi(N).\n\nb) Der \u00f6ffentliche Schl\u00fcssel (N, e):\n- Der Modulus N ist sowohl Teil des \u00f6ffentlichen wie des privaten Schl\u00fcssels.\n- Der \u00f6ffentliche Exponent e (er befindet sich \u00fcblicherweise im Bereich von 17 \u2013 65537) muss relativ prim zu phi(N) sein.\n\nBeim \u201Emulti-primen\u201C RSA-Verfahren k\u00f6nnen mehr als zwei Primzahlen gew\u00e4hlt werden. In diesem Plugin ist die Anzahl auf drei bis f\u00fcnf Primzahlen beschr\u00e4nkt. Theoretisch ist die Anzahl jedoch nach oben offen.
Identity_80=Klassischer RSA-Key erfolgreich erstellt. Schl\u00fcsseldetails aufgrund der Gr\u00f6\u00dfe bitte im Tab 'Meine Schl\u00fcssel' betrachten.
Identity_81=Meine Schl\u00fcssel
Identity_82=Schl\u00fcssel ausw\u00e4hlen:
Identity_83=PublicKey
Identity_84=Schl\u00fcsseldaten anzeigen
Identity_85=Algorithmus
Identity_86=Format
Identity_87=e
Identity_88=N
Identity_89=RSA
Identity_9=Aktion: \u00d6ffentlichen Schl\u00fcssel angreifen\n\nIn dieser Registerkarte k\u00f6nnen Sie versuchen, einen \u00f6ffentlichen Schl\u00fcssel anzugreifen. Wenn der Modulus N kurz genug ist (weniger als 256 bit L\u00e4nge), wird es m\u00f6glich sein, N in "endlicher Zeit" zu faktorisieren. Die Faktorisierung liefert die verwendeten Primzahlen, und mit diesen kann der geheime Schl\u00fcssel d rekonstruiert werden. Somit k\u00f6nnen Sie sich als der tats\u00e4chliche Schl\u00fcsselbesitzer ausgeben und eventuell Nachrichten lesen, die f\u00fcr den eigentlichen Schl\u00fcsselbesitzer bestimmt sind.\n\nAchtung: Das Faktorisieren kann viel Zeit in Anspruch nehmen. Mit aktueller Hardware werden Sie N mit einer Bitl\u00e4nge von ca. 64 bit in einer Stunde faktorisieren k\u00f6nnen (getestet mit einem Notebook mit Intel Core i5 2.4Ghz und 8GB RAM).\n\nDa die Sicherheit von RSA auf langen Schl\u00fcsseln beruht (bei denen der Faktorisierungsvorgang mehrere Jahre dauern w\u00fcrde), wird empfohlen, zum Verschl\u00fcsseln/Signieren Schl\u00fcssel gr\u00f6\u00dfer als 1024 bit L\u00e4nge zu verwenden.
Identity_90=Algorithmus
Identity_91=Format
Identity_92=p
Identity_93=q
Identity_94=d
Identity_95=e
Identity_96=N
Identity_97=\ 
Identity_98=Algorithmus
Identity_99=Format
IdentityManager_0=PLACEHOLDER
IdentityManager_1=create new keypair
IdentityManager_10=InvocationTargetException while generating a key pair
IdentityManager_11=\ (OID: 
IdentityManager_12=)
IdentityManager_13=\ 
IdentityManager_14=RSA
IdentityManager_15=\ - 
IdentityManager_16=Bit - 
IdentityManager_17=PublicKey - KeyID:
IdentityManager_18=\ - 
IdentityManager_19=Bit - 
IdentityManager_2=NoSuchAlgorithmException while generating a key pair
IdentityManager_20=\ KeyID: 
IdentityManager_21=Schl\u00fcsselpaar: 
IdentityManager_22= gebrochen von:  
IdentityManager_23=\ - 
IdentityManager_24=Bit - 
IdentityManager_25=\ 
IdentityManager_26=\ - 
IdentityManager_27=Bit - 
IdentityManager_28=\ - KeyID:
IdentityManager_3=InvalidAlgorithmParameterException while generating a key pair
IdentityManager_4=SecurityException while generating a key pair
IdentityManager_5=IllegalArgumentException while generating a key pair
IdentityManager_6=ClassNotFoundException while generating a key pair
IdentityManager_7=NoSuchMethodException while generating a key pair
IdentityManager_8=InstantiationException while generating a key pair
IdentityManager_9=IllegalAccessException while generating a key pair
