ECDHComposite.0=Animation nicht anzeigen
ECDHComposite.1=Dialoge nicht anzeigen
ECDHComposite.160=Fehler
ECDHComposite.161=Ergebnisse konnten nicht in der Datei gespeichert werden\!\n
ECDHComposite.2=In Editor speichern
ECDHComposite.3=In Datei speichern
ECDHComposite.4=Neu starten
ECDHComposite.5=Zeige Info-Popups
ECDHComposite.6=Zeige Animationen
ECDHComposite.settingsGroupTitle=Einstellungen
ECDHView.title=Diffie-Hellman Schl\u00fcsselaustausch-Demonstration mit elliptischen Kurven
ECDHView.description=Den n\u00E4chsten Schritt erreichen Sie durch Klick auf den aktiven roten Button. Alte Einstellungen k\u00f6nnen durch Klick auf die gr\u00fcnen Buttons ge\u00E4ndert werden.\nDie Demonstration zeigt wie sich Alice und Bob mit dem Verfahren auf einen gemeinsamen Schl\u00fcssel einigen k\u00f6nnen.
ECDHView.groupMain=Schl\u00fcsselaustausch
ECDHView.logHeader=Diffie-Hellman mit Elliptischen Kurven Ergebnisse:
ECDHView.curve=Kurve
ECDHView.AliceParameters=Alice's Parameter
ECDHView.BobParameters=Bob's Parameter
ECDHView.secretKey=Geheimer Schl\u00fcssel
ECDHView.sharedKey=Gemeinsamer Schl\u00fcssel
ECDHView.commonKey=Gemeinsamer Sitzungsschl\u00fcssel
ECDHView.setPublicParameters=\u00d6ff. Parameter einstellen
ECDHView.chooseSecrets=Geheimnisse ausw\u00E4hlen
ECDHView.createSharedKeys=Gem. Schl\u00fcssel erzeugen
ECDHView.exchangeSharedKeys=Gem. Schl\u00fcssel tauschen
ECDHView.generateCommonKey=Sitzungsschl\u00fcssel erzeugen
ECDHView.groupParameters=\u00d6ffentliche Parameter
ECDHView.labelCurve=Elliptische Kurve =
ECDHView.labelGenerator=Generator G =
ECDHView.secret=Geheimnis
ECDHView.calculate=Berechnen
ECDHView.Step1=Schritt 1\nWählen Sie die öffentlichen Parameter des Verfahrens. Es wird eine elliptische Kurve sowie ein Generator davon benötigt.
ECDHView.Step2=\n\nSchritt 2\nAlice und Bob m\u00fcssen nun ihre Geheimnisse w\u00E4hlen. Klicken Sie auf den \"Geheimnis\" Button um diese zu w\u00E4hlen.
ECDHView.Step3=\n\nSchritt 3\nIm nächsten Schritt werden mit dem \"Berechnen\" Button die zwei gemeinsamen Schlüssel von Alice und Bob erzeugt. Dazu wird der Generator (G) mit dem jeweiligen Geheimnis (d) multipliziert: Q = d * G.
ECDHView.Step4=\n\nSchritt 4\nAlice und Bob können nun ihre gemeinsamen Schl\u00fcssel auf einem öffentlichen Kanal austauschen. Um als Angreifer das Geheimnis extrahieren zu können, müsste man das diskrete Logarithmusproblem lösen.
ECDHView.Step5=\n\nSchritt 5\nAlles was zu tun bleibt f\u00fcr Alice und Bob ist ihren gemeinsamen Sitzungsschl\u00fcssel zu berechnen. Diesen erhalten sie indem sie ihr Geheimnis mit dem gemeinsamen Schl\u00fcssel multiplizieren.\nSitzungsschl\u00fcssel = sA * QB bzw. sB * QA.
ECDHView.messageSecretKey=hat nun einen geheimen Schl\u00fcssel gew\u00E4hlt.\nDieses Feld wird mit Sternchen gef\u00fcllt, da es nur einer Person (hier
ECDHView.messageSecretKey2=) bekannt ist.
ECDHView.messageSharedKeyTitle=Gemeinsamer Schl\u00fcssel berechnet
ECDHView.messageCommonKey=hat den gemeinsamen Sitzungsschl\u00fcssel berechnet. Der Schl\u00fcssel ist der x-Wert des gemeinsamen Punktes.
ECDHView.messageSucces=\n\nAlice und Bob haben erfolgreichen einen Sitzungsschl\u00fcssel erzeugt, den nur Sie kennen.\n\nDieser Schl\u00fcssel kann nun f\u00fcr symmetrische Verschl\u00fcsselung verwendet werden.
ECDHView.messageFailTitle=Fehler
ECDHView.messageFail=Es ist ein Problem aufgetreten.\n\nDas ist m\u00f6glicherweise ein Fehler in der Programmierung.\nBitte senden Sie eine eMail an die Entwickler mit dem Inhalt des Logfiles (w\u00E4hlen Sie "Ergebnisse speichern" in einen Editor oder eine Datei und klicken Sie dann auf "Speichern").
ECDHWizPP.groupCurveType=Kurventyp
ECDHWizPP.textCurve=Hier k\u00f6nnen Sie die Kurvenparameter bestimmen. Mit einem Klick auf "Zuf\u00E4llige Kurve" werden die Parameter automatisch gew\u00E4hlt.\nWeitere Informationen erhalten Sie bei der ECC-Demonstration.
ECDHWizPP.ellipticCurve=Elliptische Kurve
ECDHWizPP.groupGenerator=Generator
ECDHWizPP.textGenerator=Ein Klick auf den Button "Zuf\u00E4lliger Generator" schl\u00E4gt einen Generatorpunkt vor.
ECDHWizPP.btnCreateGenerator=Zuf\u00E4lliger Generator
ECDHWizPP.groupCurveSize=Kurvengr\u00f6\u00dfe
ECDHWizPP.small=Klein
ECDHWizPP.large=Gro\u00df
ECDHWizPP.groupAttributes=Dom\u00E4nenparameter
ECDHWizPP.btnGenerateCurve=Zuf\u00E4llige Kurve
ECDHWizPP.PublicParametersError=Es existieren keine Generatorpunkte f\u00fcr die Kurvenparameter\!
ECDHWizPP.title=\u00d6ffentliche Parameter w\u00E4hlen
ECDHWizSK.title=Geheime Parameter w\u00E4hlen
ECDHWizSK.title1=
ECDHWizSK.title2='s geheimen Schl\u00fcssel w\u00E4hlen
ECDHWizSK.description1=Bitte w\u00E4hlen Sie eine Zahl zwischen 0 und der Ordnung von G
ECDHWizSK.description2=Sie k\u00f6nnen ein Geheimnis w\u00E4hlen, indem Sie "Zuf\u00E4lliges Geheimnis" anklicken.
ECDHWizSK.groupSecret='s Geheimnis
ECDHWizSK.btnGenerate=Zuf\u00E4lliges Geheimnis
SecretKeyComposite.0=Ordnung von G = 
SecretKeyComposite.1=Geheimnis =
SecretKeyComposite.2=Das Geheimnis muss eine ganze Zahl größer als 0 sein.
