ChooseKeytypePage_choose_keytype=Schl\u00FCsselart w\u00E4hlen
ChooseKeytypePage_choose_type_text=Bitte w\u00E4hlen Sie aus, ob Sie ein neues Schl\u00FCsselpaar erzeugen oder einen \u00F6ffentlichen Schl\u00FCssel eingeben m\u00F6chten.
ChooseKeytypePage_new_keypair=Neues Schl\u00FCsselpaar
ChooseKeytypePage_new_keypair_popup=W\u00E4hlen Sie diesen Button, wenn Sie ein neues Schl\u00FCsselpaar erzeugen wollen.
ChooseKeytypePage_new_pubkey=Neuer \u00F6ffentlicher Schl\u00FCssel
ChooseKeytypePage_new_pubkey_popup=W\u00E4hlen Sie diesen Button, wenn Sie einen neuen \u00F6ffentlichen Schl\u00FCssel eingeben m\u00F6chten.
DecryptSignPage_choose_action=Vorgehensweise w\u00E4hlen
DecryptSignPage_choose_action_text=Bitte w\u00E4hlen Sie, ob Sie ein bestehendes Schl\u00FCsselpaar nutzen oder ein neues erzeugen wollen.
DecryptSignPage_existing_keypair=Bestehendes Schl\u00FCsselpaar
DecryptSignPage_existing_keypair_popup=W\u00E4hlen Sie dies, wenn Sie ein bestehendes Schl\u00FCsselpaar aus dem Keystore laden m\u00F6chten.
EncryptVerifyPage_choose_action_text=Bitte w\u00E4hlen Sie, ob Sie einen bestehenden Schl\u00FCssel nutzen oder einen neuen erzeugen wollen.
EncryptVerifyPage_existing_key=Bestehender \u00F6ffentlicher Schl\u00FCssel
EncryptVerifyPage_existing_key_popup=W\u00E4hlen Sie dies, wenn Sie einen bestehenden \u00F6ffentlichen Schl\u00FCssel aus dem Keystore laden m\u00F6chten.
EncryptVerifyPage_manual_entry=Neuer \u00F6ffentlicher Schl\u00FCssel
EncryptVerifyPage_manual_entry_popup=W\u00E4hlen Sie dies, wenn Sie den \u00F6ffentlichen Schl\u00FCssel manuell eingeben m\u00F6chten.
EnterCiphertextPage_enter_ciphertext=Chiffretext eingeben.
EnterCiphertextPage_enter_ciphertext_text=Bitte geben Sie den Chiffretext als leerzeichenseparierte Hex-Werte ein.
EnterCiphertextPage_error_param_gt_n=Einer der angegebenen Werte ist gr\u00F6\u00DFer als N, dies ist auf normalem Weg nicht m\u00F6glich.\n Bitte korrigieren Sie diesen Fehler.
EnterCiphertextPage_textentry=Texteingabe
EnterPlaintextPage_0=Zahlen direkt eingeben
EnterPlaintextPage_1=Geben Sie die zu verschl\u00FCsselnden Zahlen direkt als Leerzeichen-getrennten Text ein.
EnterPlaintextPage_enter_plaintext=Klartext eingeben
EnterPlaintextPage_enter_plaintext_text=Bitte geben Sie den zu verschl\u00FCsselnden bzw. zu signierenden Text in das vorgesehene Feld ein.
EnterPlaintextPage_simple_hash=Das hier angewendete Hashverfahren ist ein stark vereinfachtes Verfahren:\nDie Buchstaben der Nachricht werden zun\u00E4chst in ihre ASCII-Werte \u00FCbersetzt und anschlie\u00DFend modulo N aufaddiert.\nDas Ergebnis ist ein Hashwert der Nachricht, der anschlie\u00DFend f\u00FCr die Signaturerstellung genutzt wird.\nF\u00FCr reale Anwendungen wird statt dieses einfachen Verfahrens ein Hashverfahren wie SHA-1 verwendet, das kryptographische Sicherheit bietet.
EnterPlaintextPage_use_sha1=SHA-1 verwenden
EnterPlaintextPage_use_sha1_popup=W\u00E4hlen Sie dieses Feld aus, wenn Sie statt des einfachen Hashverfahrens SHA-1 verwenden m\u00F6chten.
EnterSignaturePage_enter_sig=Signatureingabe
EnterSignaturePage_enter_sig_as_hex=Bitte geben Sie die zu \u00FCberpr\u00FCfende Signatur als Hex-Wert ein.\nErg\u00E4nzend k\u00F6nnen Sie auch den Klartext dazu eingeben, dann findet eine automatische Signaturpr\u00FCfung statt sobald der Algorithmus abgeschlossen ist.
EnterSignaturePage_enter_signature=Signatur eingeben
EnterSignaturePage_error_sig_gt_n=Die eingegebene Signatur ist gr\u00F6\u00DFer als N, dies ist auf normalem Weg nicht m\u00F6glich.\n Bitte korrigieren Sie diesen Fehler.
KeySelectionWizard_key_selection=Schl\u00FCsselauswahl
LoadKeypairPage_enter_password=Bitte geben Sie das zu diesem Schl\u00FCsselpaar geh\u00F6rige Passwort ein.
LoadKeypairPage_pleae_select_keypair=Bitte w\u00E4hlen Sie ein Schl\u00FCsselpaar aus.
LoadKeypairPage_select_keypair=Schl\u00FCsselpaar ausw\u00E4hlen
LoadKeypairPage_select_keypair_from_list=Bitte w\u00E4hlen Sie ein Schl\u00FCsselpaar aus der Liste aus.
LoadPublicKeyPage_select_pubkey=\u00D6ffentlichen Schl\u00FCssel ausw\u00E4hlen
LoadPublicKeyPage_select_pubkey_text=Bitte w\u00E4hlen Sie aus, welchen \u00F6ffentlichen Schl\u00FCssel Sie verwenden m\u00F6chten.
LoadPublicKeyPage_select_pubkey_text2=Bitte w\u00E4hlen Sie einen \u00F6ffentlichen Schl\u00FCssel aus der Liste aus.
NewKeypairPage_choose_params=Parameter festlegen
NewKeypairPage_choose_params_text=Bitte geben Sie hier die Parameter ein, um ein neues RSA-Schl\u00FCsselpaar zu erzeugen.
NewKeypairPage_e_text=Der Entschl\u00FCsselungsexponent berechnet sich aus e\u2219d\u22611 mod \u03C6(N) und lautet:
NewKeypairPage_eror_p_eq_q=Geben Sie zwei verschiedene Primzahlen p und q ein oder w\u00E4hlen Sie sie aus der Liste.
NewKeypairPage_error_n_lt_256=Ihr RSA-Modul ist <256, damit wird der Algorithmus nicht funktionieren.
NewKeypairPage_error_p_not_prime=Achtung, p ist keine Primzahl, dies kann zu unerw\u00FCnschtem Verhalten f\u00FChren.
NewKeypairPage_error_q_not_prime=Achtung, q ist keine Primzahl, dies kann zu unerw\u00FCnschtem Verhalten f\u00FChren.
NewKeypairPage_hard_calculations_text=Achtung: die Berechnung der m\u00F6glichen Werte f\u00FCr e ist aufw\u00E4ndig und kann bei gro\u00DFem N einige Zeit dauern.
NewKeypairPage_n_result=Ihr RSA-Modul N=p\u2219q und die eulersche Phi-Funktion zu ihm \u03C6(N)=(p-1)\u2219(q-1) lauten:
NewKeypairPage_save_keypair=Schl\u00FCsselpaar speichern
NewKeypairPage_save_keypair_popup=W\u00E4hlen Sie diese Box an, um das Schl\u00FCsselpaar im mitgelieferten Keystore f\u00FCr weitere Verwendung zu speichern.
NewKeypairPage_select_e=W\u00E4hlen Sie Ihren Verschl\u00FCsselungsexponenten e zwischen 1 und \u03C6(N). \nF\u00FCr alle aufgef\u00FChrten Zahlen gilt ggT(e,\u03C6(N))=1.
NewKeypairPage_whole_list=ganze Liste
NewKeypairPage_whole_list_popup=Hier klicken um die Liste aller m\u00F6glichen e-Werte einzutragen, dies kann bei gro\u00DFen \u03C6(N) bis zu 30 Sekunden dauern.
NewPublicKeyPage_choose_params=Parameter festlegen
NewPublicKeyPage_choose_rsa_mod=Bitte w\u00E4hlen Sie Ihren RSA-Modul N > 256.
NewPublicKeyPage_enter_e=Bitte geben Sie hier Ihren Verschl\u00FCsselungsexponenten e ein.
NewPublicKeyPage_enter_params_text=Bitte geben Sie die Parameter des \u00F6ffentlichen Schl\u00FCssels ein.
NewPublicKeyPage_error_e_lt_1=Bitte w\u00E4hlen Sie e, so dass es >1 und kleiner (sqrt(N)-1)^2 ist.
NewPublicKeyPage_error_n_lt_256=Bitte w\u00E4hlen Sie N gr\u00F6\u00DFer als 256.
NewPublicKeyPage_error_n_not_p_by_q=Achtung, N ist nicht das Produkt zweier Primzahlen.\nBitte \u00FCberpr\u00FCfen Sie Ihre Eingabe oder w\u00E4hlen Sie die vorgeschlagene Zahl.
NewPublicKeyPage_save_pubkey=\u00D6ffentlichen Schl\u00FCssel speichern
NewPublicKeyPage_save_pubkey_popup=w\u00E4hlen Sie dieses Feld um den \u00F6ffentlichen Schl\u00FCssel im mitgelieferten Keystore zu speichern.
NewPublicKeyPage_suggestion=Vorschlag
NewPublicKeyPage_use=\u00DCbernehmen
NewPublicKeyPage_use_popup=Klicken Sie hier, wenn Sie den nebenstehenden Vorschlag f\u00FCr N \u00FCbernehemn m\u00F6chten.
RSAComposite_algo_header=Algorithmus
RSAComposite_Calculate=Berechnen
RSAComposite_Calculations=Schrittweise Berechnungen
RSAComposite_copy=Kopieren
RSAComposite_copy_to_clipboard=Text in die Zwischenablage kopieren.
RSAComposite_data_loss=Die bisherigen Daten dieser Seite gehen verloren.
RSAComposite_decrypt=Entschl\u00FCsseln
RSAComposite_description=Das RSA-Kryptosystem ist ein asymmetrisches Verschl\u00FCsselungs- und Signaturverfahren, das auf zwei "schwierigen" Problemen aufbaut:\nErstens, dass es schwer ist, Wurzeln modulo N zu ziehen (RSA-Problem).\nZweitens, dass das Faktorisieren einer gro\u00DFen Zahl N=p\u2219q schwer ist, sofern ihre Faktoren hinreichend gro\u00DF sind (RSA-Schl\u00FCsselproblem).
RSAComposite_encrypt=Verschl\u00FCsseln
RSAComposite_enter_text=Text eingeben
RSAComposite_finish_calc_messagebox_text=F\u00FCr alle im Zahlfeld angegebenen Hex-Werte wird nun der Berechnungsschritt durchgef\u00FChrt. Das Ergebnis wird anschlie\u00DFend im Ergebnisfeld angezeigt.
RSAComposite_finish_calc_messagebox_title=Berechnungsabschluss
RSAComposite_inherit_from=Daten von einem der drei anderen Tabs \u00FCbernehmen:
RSAComposite_invalid=ung\u00FCltig
RSAComposite_key=Schl\u00FCssel
RSAComposite_key_generation=Schl\u00FCsselerzeugung...
RSAComposite_key_generation_text=Klicken Sie hier um den Schl\u00FCsselerzeugungswizard zu starten.
RSAComposite_key_selection=Schl\u00FCsselwahl
RSAComposite_keysel_messagebox_text=Bitte w\u00E4hlen Sie nun den Schl\u00FCssel oder geben Sie einen neuen ein.
RSAComposite_needed=ben\u00F6tigt
RSAComposite_no=nein
RSAComposite_numbertext_header=Eingegebener Text umgewandelt in Zahlen
RSAComposite_options=Optionen
RSAComposite_reset=Zur\u00FCcksetzen
RSAComposite_result=Ergebnis
RSAComposite_show_dialogs=Dialoge anzeigen
RSAComposite_sign=Signieren
RSAComposite_start=Start
RSAComposite_step=N\u00E4chster Schritt
RSAComposite_step1=Schritt {0} von {1}
RSAComposite_step_result=Schrittergebnis
RSAComposite_step_text=N\u00E4chsten Berechnungsschritt anzeigen
RSAComposite_sure=Sind Sie sicher?
RSAComposite_text=Eingegebener Text
RSAComposite_textentry_messagebox_text=Bitte geben Sie nun den zu bearbeitenden Text ein.
RSAComposite_title=RSA-Kryptosystem
RSAComposite_valid=g\u00FCltig
RSAComposite_verify=Verifizieren
RSAComposite_yes=ja
RSAData_inherit_password_text=Bitte geben Sie das zum ausgew\u00E4hlten Schl\u00FCsselpaar geh\u00F6rende Passwort ein.
RSAData_inherit_password_title=Password bitte
RSAData_ExAccessKeystorePassword=Auf den Schl\u00FCsselspeicher kann nicht zugegriffen werden. Bitte Überprüfen Sie das Passwort.
RSAData_failedInitPrivParams=Private Parameter konnten nicht gesetzt werden.
SaveKeypairPage_enter_params_text=Bitte geben Sie die Speicherparameter f\u00FCr das eben erzeugte Schl\u00FCsselpaar an.
SaveKeypairPage_error_passwords_mismatch=Die eingegebenen Passw\u00F6rter stimmen nicht \u00FCberein.
SaveKeypairPage_name=Bitte geben Sie den Namen des Schl\u00FCsselbesitzers ein.
SaveKeypairPage_password=Bitte geben Sie ein Passwort ein und best\u00E4tigen Sie es.
SaveKeypairPage_save_keypair_text=Schl\u00FCsselpaar speichern
SavePublicKeyPage_enter_name=Bitte geben Sie den Namen des Schl\u00FCsselbesitzers ein.
SavePublicKeyPage_enter_params=Bitte geben Sie die Speicherparameter f\u00FCr diesen \u00F6ffentlichen Schl\u00FCssel an.
SavePublicKeyPage_save_pubkey=\u00D6ffentlichen Schl\u00FCssel speichern
