<html>
<head>
	<meta http-equiv="Content-Type" content="text/html;charset=UTF-8">
	<title>Demonstration des Diffie-Hellman Schl&uuml;sselaustausch mittels elliptischen Kurven (ECDH)</title>
</head>

<body>

<h1>Demonstration des Diffie-Hellman Schl&uuml;sselaustausch mittels elliptischen Kurven (ECDH)</h1>

<p>Der Diffie-Hellman-Schl&uuml;sselaustausch ist ein Protocol, dass zwei Partien erm&ouml;glicht einen geteilten geheimen Schl&uuml;ssel &uuml;ber eine ungesicherte Leitung zu vereinbaren.<br>
Das Diffie-Hellman Protokoll beruht auf mathematischen Funktionen, sowie multiplakativen Gruppen von ganzen Zahlen mod p oder elliptischen Kurven. In diesem Beispiel werden elliptische Kurven benutzt.</p>

<h2>Erl&auml;uterung des Protokolls</h2>
  <h3>Schritt 1. Das Etablieren von &ouml;ffentlichen Parametern</h3>
  	<p>Alice und Bob einigen sich auf eine elliptische Kurve und einen Generator <i>G</i>, welcher ein Punkt auf der Kurve ist.</p>
  <h3>Schritt 2. Das Erstellen von privaten Schl&uuml;sseln</h3>
  	<p>Alice und Bob suchen sich beide einen privaten Schl&uuml;ssel <i>d</i> aus, den sie geheim halten.</p>
  <h3>Schritt 3. Das Erstellen von &ouml;ffentlichen Schl&uuml;sseln</h3>
    <p>Alice und Bob multiplizieren jetzt <i>G</i> mit ihrem privaten Schl&uuml;ssel (Skalarmultiplikation).</p>
  <h3>Schritt 4. Der Austausch der &ouml;ffentlichen Schl&uuml;ssel</h3>
    <p>Alice und Bob teilen nun jeweils ihren &ouml;ffentlichen Schl&uuml;ssel miteinander.</p>
  <h3>Schritt 5. Das Erstellen eines Sitzungsschl&uuml;ssels</h3>
    <p>Alice und Bob multiplizieren nun jeweils den &ouml;ffentlichen Schl&uuml;ssel des Anderen mit ihrem eigenem geheimen Schl&uuml;ssel. Der Sitzungsschl&uuml;ssel ist der X-Wert des berechneten Schl&uuml;sselpunkts.</p>

<h2>Voraussetzungen f&uuml;r elliptische Kurven in der Kryptographie</h2>
  <p>F&uuml;r das sichere Anwenden elliptischer Kurven in der Kryptographie m&uuml;ssen bestimmte Vorrausetzungen gegeben sein.<br>
  In dieser Demonstration k&ouml;nnen auch kleine elliptische Kurven verwendet werden. Diese Form der Berechnung ist f&uuml;r den echten Schl&uuml;sselaustausch ungeeignet, 
  da kleine elliptische Kurven den Anspr&uuml;chen nicht entsprechen. Die Voraussetzungen an elliptische Kurven k&ouml;nnen nachgeschlagen werden, 
  zum Beispiel in "SEC 1: Elliptic Curve Cryptography" from Certicom Research (<a href="http://www.secg.org/collateral/sec1_final.pdf">Hier herunterzuladen</a>).</p>
  <h3>E(Fp):</h3>
    <b>E(Fp):</b> die Kurve selbst.<br>
    <b>t:</b> das gew&uuml;nschte Sicherheitslevel in Bits. <i>t</i> kann einen der folgenden Werte halten {56, 64, 80, 96, 112, 128, 192, 256}<br>
    <b>p:</b> ist eine Primzahl so das [log2(<i>p</i>)] = 2<i>t</i> wenn <i>t</i> != 256 und so das [log2(<i>p</i>)] = 521 wenn <i>t</i> = 256.<br>
    <b>G:</b> ein Punkt auf der Kurve, welcher als Basis dient.<br>
    <b>n:</b> eine Primzahl der Ordnung <i>G</i>.<br>
    <b>h:</b> der Kofaktor. <i>h</i> = #<i>E(Fp)</i> / <i>n</i>.<br><br>
    - #<i>E(Fp)</i> != <i>p</i><br>
    - <i>p</i>^B != 1 mod(<i>n</i>) &uuml;ber alle 1 <= B < 20<br>
    - <i>h</i> ist eine nat&uuml;rliche Zahl<br>
    - <i>h</i> ist <= 4

  <h3>E(F2^m):</h3>
    <b>E(F2^m):</b> die Kurve selbst.<br>
    <b>t:</b> das gew&uuml;nschte Sicherheitslevel in Bits. <i>t</i> kann einen der folgenden Werte halten {56, 64, 80, 96, 112, 128, 192, 256}<br>
    <b>'t:</b> die kleinste ganze Zahl in der Menge {64, 80, 96, 112, 128, 192, 256, 512} that is greater than <i>t</i><br>
    <b>m:</b> eine ganze Zahl aus der Menge {113, 131, 163, 193, 233, 239, 283, 409, 571} so that 2<i>t</i> < m < 2<i>'t</i>.<br>
    <b>f(x):</b> ein irreduzibles Polynom, welches als Generator f&uuml;r <i>F(2^m)</i> genutzt wird.<br>
    <b>G:</b> der Basispunkt auf der Kurve.<br>
    <b>n:</b> eine Primzahl der Ordnung <i>G</i>.<br>
    <b>h:</b> der Kofactor. <i>h</i> = #<i>E(F2^m)</i> / <i>n</i>.<br><br>
    - <i>b</i> ist nicht 0<br>
    - #<i>E(F2^m)</i> != <i>2^m</i><br>
    - <i>2^mB</i> != 1 mod(<i>n</i>) &uuml;ber alle 1 <= B < 20<br>
    - <i>h</i> ist eine ganze Zahl<br>
    - <i>h</i> ist <= 4

<h2>Die ECDH Demonstration</h2>


<p>Die Demonstration veranschaulicht den Austausch eines &ouml;ffentlichen Schl&uuml;ssels zwischen Alice und Bob 
durch den Diffie-Hellman Schl&uuml;sselaustausch &uuml;ber elliptische Kurven. Das Protokoll kann mit kleinen oder gro&szlig;en elliptischen Kurven ausgef&uuml;hrt werden.<br><br>
Um den n&auml;chsten Schritt im Protokoll auszuf&uuml;hren, dr&uuml;cken Sie die beiden gro&szlig;en Schaltkn&ouml;pfe.<br>
Selektieren Sie das Feld „Zeige Info-Popups“ im unteren Einstellungsbereich des Fensters um eine Beschreibung des jeweiligen Schrittes zu erhalten.<br>
<img src="showInfo.PNG" style="width:30%;">
<br><br>
Nachdem bet&auml;tigen des Schaltknopfes mit der Beschriftung „&ouml;ff. Parameter Einstellen“, ist es m&ouml;glich eine elliptische Kurve und einen Generatorpunkt <i>G</i> auszuw&auml;hlen.<br>
<img src="setParameters.PNG" style="width:80%;"><br><br>
Sobald die Parameter ausgew&auml;hlt sind, erscheinen sie im Feld das als „&ouml;ffentliche Parameter“ markiert ist.<br>
<img src="parameters.PNG" style="width:80%;"><br><br>
Nachdem die aktiven Schaltkn&ouml;pfe ausgew&auml;hlt sind, wird der n&auml;chste Schaltknopf aktiv. Nachdem ein Schritt im Protokoll erfolgreich ausgef&uuml;hrt ist, ver&auml;ndert sich die Farbe des Knopfes von Rot zu Gr&uuml;n.<br>
<img src="greenButton.PNG" style="width:30%;"><br><br>
Wenn alle Schritte abgeschlossen sind und Alice und Bob erfolgreich einen Sitzungsschl&uuml;ssel etabliert haben erscheint ein Schl&uuml;ssel unten im Fenster.<br>
<img src="key.PNG" style="width:30%;"><br><br>

Um erneut zu Beginnen dr&uuml;cken Sie den „Zur&uuml;cksetzen“ Schaltknopf oben rechts. Dieser setzt alle Einstellungen zur&uuml;ck.<br>

<p>F&uuml;r mehr Information zu Berechnungen mit elliptischen Kurven, besuchen Sie "Demonstration of point addition over elliptic curves (EC)" or <a href="https://de.wikipedia.org/wiki/Elliptische_Kurve">https://de.wikipedia.org/wiki/Elliptische_Kurve</a>.</p><br>

</body>
</html>