StatisticsSelector_0=<keine vorgefertigten Statistiken verf\u00fcgbar f\u00fcr das eingestellte Alphabet>
StatisticsSelector_1=Vorgefertige Statistik w\u00e4hlen:
StatisticsSelector_2=Einen eigenen Referenztext analysieren:
StatisticsSelector_4=Dies ist zu empfehlen, da der Referenztext m\u00f6glichst nur dieselben Zeichen wie der Geheimtext haben sollte, um m\u00f6glichst aussagekr\u00e4ftige 
StatisticsSelector_5=Statistiken f\u00fcr die Analyse zu erhalten. Um einen Gro\u00df- und Kleinbuchstabentext f\u00fcr die Analyse eines nur-Gro\u00dfbuchstaben-Geheimtextes fitzumachen, kann z. B. die Gro\u00dfbuchstabentransformation angewandt werden.
StatisticsSelector_6=Sprache: %s | %s
SubstitutionAnalysisConfigPanel_0=Optional k\u00f6nnen Sie auf der n\u00e4chsten Wizardseite ("Weiter >" - Button) generische \u00c4nderungen am Text vornehmen, wie z. B. Leerzeichen und Zeilenumbr\u00fcche l\u00f6schen.
SubstitutionAnalysisConfigPanel_10=Geheimtext
SubstitutionAnalysisConfigPanel_11=Laden Sie einen Text zur Analyse
SubstitutionAnalysisConfigPanel_12=Alphabet
SubstitutionAnalysisConfigPanel_13=Das Alphabet wird automatisch ermittelt. Es ist wichtig, weil die Referenzstatistik auf Basis des Alphabets konstruiert wird.\nDaher ist aber manchmal n\u00f6tig, Feineinstellungen vorzunehmen, oder ein eigenes Alphabet zu definieren.
SubstitutionAnalysisConfigPanel_14=Alphabet:
SubstitutionAnalysisConfigPanel_15=Statistische Daten durch Referenztexte
SubstitutionAnalysisConfigPanel_16=F\u00fcr die Analyse werden einige Referenzstatistiken ben\u00f6tigt (H\u00e4ufigkeit einzelner Zeichen, 2-er-Paare und Tripel).
SubstitutionAnalysisConfigPanel_18=Jede Sprache ist unterschiedlich: Sie sollten einen Referenztext ausw\u00e4hlen, der in derselben Sprache wie der Geheimtext geschrieben ist, und der einen \u00e4hnlichen Zeichensatz hat.
SubstitutionAnalysisConfigPanel_19=Analysis
SubstitutionAnalysisConfigPanel_20=Die Konfiguration ist jetzt komplett; Starten Sie die Analyse durch einen Klick auf den Button.
SubstitutionAnalysisConfigPanel_22=Um alle Einstellungen auf dieser Seite zur\u00fcckzusetzen, oder von der Analyse zur dieser Konfigurationsseite zur\u00fcckzukehren, verwenden Sie den Reset-Button in der rechten oberen Ecke der Toolbar dieser View.
SubstitutionAnalysisConfigPanel_23=Analyse starten
SubstitutionAnalysisConfigPanel_8=Parameter f\u00fcr die Substitutionsanalyse
SubstitutionAnalysisConfigPanel_9=F\u00fcr die Analyse werden die folgenden Informationen ben\u00f6tigt:
SubstitutionAnalysisPanel_0=Substitutionsanalyse
SubstitutionAnalysisPanel_1=Zeichenh\u00e4ufigkeits-Statistik
SubstitutionAnalysisPanel_10=Klar- zu Geheimtext-Substitution:
SubstitutionAnalysisPanel_12=<Die Substitutionstabelle muss komplett ausgef\u00fcllt sein>
SubstitutionAnalysisPanel_13=Einen anderen Referenztext verwenden
SubstitutionAnalysisPanel_2=Substitutionen
SubstitutionAnalysisPanel_3=Vorschau des entschl\u00fcsselten Textes
SubstitutionAnalysisPanel_4=Die Substitutionsanalyse besteht daraus, herauszufinden, welche Zeichen durch welche zu ersetzen sind, damit der Klartext entsteht.\r\nDie Statistiken f\u00fcr Referenztext (RT) und Geheimtext (GT) (rechts) helfen dabei: Zeichen, die miteinander substituiert werden, weisen normalerweise eine \u00e4hnliche H\u00e4ufigkeit in Referenz- und Geheimtext auf. Versuchen Sie, Zeichen, Paare oder Tripel zu finden, deren Ersetzung durch \u00e4hnlich h\u00e4ufige Pendants aus dem Referenztext Sinn ergibt, und beobachten Sie, wie sich der Klartext (KT) dabei ver\u00e4ndert.
SubstitutionAnalysisPanel_5=Den entschl\u00fcsselten Stand des Klartextes in einen Editor schreiben
SubstitutionAnalysisPanel_6=F\u00fclle fehlende Zeichen auf
SubstitutionAnalysisPanel_7=Zuordnungen als Text exportieren
SubstitutionAnalysisPanel_8=Geheim- zu Klartext-Substitution:
SubstitutionAnalysisPanel_9=Zeichenzuordnungen zur\u00fccksetzen
SubstKeyViewer_0=Substitution als Text
TextLoadController_0=Text laden...
TextLoadController_1=Geladener Text:
TextLoadController_3=<A>einen anderen Text w\u00e4hlen...</A>
