
XORComposite_tab_title=Running-Key-Verschl\u00FCsselung

XORComposite_description=Dieses Plug-in f\u00FChrt eine Running-Key-Verschl\u00FCsselung durch. Dabei werden zwei Klartexte zu einem Geheimtext verkn\u00FCpft.\r\nWie man ein solches Running-Key-Chiffrat analysieren kann steht im n\u00E4chsten Tab (Viterbi-Analyse).
XORComposite_algo_header=Berechnungen
XORComposite_loadFile=Textdatei laden...
XORComposite_Plain1=Klartext 1
XORComposite_Plain1DefaultText=Ach, was mu\u00DF man oft von b\u00F6sen Kindern h\u00F6ren oder lesen\! Wie zum Beispiel hier von diesen, welche Max und Moritz hie\u00DFen. Die, anstatt durch weise Lehren sich zum Guten zu bekehren, oftmals noch dar\u00FCber lachten und sich heimlich lustig machten.
XORComposite_combination_header=Art der Verkn\u00FCpfung
XORComposite_Combination_RadioXOR=XOR-Verkn\u00FCpfung
XORComposite_Combination_RadioMOD=Modulare Addition
XORComposite_Plain2=Klartext 2
XORComposite_Plain2DefaultText=Mancher gibt sich viele M\u00FCh' mit dem lieben Federvieh; einesteils der Eier wegen, Welche diese V\u00F6gel legen, zweitens: Weil man dann und wann einen Braten essen kann; Drittens aber nimmt man auch Ihre Federn zum Gebrauch in die Kissen und die Pf\u00FChle, denn man liegt nicht gerne k\u00FChle.
XORComposite_calculate=Verkn\u00FCpfung berechnen
XORComposite_EncodingMode_RadioHEX=Hexadezimal
XORComposite_EncodingMode_RadioUNI=Textdarstellung
XORComposite_next=\u00DCbernehmen und weiter
XORComposite_encodingmod_header=Darstellung
XORComposite_cipher=Geheimtext

ViterbiComposite_tab_title=Viterbi-Analyse

ViterbiComposite_description=Der Viterbi-Algorithmus ist eine komplexe Form der H\u00E4ufigkeitsanalyse. Mithilfe von Wahrscheinlichkeiten des Auftretens von Zeichenketten wird versucht, die Klartexte zusammenzubauen.\r\n\r\nDie Arbeitsweise l\u00E4sst sich in folgende Schritte einteilen (dies ist eine sehr grobe Darstellung, sodass einige Schritte fehlen):\r\n1. Ein Buchstabe wird in alle m\u00F6glichen Kombinationen der Verkn\u00FCpfung zerlegt. Als Umkehrfunktion verwendet man beim klassischen XOR-Verfahren ein weiteres XOR und bei der modularen Addition eine modulare Subtraktion.\r\n2. Es wird die Wahrscheinlichkeit dieser Kombinationen berechnet. Diese Berechnungen erledigt ein komplexes Sprachmodell, welches l\u00E4ngere Zeichenfolgen ber\u00FCcksichtigt. Es flie\u00DFt also nicht nur das aktuelle Zeichen, sondern alle Vorg\u00E4ngerbuchstaben in die Berechnung mit ein.\r\n3. Die wahrscheinlichsten Pfade werden geordnet gespeichert. Unwahrscheinliche Pfade werden nicht weiter verfolgt.
ViterbiComposite_input_header=Eingabe
ViterbiComposite_calculation_header=Berechnung
ViterbiComposite_language_header=Sprache des Referenzmodells
ViterbiComposite_language_german=Deutsch
ViterbiComposite_language_english=Englisch
ViterbiComposite_nGramLabel=n-Gramm Gr\u00F6\u00DFe
ViterbiComposite_pathLabel=Pfade
ViterbiComposite_startButton=Analyse starten
ViterbiComposite_result_header=Ergebnis
ViterbiComposite_solution1=M\u00F6glicher 1. Klartext
ViterbiComposite_solution2=M\u00F6glicher 2. Klartext
ViterbiComposite_exportButton=Exportieren...
ViterbiComposite_cancelButton=Abbrechen


