<!DOCTYPE html>
<html lang = "de">
    <head>
        <meta charset="utf-8">
        <title>Grundlegende Problemstellung und Prozesse einer PKI</title>
    </head>
    <body>
        <!--Headline 1 should be the main title of the displayed page -->
        <h1>Grundlegende Problemstellung und Prozesse einer PKI</h1>
        <!--first, we give a general introduction about this section of the onlinehelp-->
        <p>In diesem Abschnitt der Onlinehilfe wird zun&auml;chst die Problemstellung, die eine PKI zu l&ouml;sen versucht, definiert. Anschließend werden die Prozesse, die vom JCT-CA Plugin dargestellt werden, n&auml;her beschrieben.</p>
        <h2>Grundlegendes Problem</h2>
        <p>Asymmetrische Kryptografie hat gegen&uuml;ber der symmetrischen einige Vorteile. Das zur Verschl&uuml;sselung verwendete Schl&uuml;sselmaterial braucht nicht geheim gehalten zu werden. Man braucht sich also nicht mehr dar&uuml;ber Gedanken zu machen, wie man das Schl&uuml;sselmaterial an die Kommunikationspartner verteilt. Außerdem steigt die Anzahl der ben&ouml;tigten Schl&uuml;ssel nicht wie bei symmetrischer Kryptografie quadratisch sondern linear zur Anzahl der kommunizierenden Personen.</p>
        <p>Genau diese Eigenschaft der asymmetrischen Kryptografie schafft aber die Ausgangslage f&uuml;r ein Problem, das man davor nicht hatte: die Authentizit&auml;t des &ouml;ffentlichen Schl&uuml;ssels. Bei symmetrischer Kryptografie war die Authentizit&auml;t des Schl&uuml;ssels durch die Notwendigkeit, diesen gesichert zu verteilen, implizit sichergestellt. Wenn &ouml;ffentliche Schl&uuml;ssel nun aber beispielsweise per E-Mail oder &uuml;ber Webseiten verteilt werden, ist diese Sicherheit nicht gegeben. Eine E-Mail k&ouml;nnte am &Uuml;bertragungsweg abgefangen und der darin enthaltene &ouml;ffentliche Schl&uuml;ssel ausgetauscht werden. Es besteht also das Problem, die Zuordnung zwischen einem Schl&uuml;ssel und einer Person auf irgendeine Art und Weise sicherzustellen.</p>
        <p>Dieses Problem der Sicherstellung eines Sachverhaltes ist dabei keineswegs neu oder auf die digitale Welt beschr&auml;nkt. Exekutivbeamte sind beispielsweise darauf angewiesen, die Identit&auml;t eines Fahrzeuglenkers eindeutig festzustellen. Ein Lebensmittelh&auml;ndler muss f&uuml;r bestimmte K&auml;ufe das Alter des Kunden verl&auml;sslich feststellen k&ouml;nnen. In der realen Welt verl&auml;sst man sich dabei auf Beh&ouml;rden, die in der Lage sind, diese Feststellungen vertrauensw&uuml;rdig vorzunehmen. Da es aber zu umst&auml;ndlich w&auml;re, die Beh&ouml;rde immer direkt zu kontaktieren, werden bestimmte Dokumente ausgestellt, die diesen Sachverhalt festhalten.</p>
        <p>Der oben genannte Verk&auml;ufer oder Exekutivbeamte muss folglich zwei Dinge kennen, um selbst die ben&ouml;tigten Informationen festzustellen: Das von der Beh&ouml;rde ausgestellte Dokument und die Sicherheitsmerkmale, die dieses Dokument f&auml;lschungssicher machen - also beispielsweise der Stempel dieser Beh&ouml;rde mit einer Unterschrift.</p>
        <p>In der digitalen Welt gibt es einen &auml;hnlichen Ansatz: sogenannte "Digitale Zertifikate." Ein digitales Zertifikat ist dabei nichts anderes als ein &ouml;ffentlicher Schl&uuml;ssel, dem eine vertrauensw&uuml;rdige Stelle gewisse Sicherheitsmerkmale hinzugef&uuml;gt hat. Diese vertrauensw&uuml;rdige Stelle wird als "Certification Authority" (oder zu deutsch manchmal "Zertifizierungsstelle") bezeichnet. Eine Public-Key-Infrastruktur umfasst dabei zus&auml;tzlich zu dieser Certification Authority und den notwendigen Prozessen zur Zertifikatsausstellung unter anderem auch die n&ouml;tige Infrastruktur, diese Zertifikate zu widerrufen.</p>
        <h2>Prozesse in einer PKI</h2>
        <p>Das Plugin beginnt mit einer grafischen Darstellung der Prozesse, die mit der Ausstellung, dem Widerruf und der Verwendung digitaler Zertifikate verbunden sind. Diese werden im Folgenden n&auml;her beschrieben.</p>
        <h3>Zertifikatserstellung</h3>
        <img alt="Architekturskizze Zertifikatserstellung" src="../../../icons/minica_create.png" />
        <p>M&ouml;chte sich ein Benutzer ein Zertifikat ausstellen lassen, so muss er zun&auml;chst einen "Certificate Signing Request" (CSR) daf&uuml;r generieren. Auf das Format dieses CSR wird bei der Beschreibung der Pluginmaske zur Zertifikatsanforderung noch genauer eingegangen. Vorerst ist nur von Bedeutung, dass der CSR der &ouml;ffentlichen Schl&uuml;ssel des Benutzer enth&auml;lt. Diesen CSR signiert der Benutzer mit seinem privaten Schl&uuml;ssel und leitet ihn gemeinsam mit einem Identit&auml;tsnachweis &ndash; beispielsweise eine Ausweiskopie &ndash; an die "Registration Authority" (RA) oder im Deutschen den "Registrar" weiter.</p>
        <p>Die RA &uuml;berpr&uuml;ft, ob die Angaben im CSR mit den Daten im Ausweis &uuml;bereinstimmen. Tun sie dies nicht, so lehnt sie die Anfrage ab und gibt dem Benutzer R&uuml;ckmeldung dar&uuml;ber, warum die Anfrage abgelehnt wurde. Besteht die Anfrage diese Pr&uuml;fung, gibt die RA den CSR an die Certification Authority (CA) weiter.</p>
        <p>Die CA ist schließlich für die tatsächliche Ausstellung des Zertifikats verantwortlich. Sie generiert aus dem CSR ein Zertifikat, das mit ihrem eigenen Signierschlüssel signiert wird. Meist haben CAs dafür nicht nur einen einzigen, sondern mehrere solcher Signierschlüssel. Für das Verständnis der grundsätzlichen Funktionsweise einer PKI und dieses Plugins ist es dabei unerheblich, wie viele solche Schlüssel eine CA hat und mit welchem das Zertifikat signiert wird. Das fertige Zertifikat enthält schließlich den Namen des Antragstellers, die Informationen zur ausstellenden CA, ein Ausstellungsdatum und ein Ablaufdatum. Den genauen formalen Aufbau finden Sie in [Teil über Standards]. Dieses Zertifikat wird an den Benutzer zurückgegeben.</p>

        <h3>Zertifikatswiderruf</h3>
        <img alt="Architekturskizze Zertifikatswiderruf" src="../../../icons/minica_revoke.png" />
        <p>Eine PKI bietet nicht nur die Möglichkeit, Zertifikate auszustellen. Eine CA unterhält auch die notwendigen Dienste, um ein Zertifikat vor Ablauf der Gültigkeit zu widerrufen. Mögliche Gründe für einen Widerruf sind vielfältig. Der Benutzer hat möglicherweise die Kontrolle über seinen privaten Schlüssel verloren. Außerdem kann eine CA von sich aus Zertifikate widerrufen, wenn beispielsweise in die Systeme der CA eingebrochen und ein Signaturschlüssel gestohlen wurde. Weitere Gründe sind im [blah über standards] beschrieben. Möchte ein Benutzer sein Zertifikat widerrufen, so erstellt er für dieses Zertifikat einen "Revocation Request" (RR). Wenn er den privaten Schlüssel dazu noch hat, reicht es üblicherweise aus, dieses RR damit ähnlich wie einen CSR zu signieren. Hat er den privaten Schlüssel nicht mehr oder kann nicht mehr darauf zugreifen, ist wiederum die Tätigkeit der RA notwendig. In so einem Fall muss überprüft werden, ob der RR tatsächlich von dem Benutzer stammt, auf den das Zertifikat ausgestellt war. Ist dies sichergestellt, wird der RR an die CA weitergegeben.</p>
        <p>Die CA unterhält eine sogenannte "Certificate Revocation List." Jedes Zertifikat, das von seinem Inhaber widerrufen wird, bekommt einen Eintrag auf dieser CRL. Außerdem wird zu jedem Zertifikat ein Widerrufszeitpunkt festgehalten.</p>

        <h3>Signaturprüfung</h3>
        <img alt="Architekturskizze Signaturprüfung" src="../../../icons/minica_check.png" />
       <p>Bekommt nun ein Empfänger beispielsweise eine signierte E-Mail, so sind einige Schritte notwendig, um die Echtheit dieser Signatur zu prüfen. Zunächst einmal muss der Empfänger überprüfen, ob das Zertifikat überhaupt korrekt ist. Zu diesem Zweck benötigt er das sogenannte Root-Zertifikat der ausstellenden CA. Dieses Root-Zertifikat ist das Zertifikat, das zu dem Signierschlüssel der CA gehört, mit dem die CA das Benutzerzertifikat signiert hat. Mit diesem Root-Zertifikat überprüft der Empfänger zuerst, ob es sich bei dem Benutzerzertifikat um ein vertrauenswürdiges Zertifikat dieser CA handelt. Anschließend prüft er, ob das Zertifikat noch nicht abgelaufen ist. Das ist insofern wichtig, als dass eine CA nur für den Gültigkeitszeitraum eines Zertifikats garantiert, überhaupt Informationen über den korrekten Status eines Zertifikates zu unterhalten. Ist also das Zertifikat bereits abgelaufen, braucht mit keiner weiteren Signaturprüfung mehr fortgefahren werden. Ist das Zertifikat noch nicht abgelaufen, wird als nächstes geprüft, ob die E-Mail eine korrekte Signatur passend zum Zertifikat enthält. Ist dies der Fall, muss zuletzt überprüft werden, ob der Zertifikatsinhaber das Zertifikat widerrufen hat lassen. Zu diesem Zweck fordert sich der E-Mailempfänger die CRL von der CA an. Befindet sich das Zertifikat, mit dem er diese Signatur geprüft hat, auf dieser CRL, dann ist die Signatur nur unter der Voraussetzung gültig, dass sie vor dem Widerrufszeitpunkt erstellt wurde. Daraus folgt allerdings, dass ein Zertifikatswiderruf keine bereits ausgestellten Signaturen ungültig werden lässt. Dies kommt daher, dass digitale Zertifikate grundsätzlich dazu geeignet sein sollen, Verträge zu signieren und somit rechtsgültig werden zu lassen. Der Widerruf eines Zertifikats wäre somit aber ein Mittel, einen rechtsgültigen Vertrag nichtig zu machen. Wie mit Signaturen umzugehen ist, die von widerrufenen Zertifikaten stammen, aber grundsätzlich gültig sind, ist in keinem PKI-Standard festgeschrieben sondern den betroffenen Parteien überlassen.</p>

        <!-- last but definitely not least, the creative commons attribution share-alike license notice-->
        <hr>
        <p>
        <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/deed.de"><img alt="Creative Commons Lizenzvertrag" style="display: block; margin-left: auto; margin-right: auto; border-width:0" src="./media/cc-by-sa-80x15.png" /></a>
        <br />
        Dieser Inhalt steht unter einer <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/deed.de">Creative Commons Namensnennung - Weitergabe unter gleichen Bedingungen 3.0 Unported Lizenz</a>
        </p>
    </body>
</html>
