#Generated by Eclipse Messages Editor (Eclipse Babel)

ChartComposite_noGraph = Der erste tats\u00E4chliche Graph wird nach dem Dr\u00FCcken des Rekonstruieren-Buttons erzeugt.

ChartComposite_reconstruct_failure = Das Polynom konnte nicht rekonstruiert werden. Es sind entweder zu wenig Spieler zur Rekonstruktion ausgew\u00E4hlt worden, oder es wurde ein Share ver\u00E4ndert.

ChartComposite_reconstruct_success = Das Polynom konnte erfolgreich rekonstruiert werden.

ChartComposite_tab_title = Rekonstruktionsgraph

VerifiableSecretSharingComposite_coefficients_calculateShares_button = Shares berechnen

VerifiableSecretSharingComposite_coefficients_commit_button = Commit

VerifiableSecretSharingComposite_coefficients_generate_button = Generieren

VerifiableSecretSharingComposite_coefficients_title = Koeffizienten

VerifiableSecretSharingComposite_commitment_not_calculated = Shares k\u00F6nnen nur \u00FCberpr\u00FCft werden ('Check'), wenn zuvor ein Commitment berechnet wurde. Bitte den Button \u201ECommit\u201C im Rechteck \u201EKoeffizienten\u201C dr\u00FCcken.

VerifiableSecretSharingComposite_commitments_coefficient_subtitle = Koeffizient

VerifiableSecretSharingComposite_commitments_commitment_subtitle = Commitment Y\u2091

VerifiableSecretSharingComposite_commitments_title = Commitments

VerifiableSecretSharingComposite_description = 'Verifiable-Secret-Sharing' ist eine Variante des Secret Sharing. Wie beim einfachen Secret Sharing wird ein Geheimnis so in n Teile (engl. 'Shares') zerlegt und an n Spieler verteilt, dass t Spieler (t <= n) das Geheimnis wieder zusammensetzen k\u00F6nnen, weniger als t Spieler jedoch nicht. Allerdings kann beim einfachen Secret Sharing ein Spieler seinen Share \u00E4ndern und so die Geheimniskonstruktion unentdeckt sabotieren. Mit 'Verifiable-Secret-Sharing' wird dieser Nachteil behoben, indem jeder Spieler \u00FCberpr\u00FCfen kann, dass die Shares aller Spieler korrekt sind und somit das Geheimnis auch tats\u00E4chlich wieder korrekt zusammengesetzt werden kann ('Verifiability').\n\nWird der Mauszeiger in einen der Container gesetzt, wird eine entsprechende Erkl\u00E4rung in dem Erkl\u00E4rungsfeld unten angezeigt.

VerifiableSecretSharingComposite_description_coefficients_left = Bei diesem Schritt werden die Koeffizienten a\u1D62 [a\u1D62 \u2208 \u2115; 1 \u2264 a\u1D62 < q]  f\u00FCr das Polynom P(x) ausgew\u00E4hlt. \u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\n\nBei den Koeffizienten sind aus Gr\u00FCnden der Sicherheit des Algorithmus nur Werte > 0 erlaubt.\n\nDiese k\u00F6nnen entweder selbst gew\u00E4hlt, oder zuf\u00E4llig generiert werden. \n\nBei a\u2080 handelt es sich um das Geheimnis s. \n\nDie restlichen Koeffizienten a\u2081 bis a_(t-1) sind mit 1 als Standardwert vorbelegt.

VerifiableSecretSharingComposite_description_coefficients_right = Das Polynom P(x) wird folgenderma\u00DFen aufgebaut: P(x) = a\u2080 + a\u2081x + a\u2082x\u00B2 + ... + a_(t-1)x^(t-1)\n\nSind alle Koeffizienten gew\u00E4hlt, wird das fertige Polynom angezeigt, \n\nund es ist m\u00F6glich, die Commitments und die Shares zu berechnen.\n\nDie Shares k\u00F6nnen unabh\u00E4ngig von den Commitments berechnet werden. \n\nDie Commitments werden sp\u00E4ter f\u00FCr den Check der Shares ben\u00F6tigt.

VerifiableSecretSharingComposite_description_commitments_left = Bei diesem Schritt werden die Commitments Y\u2091 f\u00FCr jeden Koeffizienten a\u2091  folgenderma\u00DFen berechnet: \n\n Y\u2091 = g ^ a\u2091 mod p \n\nDiese werden zum Checken der Shares ben\u00F6tigt.

VerifiableSecretSharingComposite_description_parameters_left = Bei diesem Schritt werden die folgenden Parameter gew\u00E4hlt:\n\n  \u2022 Anzahl der Spieler n [n \u2208 \u2115; n > 1] (Pflichtfeld)\n\n  \u2022 Mindestanzahl t der Spieler zur Rekonstruktion [t \u2208 \u2115; 1 < t \u2264 n] (Pflichtfeld)\n\n  \u2022 Geheimnis s [s \u2208 \u2115] (Pflichtfeld)\n\n    \u2012 Wird zuf\u00E4llig generiert, wenn nichts eingegeben wird.\n\n    \u2012 Ist aufgrund der sp\u00E4teren Berechnungsdauer auf 2.000.000 beschr\u00E4nkt.

VerifiableSecretSharingComposite_description_parameters_right = \  \u2022 Safe Prime p [p \u2208 \u2119; p > 2s] (Pflichtfeld)\n\n    \u2012 Wird automatisch generiert.\n\n    \u2012 Eine Safe Prime ist eine Primzahl der Form 2q + 1, wobei q ebenfalls eine Primzahl ist. \n\n  \u2022 Generator g [g \u2208 \u2124_p; Ordnung(g) = q] (Pflichtfeld)\n\n    \u2012 Wird automatisch generiert.\n\n  \u2022 q [q \u2208 \u2119] (Pflichtfeld)\n\n    \u2012 Es handelt sich um den gr\u00F6\u00DFten Primfaktor von p-1. Es gilt q = (p-1)/2.

VerifiableSecretSharingComposite_description_reconstruction_left = Bei diesem Schritt wird die Rekonstruktion des Polynoms vorgenommen. \n\nUm das korrekte Polynom wiederherzustellen, muss die Anzahl der gew\u00E4hlten Spieler mindestens t sein. \n\nDie Berechnung erfolgt mit Hilfe der Lagrange-Interpolation wie folgt:

VerifiableSecretSharingComposite_description_reconstruction_right = \u2022 Beachte: \n\n    \u2012 u ist die Anzahl der ausgew\u00E4hlten Spieler.\n\n    \u2012 x_k und x_l sind die verwendeten Indizes der jeweiligen Spieler.

VerifiableSecretSharingComposite_description_reconstruction_right_part2 = Das Ergebnis der Rekonstruktion ist das Polynom P'(x).\n\nDa das Polynom P(x) vom Grad t-1 war, und die Lagrange-Interpolation\neindeutig ist, gilt P'(x) = P(x). Der Koeffizient a\u2080 von P'(x) liefert wieder das Geheimnis s.

VerifiableSecretSharingComposite_description_shares_left = Bei diesem Schritt werden die Shares N\u1D62 f\u00FCr jeden Spieler i folgenderma\u00DFen berechnet:\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0\u00A0 \n\nN\u1D62 = P(i) mod q, \n\nwobei i der identifizierende Index des Spielers ist und P(i) das Polynom. \n\nAngezeigt werden die Shares modulo q. \n\nDas Zwischenergebnis vor der Reduktion modulo q wird ebenfalls angezeigt, \n\num die Rekonstruktion graphisch besser veranschaulichen zu k\u00F6nnen.

VerifiableSecretSharingComposite_description_shares_right = 'Check' \u00FCberpr\u00FCft, ob das Share zu dem mit dem Commitment festgelegten Polynom passt. \n\nDieser Check kann f\u00FCr jeden Spieler individuell durchgef\u00FChrt werden. \n\nDas Ergebnis des Checks wird durch einen gr\u00FCnen (korrekt) bzw. \n\neinem roten (falsch) Hintergrund im Feld angezeigt. \n\nVersuchsweise k\u00F6nnen die Shares modulo q ge\u00E4ndert werden. \n\nDie Berechnung sieht folgenderma\u00DFen aus:

VerifiableSecretSharingComposite_description_title = Erkl\u00E4rungen

VerifiableSecretSharingComposite_description_tooltip = Zus\u00E4tzliche Informationen

VerifiableSecretSharingComposite_descrption_secret_limit = Das Limit f\u00FCr das Geheimnis s ist 10\u2079. Der eingegebene Wert liegt \u00FCber der Obergrenze und w\u00FCrd auf die Obergrenze zur\u00FCckgesetzt.

VerifiableSecretSharingComposite_error = Fehler

VerifiableSecretSharingComposite_error_start = Die folgenden Bedingungen m\u00FCssen erf\u00FCllt sein:

VerifiableSecretSharingComposite_nextStep_button = N\u00E4chster Schritt:

VerifiableSecretSharingComposite_param_module_p_bigger_s = Die Safe Prime p muss mindestens doppelt so gro\u00DF wie das Geheimnis s sein!

VerifiableSecretSharingComposite_param_module_p_isPrime = F\u00FCr p muss eine Safe Prime eingegeben werden!

VerifiableSecretSharingComposite_param_p_not_safe_prime = Die gew\u00E4hlte Zahl f\u00FCr p ist keine Safe Prime! Dieser Wert wird nun auf die n\u00E4chste Safe Prime gesetzt.

VerifiableSecretSharingComposite_param_player_t_smaller_n = Die Anzahl der Spieler, die f\u00FCr die Rekonstruktion ben\u00F6tigt werden, darf nicht gr\u00F6\u00DFer als die Anzahl aller Spieler sein (t <= n)!

VerifiableSecretSharingComposite_param_primitive_g = Der Generator g muss ein Element der Ordnung q sein!

VerifiableSecretSharingComposite_param_set_all = Es wurden nicht alle Parameter angegeben, deshalb werden zuf\u00E4llige Werte verwendet.

VerifiableSecretSharingComposite_parameters_determineCoefficients = Koeffizienten bestimmen

VerifiableSecretSharingComposite_parameters_players = Anzahl der Spieler n

VerifiableSecretSharingComposite_parameters_primeFactorMod = Primfaktor q (2q=p-1)

VerifiableSecretSharingComposite_parameters_primeMod = Safe Prime p (p>2s)

VerifiableSecretSharingComposite_parameters_primitiveRoot = Generator g

VerifiableSecretSharingComposite_parameters_reconstructors = Anzahl Spieler t zur Rekonstruktion

VerifiableSecretSharingComposite_parameters_secret = Geheimnis s

VerifiableSecretSharingComposite_parameters_title = Parameter

VerifiableSecretSharingComposite_playerX = Spieler

VerifiableSecretSharingComposite_reconstruct_no_players = Es wurden keine Spieler zur Rekonstruktion ausgew\u00E4hlt.

VerifiableSecretSharingComposite_reconstruction_reconstruct_button = Rekonstruieren

VerifiableSecretSharingComposite_reconstruction_reconstruct_dialog_text = \nDie Rekonstruktion wurde durchgef\u00FChrt.\n\nDas rekonstruierte Geheimnis ist 

VerifiableSecretSharingComposite_reconstruction_reconstruct_dialog_title = Rekonstruktion

VerifiableSecretSharingComposite_reconstruction_title = Rekonstruktion

VerifiableSecretSharingComposite_shares_check_button = Check

VerifiableSecretSharingComposite_shares_shareNModP_subtitle = Share N\u1D62 [mod q]

VerifiableSecretSharingComposite_shares_title = Shares

VerifiableSecretSharingComposite_tab_title = Verifiable-Secret-Sharing

VerifiableSecretSharingComposite_title = Verifiable-Secret-Sharing (VSS)

