ChooseBPage_choose_b=Parameter w\u00E4hlen
ChooseBPage_choose_b_text=Bitte w\u00E4hlen Sie hier Ihren Parameter b zwischen 2 und p-2.\nEin solcher Parameter wird f\u00FCr jeden Vorgang ben\u00F6tigt und sollte nur genau einmal verwendet werden, \nda ansonsten ein Angriff mit Kenntnis nur eines Klartext/Chiffretext-Paares m\u00F6glich ist.
ChooseBPage_error_invalid_b=Bitte w\u00E4hlen Sie Ihr b im angegebenen, g\u00FCltigen Bereich.
ChooseKeytypePage_choose_keytype=Schl\u00FCsselart w\u00E4hlen
ChooseKeytypePage_choose_keytype_text=Bitte w\u00E4hlen Sie aus, ob Sie ein neues Schl\u00FCsselpaar erzeugen oder einen privaten Schl\u00FCssel eingeben m\u00F6chten.
ChooseKeytypePage_new_keypair=Neues Schl\u00FCsselpaar
ChooseKeytypePage_new_keypair_popup=W\u00E4hlen Sie diesen Button, wenn Sie ein neues Schl\u00FCsselpaar erzeugen wollen
ChooseKeytypePage_new_pubkey=Neuer \u00F6ffentlicher Schl\u00FCssel
ChooseKeytypePage_new_pubkey_popup=W\u00E4hlen Sie diesen Button, wenn Sie einen neuen privaten Schl\u00FCssel eingeben m\u00F6chten
ChooseKPage_enter_k=Parameter k eingeben
ChooseKPage_select_k_text=Bitte w\u00E4hlen Sie aus der Liste einen Parameter k zwischen 0 und p-1.\n F\u00FCr diesen Parameter muss au\u00DFerdem gelten, dass ggT(k, p-1)=1.
DecryptSignPage_choose_action=Vorgehensweise w\u00E4hlen
DecryptSignPage_choose_action_text=Bitte w\u00E4hlen Sie ob Sie ein bestehendes Schl\u00FCsselpaar nutzen oder ein neues erzeugen wollen
DecryptSignPage_existing_keypair=Bestehendes Schl\u00FCsselpaar
DecryptSignPage_existing_keypair_popup=W\u00E4hlen Sie dies, wenn Sie ein bestehendes Schl\u00FCsselpaar aus dem Keystore laden m\u00F6chten
DecryptSignPage_new_keypair=Neues Schl\u00FCsselpaar
DecryptSignPage_new_keypair_popup=W\u00E4hlen Sie dies, wenn Sie ein neues Schl\u00FCsselpaar erzeugen wollen
ElGamalComposite_algorithm=Algorithmus
ElGamalComposite_calculate=Berechnen
ElGamalComposite_calculate_popup=Klicken Sie hier um die Berechnungen abzuschlie\u00DFen ohne weitere Schritte anzuzeigen.
ElGamalComposite_calculations=Berechnungen
ElGamalComposite_copy=Kopieren
ElGamalComposite_copy_to_clipboard=Text in die Zwischenablage kopieren
ElGamalComposite_data_loss=Die bisherigen Daten dieser Seite gehen verloren.
ElGamalComposite_decrypt=Entschl\u00FCsseln
ElGamalComposite_description=Das ElGamal-Kryptosystem ist ein asymmetrisches Verschl\u00FCsselungs- und Signaturverfahren.\nEs baut auf dem Problem des diskreten Logarithmus in zyklischen Gruppen auf.
ElGamalComposite_encrypt=Verschl\u00FCsseln
ElGamalComposite_enter_param=Parameter w\u00E4hlen
ElGamalComposite_enter_param_text=Klicken Sie hier um Ihren f\u00FCr diesen Vorgang einzigartigen Zusatzparameter zu w\u00E4hlen.
ElGamalComposite_enter_text=Text eingeben
ElGamalComposite_finish_calculations=Berechnungsabschluss
ElGamalComposite_finish_calculations_text=F\u00FCr alle im Zahlfeld angegebenen Hex-Werte wird nun der Berechnungsschritt durchgef\u00FChrt. Das Ergebnis wird anschlie\u00DFen im Ergebnisfeld angezeigt.
ElGamalComposite_hextext=Text als Zahlen
ElGamalComposite_inherit_from=Daten von einem der drei anderen Tabs \u00FCbernehmen:
ElGamalComposite_invalid=ung\u00FCltig
ElGamalComposite_key=Schl\u00FCssel
ElGamalComposite_key_generation=Schl\u00FCsselerzeugung...
ElGamalComposite_key_generation_popup=Klicken Sie hier um den Schl\u00FCsselerzeugungswizard zu starten
ElGamalComposite_key_selection=Schl\u00FCsselwahl
ElGamalComposite_key_selection_message_text=Bitte w\u00E4hlen Sie nun den Schl\u00FCssel oder geben Sie einen neuen ein.
ElGamalComposite_options=Optionen
ElGamalComposite_reset=Zur\u00FCcksetzen
ElGamalComposite_result=Ergebnis
ElGamalComposite_show_dialogs=Dialoge anzeigen
ElGamalComposite_sign=Signieren
ElGamalComposite_start=Start
ElGamalComposite_start_calc=Berechnungen starten
ElGamalComposite_step=N\u00E4chster Schritt
ElGamalComposite_step1=Schritt {0} von {1}
ElGamalComposite_stepresult=Schrittergebnis
ElGamalComposite_sure=Sind Sie sicher?
ElGamalComposite_text=Text
ElGamalComposite_textentry=Texteingabe
ElGamalComposite_textentry_text=Bitte geben Sie nun den zu bearbeitenden Text ein.
ElGamalComposite_title=ElGamal-Kryptosystem
ElGamalComposite_valid=g\u00FCltig
ElGamalComposite_verify=Verifizieren
ElGamalData_inherit_password_text=Bitte geben Sie das zum ausgew\u00E4hlten Schl\u00FCsselpaar geh\u00F6rende Passwort ein.
ElGamalData_inherit_password_title=Passwort
ElGamalData_ExAccessKeystorePassword=Auf den Schl\u00FCsselspeicher kann nicht zugegriffen werden. Bitte Überprüfen Sie das Passwort.
EncryptVerifyPage_choose_action=Vorgehensweise w\u00E4hlen.
EncryptVerifyPage_choose_action_text=Bitte w\u00E4hlen Sie ob Sie einen bestehenden Schl\u00FCssel nutzen oder einen neuen erzeugen wollen
EncryptVerifyPage_load_key=Bestehender \u00F6ffentlicher Schl\u00FCssel
EncryptVerifyPage_load_key_popup=W\u00E4hlen Sie dies, wenn Sie einen bestehenden \u00F6ffentlichen Schl\u00FCssel aus dem Keystore laden m\u00F6chten
EncryptVerifyPage_manual_entry=Manuelle Eingabe
EncryptVerifyPage_manual_entry_popup=W\u00E4hlen Sie dies, wenn Sie den \u00F6ffentlichen Schl\u00FCssel manuell eingeben m\u00F6chten
EnterCiphertextPage_ciphertext_text=Bitte geben Sie den Chiffretext als leerzeichenseparierte Hex-Werte ein.
EnterCiphertextPage_enter_ciphertext=Chiffretext eingeben.
EnterCiphertextPage_error_param_gt_mod=Einer der angegebenen Werte ist gr\u00F6\u00DFer als der Modulus, dies ist auf normalem Weg nicht m\u00F6glich.\n Bitte korrigieren Sie diesen Fehler
EnterCiphertextPage_textentry=Texteingabe
EnterPlaintextPage_enter_plaintext=Klartext eingeben.
EnterPlaintextPage_enter_plaintext_text=Bitte geben Sie den zu verschl\u00FCsselnden bzw. zu signierenden Text in das vorgesehene Feld ein.
EnterPlaintextPage_simple_hash=Das hier angewendete Hashverfahren ist ein stark vereinfachtes Verfahren:\nDie Buchstaben der Nachricht werden zun\u00E4chst in ihre ASCII-Werte \u00FCbersetzt und anschlie\u00DFend modulo N aufaddiert.\nDas Ergebnis ist ein Hashwert der Nachricht, der anschlie\u00DFend f\u00FCr die Siganturerstellung genutzt wird.\nF\u00FCr reale Anwendungen wird statt dieses einfachen Verfahrens ein Hashverfahren wie SHA-1 verwendet, das bessere kryptographische Sicherheit bietet.
EnterPlaintextPage_textentry=Texteingabe
EnterPlaintextPage_use_sha1=SHA-1 verwenden
EnterPlaintextPage_use_sha1_popup=W\u00E4hlen Sie dieses Feld aus, wenn Sie statt des einfachen Hashverfahrens SHA-1 verwenden m\u00F6chten
EnterSignaturePage_enter_signature=Signatur eingeben
EnterSignaturePage_enter_signature_text=Bitte geben Sie die zu \u00FCberpr\u00FCfende Signatur als Hex-Wert ein.\nErg\u00E4nzend k\u00F6nnen Sie auch den Klartext dazu eingeben, dann findet eine automatische Signaturpr\u00FCfung statt sobald der Algorithmus abgeschlossen ist.
EnterSignaturePage_error_invalid_r=Das eingegebene r ist nicht g\u00FCltig (0<r<p).
EnterSignaturePage_error_invalid_s=Das eingegebene s ist nicht g\u00FCltig (0<s<p-1).
EnterSignaturePage_signatureen=Signatureingabe
EnterSignaturePage_textentry=Texteingabe
EnterSignaturePage_use_sha1=SHA-1 verwenden
EnterSignaturePage_use_sha1_popup=W\u00E4hlen Sie dieses Feld aus, wenn Sie statt des einfachen Hashverfahrens SHA-1 verwenden m\u00F6chten
KeySelectionWizard_keyselection=Schl\u00FCsselauswahl
LoadKeypairPage_enter_password=Bitte geben Sie das zu diesem Schl\u00FCsselpaar geh\u00F6rige Passwort ein.\nSollte kein Passwort gesetzt sein, lassen Sie das Feld einfach leer.
LoadKeypairPage_select_keypair=Schl\u00FCsselpaar ausw\u00E4hlen
LoadKeypairPage_select_keypair_from_list=Bitte w\u00E4hlen Sie ein Schl\u00FCsselpaar aus der Liste aus.
LoadKeypairPage_select_keypair_text=Bitte w\u00E4hlen Sie ein Schl\u00FCsselpaar aus
LoadPublicKeyPage_select_from_list=Bitte w\u00E4hlen Sie einen \u00F6ffentlichen Schl\u00FCssel aus der Liste aus
LoadPublicKeyPage_select_pubkey=\u00D6ffentlichen Schl\u00FCssel ausw\u00E4hlen.
LoadPublicKeyPage_select_pubkey_text=Bitte w\u00E4hlen Sie aus, welchen \u00F6ffentlichen Schl\u00FCssel Sie verwenden m\u00F6chten.
NewKeypairPage_A_explanation=Aus diesem wird Ihr \u00F6ffentlicher Schl\u00FCssel als A=g^a mod p berechnet.
NewKeypairPage_choose_p_text=Bitte w\u00E4hlen Sie aus der Liste eine Primzahl p > 256 oder geben Sie eine eigene ein.
NewKeypairPage_choose_params=Parameter festlegen.
NewKeypairPage_choose_params_text=Bitte geben Sie hier die Parameter ein, um ein neues ElGamal Schl\u00FCsselpaar zu erzeugen.
NewKeypairPage_choose_q_text=Alternativ k\u00F6nnen Sie eine Primzahl q eingeben, bei der p=2\u2219q+1 auf ihre Primzahleigenschaft \u00FCberpr\u00FCft wird.
NewKeypairPage_error_invalid_a=Bitte w\u00E4hlen Sie a im angegebenen, g\u00FCltigen Bereich
NewKeypairPage_error_p_lt_256=Bitte w\u00E4hlen Sie ein p, das gr\u00F6\u00DFer als 256 ist, dies ist f\u00FCr die Funktion des Algorithmus notwendig.
NewKeypairPage_error_p_not_prime=P ist keine Primzahl, dies wird zu unerw\u00FCnschten Ergebnissen f\u00FChren.
NewKeypairPage_error_q_not_prime=Q ist keine Primzahl, dies wird zu unerw\u00FCnschten Ergebnissen f\u00FChren.
NewKeypairPage_real_g_values=In realen Anwendungen wird g in der Regel als 2 oder 5 gew\u00E4hlt.
NewKeypairPage_save_keypair=Schl\u00FCsselpaar speichern
NewKeypairPage_save_keypair_popup=W\u00E4hlen Sie diese Box an, um das Schl\u00FCsselpaar im mitgelieferten Keystore f\u00FCr weitere Verwendung zu speichern
NewKeypairPage_select_a=W\u00E4hlen Sie zuletzt ein beliebiges a zwischen 2 und p-2, dies ist Ihr privater Schl\u00FCssel.
NewKeypairPage_select_g=W\u00E4hlen Sie nun aus den angebotenen Werten eine Primitivwurzel von p aus.
NewPublicKeyPage_error_A_gt_p=Bitte w\u00E4hlen Sie Ihr A<p.
NewPublicKeyPage_error_g_not_generator=Bitte w\u00E4hlen Sie g als Generator zu p.
NewPublicKeyPage_error_p_lt_256=Bitte w\u00E4hlen Sie Ihr p>256.
NewPublicKeyPage_error_p_not_prime=Bitte w\u00E4hlen Sie p prim.
NewPublicKeyPage_save_pubkey=\u00D6ffentlichen Schl\u00FCssel speichern
NewPublicKeyPage_save_pubkey_popup=w\u00E4hlen Sie dieses Feld um den \u00F6ffentlichen Schl\u00FCssel im mitgelieferten Keystore zu speichern.
NewPublicKeyPage_select_A=Zuletzt w\u00E4hlen Sie bitte noch Ihren \u00F6ffentlichen Exponenten A.
NewPublicKeyPage_select_g=Bitte w\u00E4hlen Sie Ihren Generator g.
NewPublicKeyPage_select_p=Bitte w\u00E4hlen Sie Ihren ElGamal Modul p > 256
NewPublicKeyPage_select_params=Parameter festlegen.
NewPublicKeyPage_select_params_text=Bitte geben Sie die Parameter des \u00F6ffentlichen Schl\u00FCssels ein.
SaveKeypairPage_enter_save_params=Bitte geben Sie die Speicherparameter f\u00FCr das eben erzeugte Schl\u00FCsselpaar an
SaveKeypairPage_error_passwords_dont_match=Die eingegebenen Passw\u00F6rter stimmen nicht \u00FCberein
SaveKeypairPage_name=Bitte geben Sie den Namen des Schl\u00FCsselbesitzers ein
SaveKeypairPage_password=Bitte geben Sie ein Passwort ein und best\u00E4tigen Sie es
SaveKeypairPage_save_keypair=Schl\u00FCsselpaar speichern.
SavePublicKeyPage_enter_name=Bitte geben Sie den Namen des Schl\u00FCsselbesitzers ein
SavePublicKeyPage_enter_save_params=Bitte geben Sie die Speicherparameter f\u00FCr diesen \u00F6ffentlichen Schl\u00FCssel an
SavePublicKeyPage_save_pubkey=\u00D6ffentlichen Schl\u00FCssel speichern.
TextEntryWizard_textentry=Texteingabe
UniqueKeyWizard_unique_param=Einzigartigen Parameter eingeben