#Eclipse modern messages class
		
Tab0_Head0=Merkle-Signaturverfahren
		
Tab0_Txt0=Mit dem Merkle-Signaturverfahren (MSS) k\u00f6nnen Nachrichten Quantencomputer-resistent vor unbemerkter Manipulation gesch\u00fctzt werden. Die Signatur besteht aus zwei Teilen, einerseits einem Einmalsignaturverfahren (OTS) und anderseits dem MerkleTree, einem bin\u00E4ren Hashbaum. Der Vorteil des MerkleTrees ist, dass f\u00fcr mehrere \u00f6ffentliche OTS-Schl\u00fcssel nur ein einzelner \u00f6ffentlicher Merkle-Schl\u00fcssel notwendig ist. Dies wird dadurch realisiert, dass man die Hashwerte der \u00f6ffentlichen OTS-Schl\u00fcssel mit Hilfe des MerkleTrees zu einem einzigen Hashwert an der Spitze des Baums zusammenfasst. Dieser Wert im Wurzelknoten bildet den \u00f6ffentlichen Merkle-Schl\u00fcssel.
Tab0_Txt2=Das Merkle-Signaturverfahren (MSS) benutzt als OTS die Winternitz One Time Signature (WOTS). Aus einem zuf\u00E4lligen Seed wird mithilfe eines kryptografischen Pseudozufallszahlengenerators eine beliebige, frei w\u00E4hlbare Anzahl von WOTS-Schl\u00fcsselpaaren generiert. In der Praxis ist die Anzahl immer eine Zweierpotenz (2^h), da dies die Verwendung eines vollst\u00E4ndigen Bin\u00E4rbaumes erm\u00f6glicht. Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.

Tab1_Head0=Merkle-Signaturverfahren
Tab1_Txt0=Der hier dargestellte MerkleTree besteht aus den Hashwerten der \u00f6ffentlichen Schl\u00fcssel, die immer wieder miteinander verkn\u00fcpft und gehasht werden h(m1|m2), bis nur noch der Wurzelknoten bleibt.\r\n\r\nSignatur:\r\nZum Signieren einer Nachricht wird zuerst die Nachricht mit einer Einmalsignatur (OTS), die mit dem privaten OTS-Schl\u00fcssel erzeugt wird, signiert. Der private OTS-Schl\u00fcssel wird mithilfe des privaten Merkle-Schl\u00fcssels berechnet. Da pro OTS-Schl\u00fcsselpaar nur eine Nachricht signiert werden kann, sind die OTS-Schl\u00fcsselpaare von 0 bis (2^h)-1 nummeriert und werden der Reihe nach zum Signieren verwendet. Dieser sogenannte Index ist im privaten OTS-Schl\u00fcssel hinterlegt und gibt das als N\u00E4chstes zu nutzende OTS-Schl\u00fcsselpaar an. Der Index wird bei jedem Signaturvorgang aktualisiert. Dadurch wird verhindert, dass ein OTS-Schl\u00fcsselpaar mehrfach benutzt wird. Die eigentliche Merkle-Signatur besteht somit aus der Einmalsignatur, dem Index des n\u00E4chsten noch nicht verwendeten OTS-Schl\u00fcsselpaares und dem Inhalt der hier rot markierten Knoten. Die roten Knoten zusammen stellen den sogenannten Authentifizierungspfad dar.\r\n\r\nVerifikation:\r\nF\u00fcr eine erfolgreiche Verifikation einer Nachricht werden folgende Informationen ben\u00f6tigt:\r\n\u2022 der \u00f6ffentliche Merkle-Schl\u00fcssel (MSS-Schl\u00fcssel)\r\n\u2022 die Merkle-Signatur (enth\u00E4lt OTS-Sigantur, Index und Authentisierungspfad)\r\n\u2022 die Nachricht\r\n\r\nF\u00fcr die Verifikation wird aus der OTS-Signatur und der Nachricht ein \u00f6ffentlicher OTS-Schl\u00fcssel berechnet. Gemeinsam mit dem Index und dem Authentifizierungspfad wird ein alternativer Wurzelknoten berechnet. Wenn der errechnete Wert mit dem \u00f6ffentlichen MSS-Schl\u00fcssel \u00fcbereinstimmt, ist die Verifikation erfolgreich und die Signatur wird akzeptiert, ansonsten schl\u00E4gt die Verifikation fehl.\r\n\r\nLegende:\r\nGelb: Pfad des privaten OTS-Schl\u00fcssel zur Wurzel. Rot: Knoten auf dem Authentifizierungspfad
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.

Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | OTS-Signatur | \u00D6ffentlicher Merkle-Schl\u00fcssel | Authentifizierungspfad