#Eclipse modern messages class	
Tab0_Head0=eXtended Merkle Signaturverfahren	

Tab0_Txt0=Das eXtended Merkle Signature Scheme (XMSS) ist ein Verfahren, das auf der Merkle-Signatur basiert und diese erweitert. Ein Vorteil des XMSS-Verfahrens ist, dass die erstellten Signaturen kleiner sind als beim MSS-Verfahren. Ein weitere Unterscheid zum MSS-Verfahren ist der Einsatz einer Bitmaske Q und eines sogenannten L-Trees. Mithilfe dieser beiden Erweiterungen kann auf eine kollisionsresistente Hashfunktion verzichtet werden und durche eine zweite Urbild resistente Hashfunktion ersetzt werden.
Tab0_Txt2=Das XMSS-Verfahren benutzt als OTS die Winternitz One Time Signature (WOTS) im Seedmodus. Mit Hilfe eines Seeds kann eine beliebige Anzahl Schl\u00fcsselpaare generiert werden in der Praxis ist die Anzahl aber immer eine Zweierpotenz (2^n), weil es sonst zu Problemen bei der Signatur-Verifikation kommt. Mehr Information \u00fccber das WOTS-Verfahren finden Sie in der Hilfe.
Tab0_Txt3=Die Bitmaske ist einer der wesentlichen Unterschiede zum MSS-Verfahren. Sie ist ein pseudozuf\u00E4lliger bin\u00E4rer Wert und wir mit einem Pseudozufallsgenerator erzeugt. Hier können Sie den Seed f\u00fcr den Pseudozufallsgenerator erstellen.
Tab0_Head3=Bitmaske
Tab0_Button3=Seed f\u00fcr Bitmaske erzeugen

Tab1_Head0=eXtended Merkle Tree
Tab1_Txt0=Der hier dargestellte eXtended Merkle Tree besteht aus Hashwerten der veröffentlichen Schl\u00fcssel, die immer wieder miteinander verkn\u00fcpft, anschließen mit einer Bitmasek Q XOR verkn\u00fcpft und danach gehasht werden, bis nur mehr der Wurzelknoten bleibt.\r\n\r\nSignierung: \r\nDie Nachricht wird mit einem pseudozuf\u00E4llig ermittelten WOTS Schl\u00fcsselpaar signiert. Die XMSS-Signatur besteht aus dem Index des Schl\u00fcsselpaares, der WOTS-Signatur und dem Inhalt der hier rot markierten Knoten, welcher auch Verifizierungspfad genannt wird.\r\n\r\nVerifikation:\r\nF\u00fcr eine erfolgreiche Verifikation einer Nachricht werden folgende Informationen benötigt:\r\n\u2022 Die Nachricht \r\n\u2022 Die Signatur der Nachricht \r\n\u2022 Den XMSS Public-Key \r\n\r\n Zuerst wird die Einmalsignatur \u00fcberpr\u00fcft, wenn die Pr\u00fcfung fehlschl\u00E4gt, m\u00fcssen die restlichen Schritte nicht mehr ausgef\u00fchrt werden. Im Falle einer erfolgreichen Verifikation wird der öffentliche Schl\u00fcssel aus der Einmalsignatur generiert und mit Hilfe des Index im Baum versucht, durch Hashen mit den Inhalten der Knoten den Merkle-Public-Schl\u00fcssel zu erreichen, welcher vorher durch einen zweiten, sicheren Kommunikationskanal \u00fcbertragen wurde.\r\n\r\nLegende: Gelb: Knoten in der Ver\u00E4nderungskette Rot: Knoten auf dem Authentifizierungspfad
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus dessen Hashwert Sie sehen wollen.