#Eclipse modern messages class	
Tab0_Head0=eXtended Merkle MultiTree Signaturverfahren
Tab0_Txt0=Das eXtended Merkle Signature Scheme (XMSS) ist ein Verfahren, dass auf der Merkle-Signatur basiert und diese erweitert. Ein Vorteil des XMSS-Verfahrens ist, dass die erstellten Signaturen kleiner sind als beim MSS-Verfahren. Ein weitere Unterscheid zum MSS-Verfahren ist der Einsatz einer Bitmaske Q und eines sogenannten L-Trees. Mithilfe dieser beiden Erweiterungen kann auf eine kollisionsresistente Hashfunktion verzichtet werden und durche eine zweite Urbild resistente Hashfunktion ersetzt werden.
Tab0_Txt1=Das XMSS^MT-Verfahren benutzt als Einmalsignatur die Winternitz One Time Signature (WOTS). Die beiden m\u00f6glichen Varianten sind WOTS+ oder WOTS$. In diesem Plug-in wird die Variante WOTS+ verwendet. Der Winternitz-Parameter w ist ein Parameter dieses Verfahrens. Die Gr\u00F6\u00DFe der Signatur h\u00E4ngt davon ab. Je gr\u00F6\u00DFer der Wert, desto kleiner werden die Signaturen, jedoch erh\u00F6ht sich auch der Berechnungsaufwand. Die Sicherheit wird nicht beeinflusst. Obwohl der Parameter beliebig gro\u00df gew\u00E4lt werden k\u00f6nnte, wird praktisch meist 4 und 16 verwendet.
Tab0_Txt2=Aus einem zuf\u00E4lligen Seed wird mithilfe eines kryptografischen Pseudozufallszahlengenerators eine beliebige, frei w\u00E4hlbare Anzahl von WOTS-Schl\u00fcsselpaaren generiert. In der Praxis ist die Anzahl immer eine Zweierpotenz (2^h), da dies die Verwendung eines vollst\u00E4ndigen Bin\u00E4rbaumes erm\u00f6glicht. Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.
#Tab0_Txt3=Die Bitmaske ist einer der wesentlichen Unterschiede zum MSS-Verfahren. Durch ihren Einsatz kann auf eine kollisionsresistente Hashfunktion verzichtet werden. Die Bitmaske ist normalerweise ein zufällig gewählter binärer Wert. In dieser Visualisierung kann sie jedoch auch durch den Benutzer festgelegt werden.
#Tab0_Head3=Bitmaske
#Tab0_Button3=Bitmaske erzeugen
#Tab0_Button4=Anzahl der Ebenen
Tab0_Lable2=Single Tree Height

Tab1_Head0=XMSS-MultiTree
Tab1_Txt0=In dieser Ansicht wird der XMSS-Baum visualisert. Wenn man einen Knoten auswählt, so wird der Inhalt dieses Knotens angezeigt.
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, den Sie \u00E4ndern wollen, und Sie bekommen auch alle anderen Knoten die ver\u00E4ndert werden markiert.
