#Eclipse modern messages class
		
Tab0_Head0=Merkle Signaturverfahren
		
Tab0_Txt0=Mit Merkle-Signaturen können Nachrichten Quantencomputer-resistent vor unbemerkter Manipulation gesch\u00fctzt werden. Die Signatur besteht aus zwei Teilen, einerseits einem Einmalsignaturverfahren (OTS) und anderseits dem MerkleTree, einem Hashbaum. Das OTS-Verfahren sichert die Integrit\u00E4t der Nachricht selbst, w\u00E4hrend der MerkleTree die Daten, welche zum Verifizieren \u00fcber einen sicheren Kanal \u00fcbertragen werden m\u00fcssen, stark reduziert.\r\nEs muss lediglich die Baumwurzel, der \u00f6ffentliche Schl\u00fcssel des MerkleTrees, sicher \u00fcbertragen werden.
Tab0_Txt2=Das Merkle-Signaturverfahren (MSS) benutzt als OTS die Winternitz One Time Signature (WOTS) im Seedmodus. Mit Hilfe eines Seeds kann eine beliebige Anzahl Schl\u00fcsselpaare generiert werden. In der Praxis ist die Anzahl aber immer eine Zweierpotenz (2^n), weil es sonst zu Problemen bei der Signatur-Verifikation kommt. Mehr Information \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.

Tab1_Head0=Merkle Signaturverfahren
Tab1_Txt0=Der hier dargestellte MerkleTree besteht aus Hashwerten der ver\u00f6ffentlichen Schl\u00fcssel, die immer wieder miteinander verkn\u00fcpft und gehasht werden h(m1|m2), bis nur mehr der Wurzelknoten bleibt.\r\n\r\nSignierung: \r\nZum Signieren einer Nachricht wird zuerst die Nachricht mit einer Einmalsignatur (OTS), die mit dem privaten Merkle-Schl\u00fcssel erzeugt wird, signiert. Die eigentliche Merkle-Signatur besteht aus der Einmalsignatur, dem Index des Schl\u00fcsselpaares und dem Inhalt der hier rot markierten Knoten. Die roten Knoten zusammen stellen den sogenannten Verifizierungspfad oder Authentifizierungspfad dar.\r\n\r\nVerifikation:\r\nF\u00fcr eine erfolgreiche Verifikation einer Nachricht werden folgende Informationen ben\u00f6tigt:\r\n\u2022 Die Nachricht \r\n\u2022 Die Einmalsignatur der Nachricht \r\n\u2022 Der \u00f6ffentliche Merkle-Schl\u00fcssel \r\n\r\nZuerst wird die Einmalsignatur \u00fcberpr\u00fcft. Wenn die Pr\u00fcffung fehlschl\u00E4gt, m\u00fcssen die restlichen Schritte nicht mehr ausgef\u00fchrt werden. Im Falle einer erfolgreichen Verifikation wird der öffentliche Schl\u00fcssel aus der Einmalsignatur generiert und mit Hilfe des Index im Baum versucht, durch Hashen mit den Inhalten der Knoten den \u00f6ffentlichen Merkle-Schl\u00fcssel zu erreichen, welcher vorher durch einen zweiten, sicheren Kommunikationskanal \u00fcbertragen wurde.\r\n\r\nLegende: Gelb: Knoten in der Ver\u00E4nderungskette. Rot: Knoten auf dem Authentifizierungspfad
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.

Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | OTS-Signatur | \u00D6ffentlicher Merkle-Schl\u00fcssel | Authentifizierungspfad