#Eclipse modern messages class
		
Tab0_Head0=Merkle-Signaturverfahren
Tab0_Key_Button=Merkle-Schl\u00FCsselpaar erzeugen
MerkleTree_Generation_Info=Bitte erstellen Sie zuerst ein Merkle-Schl\u00FCsselpaar.
Tab0_MessageBox0=Sie haben erfolgreich ein Merkle-Schl\u00FCsselpaar erstellt.
		
Tab0_Txt0=Mit dem Merkle-Signaturverfahren (MSS) k\u00f6nnen Nachrichten quantencomputerresistent vor unbemerkter Manipulation gesch\u00fctzt werden. Das Verfahren beruht auf zahlreichen Einmalsignaturen (OTS), die in einem bin\u00E4ren Hashbaum (MerkleTree) zusammengefasst werden. Der Vorteil des MerkleTrees ist, dass alle \u00f6ffentliche Einmalsignaturschl\u00fcssel zu einem einzelnen \u00f6ffentlicher Merkle-Schl\u00fcssel aggregiert werden. Das wird realisiert, indem die Hashwerte der \u00f6ffentlichen Einmalsignaturschl\u00fcssel einen MerkleTree aufbauen, also zu einem einzigen Hashwert an der Spitze des Baums zusammengefasst werden. Dieser Wert im Wurzelknoten bildet den \u00f6ffentlichen Merkle-Schl\u00fcssel.
Tab0_Txt1=Das Merkle-Signaturverfahren (MSS) benutzt als Einmalsignatur die Winternitz One Time Signature (WOTS). Der Winternitz-Parameter w ist ein Parameter dieses Verfahrens. Die Gr\u00F6\u00DFe der Signatur h\u00E4ngt davon ab. Je gr\u00F6\u00DFer der Wert, desto kleiner werden die Signaturen, jedoch erh\u00F6ht sich auch der Berechnungsaufwand. Die Sicherheit wird nicht beeinflusst. Obwohl der Parameter beliebig gro\u00df gew\u00E4hlt werden k\u00f6nnte, wird praktisch meist 4 und 16 verwendet.  Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.
Tab0_Txt2= Bei der Schl\u00FCsselerzeugung wird aus einem zuf\u00E4lligen Seed mithilfe eines kryptografischen Pseudozufallszahlengenerators eine beliebige, frei w\u00E4hlbare Anzahl von Einmalschl\u00fcsselpaaren, sowie daraus der MerkleTree, generiert. In der Praxis ist die Anzahl der Einmalsignaturen immer eine Zweierpotenz (2^h), da dies die Verwendung eines vollst\u00E4ndigen Bin\u00E4rbaumes erm\u00f6glicht.

Tab1_Head0=Merkle-Signaturverfahren
Tab1_Txt0=Der hier dargestellte MerkleTree besteht aus den Hashwerten der \u00f6ffentlichen Schl\u00fcssel, die immer wieder miteinander verkn\u00fcpft und gehasht werden h(m1|m2), bis nur noch der Wurzelknoten bleibt.\r\n\r\nSignatur:\r\nZum Signieren einer Nachricht wird zuerst eine Einmalsignatur \u00fcber die Nachricht erstellt. Da pro Einmalschl\u00fcsselpaar nur eine Nachricht signiert werden kann, sind die Einmalschl\u00fcsselpaare von 0 bis (2^h)-1 nummeriert und werden der Reihe nach zum Signieren verwendet. Dieser sogenannte Index ist im privaten Einmalsignaturschl\u00fcssel hinterlegt und gibt das als n\u00E4chstes zu nutzende Einmalsignaturschl\u00fcsselpaar an. Der Index wird bei jedem Signaturvorgang aktualisiert. Dadurch wird verhindert, dass eine Einmalsignatur mehrfach benutzt wird. Die eigentliche Merkle-Signatur besteht aus dem Index und der Einmalsignatur. Da bei der Signaturpr\u00FCfung der MerkleTree bis hin zum Wurzelknoten erneut berechnet und mit dem \u00F6ffentlichen Merkle-Schl\u00FCssel verglichen wird, muss zus\u00E4tlich der Inhalt der jeweils gegen\u00FCberliegenden Bl\u00E4tter und Knoten zur Signatur hinzugef\u00FCgt werden. Diese erg\u00E4nzende Information hei\u00DFt Authentifizierungspfad. Die Signaturerstellung k\u00F6nnen Sie im Reiter \u0022Signierung\u0022 auch Schritt f\u00FCr Schritt nachverfolgen.\r\nVerifikation:\r\nDer Vorgang wird im Reiter \u0022Verifikation\u0022 erkl\u00E4rt.\r\n\r\nSie k\u00F6nnen Bl\u00E4tter ausw\u00E4hlen um deren Hashwert anzuzeigen, sowie den Pfad zur Wurzel sowie den dazugeh\u00F6rigen Authentifikationspfad einf\u00E4rben zu lassen. Wenn Sie die Maus \u00FCber einen Knoten halten, erscheint auch dessen Hashwert.\r\nLegende: Gelb - Pfad eines Blattes/Knotens zur Wurzel. Rot - Knoten auf dem Authentifizierungspfad.
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.

Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | Einmalsignatur | \u00D6ffentlicher Merkle-Schl\u00fcssel | Authentifizierungspfad
MerkleTreeVerify_0=Hier k\u00f6nnen Sie die im Reiter "Signierung" erzeugte Signatur mit Hilfe des richtigen Knotens im MerkleTree verifizieren. Initial wird bei der Anzeige gleich das Blatt mit dem richtigen Index (gelber Pfad) ausgew\u00E4hlt. Sie k\u00f6nnen auch einen anderes Blatt mit falschem Index ausw\u00E4hlen - dann schl\u00E4gt die Verifikation fehl.\r\n\r\nF\u00FCr die Verifikation werden folgende Informationen ben\u00f6tigt:\r\n\u2022der \u00f6ffentliche Merkle-Schl\u00FCssel (Merkle-Schl\u00FCssel)\r\n\u2022die Merkle-Signatur bestehend aus Index, Einmalsignatur und Authentifizierungspfad\r\n\u2022die Nachricht\r\nF\u00FCr die Verifikation wird aus der Einmalsignatur und der Nachricht ein \u00f6ffentlicher Einmalschl\u00FCssel berechnet. Anstatt nun diesen \u00F6ffentlichen Einmalschl\u00FCssel zu pr\u00FCfen, wird er als Blatt f\u00FCr die Berechnung des Baumes herangezogen. Mit diesem Blatt und dem Authentifizierungspfad wird der Wurzelknoten berechnet. Wenn der errechnete Wert mit dem Wurzelknoten des \u00f6ffentlichen Merkle-Schl\u00FCssel \u00FCbereinstimmt, ist die Verifikation erfolgreich und die Signatur wird akzeptiert, ansonsten schl\u00E4gt die Verifikation fehl.


MerkleTreeKeyTab_0=Hier wird das Merkle-Schl\u00FCsselpaar angezeigt.\n\u2022 Der \u00f6ffentliche Schl\u00FCssel besteht aus dem Wurzelknoten und dem verwendeten Seed.\n\u2022 Der private Schl\u00FCssel besteht aus dem Index des n\u00e4chsten zu verwendenden Einmalsignaturschl\u00FCsselpaares, dem Seed und allen privaten Einmalschl\u00FCsseln.