#Eclipse modern messages class	
Tab0_Head0=eXtended Merkle MultiTree Signaturverfahren
Tab0_Key_Button=XMSS^MT Schl\u00FCsselpaar erzeugen
MerkleTree_Generation_Info=Bitte erstellen Sie zuerst ein XMSS^MT Schl\u00FCsselpaar.
Tab0_MessageBox0=Sie haben erfolgreich ein XMSS^MT Schl\u00FCsselpaar erstellt.
Tab0_Txt0=Das MultiTree eXtended Merkle Signature Scheme (XMSS^MT) beruht auf mehreren miteinander verkn\u00FCpften XMSS-B\u00E4umen. Der Vorteil im Vergleich zu einem einfachen, gleich gro\u00DFen XMSS-Baum liegt im verringerten Berechnungsaufwand bei der Schl\u00FCsselerzeugung. Die Teilb\u00E4ume werden verkn\u00FCpft, indem ein XMSS-Baum die Wurzel des n\u00E4chsten Baumes signiert. Dadurch entstehen Ebenen (layer). Die unterste Ebene signiert schlie\u00DFlich Nachrichten. Sollten Sie mit dem XMSS-Verfahren noch nicht vertraut sein, wird empfohlen sich zuerst darin einzulesen. Es ist ebenfalls in diser Visualisierung verf\u00fcgbar.
Tab0_Txt1=Das XMSS^MT-Verfahren benutzt als Einmalsignatur die Winternitz One Time Signature (WOTS). Die beiden m\u00F6glichen Varianten sind WOTS+ oder WOTS$. In diesem Plug-in wird die Variante WOTS+ verwendet. Der Winternitz-Parameter w ist ein Parameter dieses Verfahrens. Die Gr\u00F6\u00DFe der Signatur h\u00E4ngt davon ab. Je gr\u00F6\u00DFer der Wert, desto kleiner werden die Signaturen, jedoch erh\u00F6ht sich auch der Berechnungsaufwand. Die Sicherheit wird nicht beeinflusst. Obwohl der Parameter beliebig gro\u00df gew\u00E4lt werden k\u00f6nnte, wird praktisch meist 4 und 16 verwendet. Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.
Tab0_Txt2=Im MultiTree Verfahren werden mehrere Teilb\u00E4ume gen\u00FCtzt, die jeweils gleich gro\u00DF sind. Hier k\u00F6nnen die Parameter f\u00FCr die Einzelbaumgr\u00F6\u00DFe und der daraus folgenden Anzahl an verf\u00FCgbaren Einmalsignaturen festgelegt werden. Bei der Schl\u00FCsselerzeugung werden mithilfe eines kryptografischen Pseudozufallszahlengenerators die Einmalsignaturschl\u00fcsselpaare und der MultiTree generiert.
Tab0_Txt3=Einzelbaumh\u00F6he

Tab1_Head0=MultiTree XMSS
Tab1_Txt0=Hier ist der soeben erstellte MultiTree als Graph dargestellt. Das Grundprinzip gleicht einem XMSS-Baum. Die einzelnen Teilb\u00E4ume sind auf Ebenen (layer) angeordnet und jeweils farbig markiert. Die B\u00E4ume der oberen Schicht signieren die Wurzeln der unteren Ebenen. Sie lassen sich also unabh\u00E4nging von einander generieren. Das spart Zeit bei der Schl\u00FCsselerzeugung, weil nur so viele B\u00E4ume erzeugt werden m\u00FCssen, wie auch ben\u00F6tigt werden. Ein weiterer Vorteil ist, dass verschiedene Einzelb\u00E4ume nicht die gleiche Hashfunktion verwenden m\u00FCssen. Sollte sich eine bisher in einem Schl\u00fcssel verwendete Hashfunktion als nicht mehr zuverl\u00E4ssig erweisen, kann beim n\u00E4chsten Einzelbaum einfach eine St\u00E4rkere verwendet werden, um die Sicherheit wieder zu erh\u00F6hen. Die Kompatabilit\u00E4t bleibt dabei gew\u00E4hrleistet, da die l\u00E4ngeren Hashes beim Signieren durch die dar\u00FCberliegende Ebene keinen Unterschied darstellen.\r\nDie Signatur unterscheidet sich leicht, weil sie aus mehreren XMSS-Teilsignaturen besteht, mehr dazu im Signieren/Verifizieren Reiter.\r\nSie k\u00F6nnen Bl\u00E4tter ausw\u00E4hlen um deren Hashwert anzuzeigen, sowie den Pfad zur Wurzel sowie den dazugeh\u00F6rigen Authentifikationspfad einf\u00E4rben zu lassen. Wenn Sie die Maus \u00FCber einen Knoten halten, erscheint auch dessen Hashwert.\r\nLegende: schwarz blinkend - Pfad eines Blattes/Knotens zur Wurzel. Rot - Knoten auf dem Authentifizierungspfad.
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.
Tab1_Node=Wurzel/Blatt
Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | Seed | n reduzierte XMSS-Signaturen bestehend aus \u00D6ffentlicher Merkle-Schl\u00fcssel | Authentifizierungspfad


MerkleTreeVerify_0=Hier k\u00f6nnen Sie die im Reiter \u0022Signierung\u0022 erzeugte Signatur mit Hilfe des richtigen Knotens im MultiTree verifizieren. Initial wird bei der Anzeige gleich das Blatt mit dem richtigen Index (schwarz blinkender Pfad) ausgew\u00E4hlt. Sie k\u00f6nnen auch einen anderes Blatt mit falschem Index ausw\u00E4hlen - dann schl\u00E4gt die Verifikation fehl. Der erste Schritt des Verifikationsvorgangs unterscheidet sich nicht von einem einfachen XMSS-Baum, denn zuerst wird auf der untersten Schicht des MultiTrees ein Einzelbaum berechnet, der \u00E4quivalent zu einem XMSS-Baum ist.\r\n\r\nF\u00FCr die Verifikation des Einzelbaums werden folgende Informationen ben\u00f6tigt:\r\n\u2022den Index und \u00F6ffentlichen Seed\r\n\u2022die reduzierte XMSS-Signatur bestehend aus Einmalsignatur und Authentifizierungspfad\r\n\u2022die Nachricht\r\nZuerst wird aus der Einmalsignatur und der Nachricht ein \u00f6ffentlicher Einmalschl\u00FCssel berechnet. Dieser \u00f6ffentliche Einmalschl\u00FCssel wird verwendet, um das verkn\u00FCpfte Blatt des L-Trees zu berechnen. Gemeinsam mit dem Index und dem Authentifizierungspfad wird der Wurzelknoten berechnet. Anstatt nun den Wurzelwert mit dem ver\u00F6ffentlichtem \u00F6ffentlichen Schl\u00FCssel abzugleichen, begeben wir uns auf die n\u00E4chste Ebene des MultiTrees. Der gerade errechnete Wurzelknoten wurde ebenfalls signiert - vom Einzelbaum eine Schicht dar\u00FCber. Diese Signatur k\u00F6nnen wir auf die gleiche Weise pr\u00FCfen. Nachdem alle Ebenen errechnet wurden, bleibt ein einzelner Wurzelknoten. Stimmt dieser mit dem Wurzelknoten des \u00F6ffentlichen XMSS^MT Schl\u00FCssel \u00FCberein, waren alle Signaturen der Kette korrekt und die XMSS^MT Signatur wird akzeptiert.
MerkleTreeKeyTab_0=Hier wird das XMSS^MT-Schl\u00FCsselpaar angezeigt.\n\u2022 Der \u00f6ffentliche Schl\u00FCssel besteht aus dem Wurzelknoten und dem \u00F6ffentlichen Seed.\n\u2022 Der private Schl\u00FCssel besteht aus dem Index des n\u00e4chsten zu verwendenden Einmalsignaturschl\u00FCsselpaares, dem \u00F6ffentlichen sowie privaten Seed und allen privaten Einmalschl\u00FCsseln.



