#Eclipse modern messages class	
Tab0_Head0=eXtended Merkle MultiTree Signaturverfahren
Tab0_Key_Button=XMSS^MT Schl\u00FCsselpaar erzeugen
MerkleTree_Generation_Info=Bitte erstellen Sie zuerst ein XMSS^MT Schl\u00FCsselpaar.
Tab0_MessageBox0=Sie haben erfolgreich ein XMSS^MT Schl\u00FCsselpaar erstellt.
Tab0_Txt0=Das MultiTree eXtended Merkle Signature Scheme (XMSS^MT) beruht auf mehreren miteinander verkn\u00FCpften XMSS-B\u00E4umen. Der Vorteil im Vergleich zu einem einfachen, gleich groﬂen XMSS-Baum liegt im verringerten Berechnungsaufwand bei der Schl\u00FCsselerzeugung. Die Teilb\u00E4ume werden verkn\u00FCpft, indem ein XMSS-Baum die Wurzel des n\u00E4chsten Baumes signiert. Die unterste Ebene signiert schlieﬂlich Nachrichten. 
Tab0_Txt1=Das XMSS^MT-Verfahren benutzt als Einmalsignatur die Winternitz One Time Signature (WOTS). Die beiden m\u00F6glichen Varianten sind WOTS+ oder WOTS$. In diesem Plug-in wird die Variante WOTS+ verwendet. Der Winternitz-Parameter w ist ein Parameter dieses Verfahrens. Die Gr\u00F6\u00DFe der Signatur h\u00E4ngt davon ab. Je gr\u00F6\u00DFer der Wert, desto kleiner werden die Signaturen, jedoch erh\u00F6ht sich auch der Berechnungsaufwand. Die Sicherheit wird nicht beeinflusst. Obwohl der Parameter beliebig gro\u00df gew\u00E4lt werden k\u00f6nnte, wird praktisch meist 4 und 16 verwendet. Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.
Tab0_Txt2=Im MultiTree Verfahren werden mehrere Teilb\u00E4ume gen\u00FCtzt, die jeweils gleich groﬂ sind. Hier k\u00F6nnen die Parameter f\u00FCr die Einzelbaumgr\u00F6ﬂe und der daraus folgenden Anzahl an verf\u00FCgbaren Einmalsignaturen festgelegt werden. Bei der Schl\u00FCsselerzeugung werden mithilfe eines kryptografischen Pseudozufallszahlengenerators die Einmalsignaturschl\u00fcsselpaare und der MultiTree generiert.
Tab0_Txt3=Einzelbaumh\u00F6he

Tab1_Head0=MultiTree XMSS
Tab1_Txt0=Das Grundprinzip gleicht einem XMSS-Baum. Die einzelnen Teilb\u00E4ume sind farbig markiert. Die B\u00E4ume der oberen Schicht signieren die Wurzeln der unteren Schichten. Sie lassen sich also unabh\u00E4nging von einander generieren. Das spart Zeit bei der Schl\u00FCsselerzeugung, weil nur so viele B\u00E4ume erzeugt werden m\u00FCssen, wie auch ben\u00F6tigt werden.\r\nDie Signatur unterscheidet sich leicht, weil sie aus mehreren XMSS-Teilsignaturen besteht, mehr dazu im Signieren/Verifizieren Reiter.
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.
Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | Seed | n reduzierte XMSS-Signaturen bestehend aus \u00D6ffentlicher Merkle-Schl\u00fcssel | Authentifizierungspfad

MerkleTreeKey_MT=\u00D6ffentlicher Seed
Tab0_Seed0=Privater Seed
Tab0_Seed1=\u00D6ffentlicher Seed
Tab0_Seed2=\u00D6ffentlichen Seed generieren
Tab0_Seed3=Privaten Seed generieren


