#Eclipse modern messages class	
Tab0_Head0=eXtended Merkle-Signaturverfahren	

Tab0_Txt0=Das eXtended Merkle Signature Scheme (XMSS) ist ein Verfahren, das auf der Merkle-Signatur basiert und diese erweitert. Unterschied zum MSS-Verfahren ist der Einsatz von Bitmasken und eines sogenannten L-Trees. Durch diese Erweiterungen ist es m\u00f6glich, auf eine kollisionsresistente Hashfunktion zu verzichten und diese durch eine Zweite-Urbild-resistente Hashfunktion zu ersetzen. Vorteil des Einsatzes einer Zweiten-Urbild-resistenten Hashfunktion ist, dass die erzeugte Signatur kleiner wird, da Geburtstagsangriffe nicht zum Finden zweiter Urbilder verwendet werden k\u00f6nnen (weitere Informationen zum Geburtstagsangriff finden Sie in der Onlinehilfe). Das zweite Urbild ist auch schwerer zu brechen als die Kollisionsresistenz, da zu einer gegebenen Nachricht eine kollidierende Nachricht gefunden werden muss. Zum Brechen der Kollisionsresistenz gen\u00fcgt es, ein beliebiges Nachrichtenpaar zu finden, das kollidiert.

Tab0_Txt2=Das XMSS-Verfahren benutzt als OTS eine Variante des Winternitz One Time Signature Schemes (WOTS). Die beiden m\u00f6glichen Varianten sind WOTS+ oder WOTS$. In diesem Plug-in wird die Variante WOTS+ verwendet. In beiden Varianten wird aus einem zuf\u00E4lligen Seed mithilfe eines kryptografischen Pseudozufallszahlengenerators eine beliebige, frei w\u00E4hlbare Anzahl von WOTS-Schl\u00fcsselpaaren generiert. In der Praxis ist die Anzahl immer eine Zweierpotenz (2^h), da dies die Verwendung eines vollst\u00E4ndigen Bin\u00E4rbaumes erm\u00f6glicht. Mehr Informationen \u00fcber das WOTS-Verfahren finden Sie in der Hilfe.


Tab1_Head0=eXtended MerkleTree
Tab1_Txt0=Der hier dargestellte eXtended MerkleTree besteht aus den Hashwerten der \u00f6ffentlichen Schl\u00fcssel, die immer wieder miteinander verkn\u00fcpft, anschlieﬂen mit einer Bitmaske Q XOR-verkn\u00fcpft und danach gehasht werden, bis nur mehr der Wurzelknoten bleibt.\r\n\r\nSignatur:\r\nZum Signieren einer Nachricht wird zuerst die Nachricht mit einer Einmalsignatur (OTS), die mit dem privaten OTS-Schl\u00fcssel erzeugt wird, signiert. Der private OTS-Schl\u00fcssel wird mithilfe des privaten Merkle-Schl\u00fcssels berechnet. Da pro WOTS-Schl\u00fcsselpaar nur eine Nachricht signiert werden kann, sind die WOTS-Schl\u00fcsselpaare von 0 bis (2^h)-1 nummeriert und werden der Reihe nach zum Signieren verwendet. Dieser sogenannte Index ist im privaten WOTS-Schl\u00fcssel hinterlegt und gibt das als N\u00E4chstes zu nutzende WOTS-Schl\u00fcsselpaar an. Der Index wird mit jedem Signaturvorgang aktualisiert. Dadurch wird verhindert, dass ein WOTS-Schl\u00fcsselpaar mehrfach benutzt wird. Die eigentliche Merkle-Signatur besteht somit aus der Einmalsignatur, dem Index des n\u00E4chsten noch nicht verwendeten WOTS-Schl\u00fcsselpaares und dem Inhalt der hier rot markierten Knoten. Die roten Knoten zusammen stellen den sogenannten Authentifizierungspfad dar.\r\n\r\nVerifikation:\r\nF\u00fcr eine erfolgreiche Verifikation einer Nachricht werden folgende Informationen ben\u00f6tigt:\r\n\u2022 der \u00f6ffentliche Merkle-Schl\u00fcssel (XMSS-Schl\u00fcssel)\r\n\u2022 die Merkle-Signatur (enth\u00E4lt OTS-Sigantur, Index und Authentisierungspfad)\r\n\u2022 die Nachricht\r\n\r\nF\u00fcr die Verifikation wird aus der OTS-Signatur und der Nachricht ein \u00f6ffentlicher OTS-Schl\u00fcssel berechnet. Dieser \u00f6ffentliche OTS-Schl\u00fcssel wird verwendet, um die Wurzel des korrespondierenden L-Trees zu berechnen. Gemeinsam mit dem Index und dem Authentifizierungspfad wird ein alternativer Wurzelknoten
Tab1_Txt1=W\u00E4hlen Sie einen Knoten aus, dessen Hashwert Sie sehen wollen.

Tab2_Txt0=Die Signatur der Nachricht besteht aus folgenden Komponenten: Index im Baum | OTS-Signatur | Authentifizierungspfad