#Eclipse modern messages class
CompositeDescriptionMerkleTree=Merkle-Signaturverfahren (MSS)
CompositeDescriptionXMSS=eXtended Merkle Signature Scheme (XMSS) 
CompositeDescriptionXMSS_MT=MultiTree (XMSS^MT)

MerkleTreeTab_0=Seed- und Schl\u00FCssel-Erzeugung
MerkleTreeTab_1=MerkleTree
MerkleTreeTab_2=Schl\u00FCsselpaar
MerkleTreeTab_3=Signierung
MerkleTreeTab_4=Verifikation

MerkleTree_Generation_Info=Bitte erstellen Sie im ersten Reiter einen Seed und die Schl\u00FCsselpaare. Diese werden f\u00FCr die Darstellung des MerkleTree ben\u00f6tigt.
ZestLabelProvider_0=Blatt
ZestLabelProvider_1=Knoten
ZestLabelProvider_2=Hash des \u00f6ffentlichen Merkle-Schl\u00FCssels
ZestLabelProvider_3=Wurzel
ZestLabelProvider_4=Inhalt
ZestLabelProvider_5=Inhalt von Blatt
ZestLabelProvider_6=Inhalt des Knoten
ZestLabelProvider_7=1
ZestLabelProvider_8=0

MerkleTreeKeyTab_0=Hier werden die in diesem Signaturverfahren benutzten Schl\u00FCssel angezeigt.\n\u2022 Der \u00f6ffentliche Schl\u00FCssel besteht aus dem Wurzelknoten und dem verwendeten Seed.\n\u2022 Der private Schl\u00FCssel besteht aus dem Index des n\u00e4chsten zu verwendenden OTS-Schl\u00FCsselpaares, dem Seed und allen privaten Einmalsignaturschl\u00FCsseln. Diese sind also der private Teil zu den \u00f6ffentlichen Einmalsignaturschl\u00FCsseln, die als Bl\u00E4tter im Baum verwendet werden.
MerkleTreeKeyTab_1=\u00d6ffentlicher Schl\u00FCssel
MerkleTreeKeyTab_2=Privater Schl\u00FCssel
MerkleTreeKeyTab_3=Index
MerkleTreeKeyTab_4=Seed
MerkleTreeKeyTab_5=Privater Einmalsignaturschl\u00FCssel
MerkleTreeKeyTab_6=Schl\u00FCsselteile farblich hervorheben:

MerkleTreeKey_1=Bitte erstellen Sie zuerst die Schl\u00FCssel
MerkleTreeKey_2=Schl\u00FCssell\u00e4nge:
MerkleTreeKey_3=Byte
MerkleTreeKey_4=Sie haben erfolgreich ein Schl\u00FCsselpaar erstellt.
MerkleTreeKey_5=Die Reiter "MerkleTree" und "Schl\u00FCsselpaar" bieten zus\u00E4tzliche Informationen und Erkl\u00E4rungen.\r\nIn den Reitern "Signierung" und "Verifikation" k\u00F6nnen Sie selbst Signaturen erstellen und pr\u00FCfen.

MerkleTreeKey_column_0=Schl\u00FCssel Nummer
MerkleTreeKey_column_1=Privater Schl\u00FCssel
MerkleTreeKey_column_2=\u00D6ffentlicher Merkle-Schl\u00FCssel
MerkleTreeKey_Message=Die Schl\u00FCsselpaare wurden erfolgreich erzeugt!

MerkleTreeSign_0=Nachricht definieren
MerkleTreeSign_1=Dies ist ein Beispieltext!\r\nSie k\u00f6nnen dieses Feld mit einem beliebigen Text f\u00FCllen und diesen dann mit den von Ihnen erzeugten Schl\u00FCssel signieren.
MerkleTreeSign_2=Nachricht signieren
MerkleTreeSign_4=Fehler bei der Signierung, bitte erzeugen Sie den Baum erneut! (Es wurden bereits alle Bl\u00e4tter verwendet)
MerkleTreeSign_5=Bitte geben Sie eine Nachricht ein, die Sie signieren m\u00f6chten!
MerkleTreeSign_6=Signaturl\u00E4nge:
MerkleTreeSign_7=Aktueller Schl\u00FCsselindex:
MerkleTreeSign_8=Es sind keine Einmalsignaturschl\u00FCssel mehr vorhanden. Generieren Sie einen neuen Schlüssel!


MerkleTreeVerify_0=Hier können Sie die im Reiter "Signierung" erzeugte Signatur mit Hilfe des richtigen Knotens im MerkleTree korrekt verifizieren. Initial wird bei der Anzeige gleich der Index für den richtigen Knoten (gelb) ausgew\u00E4hlt. Sie k\u00f6nnen auch einen anderen (falschen) Index ausw\u00E4hlen -- damit schl\u00E4gt die Verifikation dann fehl. Der Verifikationsvorgang startet, indem als Erstes der \u00f6ffentliche WOTS-Schl\u00FCssel der WOTS-Signatur berechnet wird. Dieser \u00f6ffentliche WOTS-Schl\u00FCssel wird verwendet, um das verkn\u00FCpfte Blatt des L-Trees zu berechnen.\r\n\r\nF\u00FCr die Verifikation werden folgende Informationen ben\u00f6tigt:\r\n\u2022 der \u00f6ffentliche Merkle-Schl\u00FCssel (MSS- oder XMSS-Schl\u00FCssel)\r\n\u2022 die Merkle-Signatur\r\n\u2022 die Nachricht\r\n\r\nF\u00FCr die Verifikation wird aus der OTS-Signatur und der Nachricht ein \u00f6ffentlicher OTS-Schl\u00FCssel berechnet. Gemeinsam mit dem Index und dem Authentifizierungspfad wird ein alternativer Wurzelknoten berechnet. Wenn der errechnete Wert mit dem \u00f6ffentlichen MSS-Schl\u00FCssel \u00FCbereinstimmt, ist die Verifikation erfolgreich und die Signatur wird akzeptiert, ansonsten schl\u00E4gt die Verifikation fehl.
MerkleTreeVerify_1=Nachricht
MerkleTreeVerify_2=Signatur
MerkleTreeVerify_3=Nachricht
MerkleTreeVerify_4=Erkl\u00E4rung
MerkleTreeVerify_5=Erstellte Signaturen
MerkleTreeVerify_6=Verifizieren
MerkleTreeVerify_7=Die Verifikation der Signatur mit dem ausgew\u00E4hlten Knoten war erfolgreich!
MerkleTreeVerify_8=Die Signatur konnte nicht erfolgreich verifiziert werden!
MerkleTreeVerify_9=Bitte klicken Sie auf Verifizieren, um den ausgew\u00E4hlten Knoten zu \u00FCberpr\u00FCfen.

MerkleTreeVerify_10=Pfad vom Root zum ausgew\u00E4hlten Blatt: 
MerkleTreeVerify_11=Bitte w\u00E4hlen Sie ein Blatt aus um die Signatur zu verifizieren. Ein Knoten kann nicht als g\u00FCltiger \u00f6ffentlicher Schl\u00FCssel verwendet werden!


MerkleTree_Signature_Generation_Info=Bitte erstellen Sie im vierten Reiter eine Signatur. Im gew\u00E4hlten Reiter kann diese dann verifiziert werden.

UnsavedChanges=Sie haben \u00C4nderungen an den Parametern vorgenommen, die noch nicht \u00FCbernommen wurden. \u00C4nderungen speichern?

Tab0_Head1=Seed
Tab0_Head2=Schl\u00FCsselpaare erzeugen
Tab0_Head3=Bitmaske
Tab0_Head4=Bitmasken-Seed
Tab0_Head5=Winternitz-Parameter

Tab0_MT_1=Baumh\u00F6he 2; Baumanzahl 15
Tab0_MT_2=Baumh\u00F6he 3; Baumanzahl 5
Tab0_MT_3=Baumh\u00F6he 2; Baumanzahl 63
Tab0_MT_4=Baumh\u00F6he 3; Baumanzahl 21
Tab0_MT_5=Baumh\u00F6he 4; Baumanzahl 9

Tab1_Button_1=Beschreibung ausblenden
Tab1_Button_2=Beschreibung einblenden

Tab0_Txt3=Der Einsatz von Bitmasken ist einer der wesentlichen Unterschiede zum MSS-Verfahren. Bitmasken sind pseudozuf\u00E4llige Bitstrings und werden mit einem Pseudozufallsgenerator erzeugt. Hier k\u00f6nnen Sie den Seed f\u00FCr den Pseudozufallsgenerator vorgeben.

Tab0_Button1=Neuen Seed erzeugen
Tab0_Button2=Schl\u00FCsselpaare erzeugen
Tab0_Button3=Neuen Seed f\u00FCr Bitmaske erzeugen

Tab0_Lable1=Anzahl der Einmalsignaturen

InteractiveSignature_Button_0=Interaktive Signaturerstellung
InteractiveSignature_Button_1=Zur\u00FCck
InteractiveSignature_Button_2=Weiter
InteractiveSignature_Button_3=Neue Signatur
InteractiveSignature_Button_4=Verifizieren
InteractiveSignature_Button_5=Einfache Signaturerstellung
InteractiveSignature_1=Willkommen bei der Interaktiven Signaturerstellung\nGeben sie eine Nachricht an, die signiert werden soll.
InteractiveSignature_2=Im ersten Schritt suchen wir ein freies OTS Schl\u00FCsselpaar.
InteractiveSignature_3_1=Hier, Blatt 
InteractiveSignature_3_2=ist verwendbar.\nWir schreiben also den Index des Blattes in die Signatur.
InteractiveSignature_4_1=Jetzt kommt die Einmalsignatur ins Spiel, sie wird zur Signatur hinzugef\u00FCgt. Der Wert des Blattes 
InteractiveSignature_4_2=ist der Hashwert des \u00d6ffentliche Schl\u00FCssels der Einmalsignatur. Er wird zur Berechnung des Merkletrees und damit auch zur \u00DCberpr\u00FCfung der Signatur ben\u00F6tigt.
InteractiveSignature_5=Um jetzt den Baum zu Hashen fehlt uns aber noch wichtige Information. Die Werte der rot markierten Nodes fehlen dem Pr\u00FCfer der Signatur und m\u00FCssen deshalb erg\u00E4nzt werden. Das ist der Authentifizierungspfad.
InteractiveSignature_6=Sind alle notwendigen Knoten bis zur Wurzel erg\u00E4nzt, ist die Signatur fertig. Sie kann jetzt im Tab \"Verifizieren\" \u00FCberpr\u00FCft werden.
InteractiveSignature_7=Aktueller Index:
InteractiveSignature_8=In diesem Tab k\u00f6nnen Signaturen erstellt werden. W\u00E4hlen Sie eine der zwei Optionen, sie unterscheiden sich lediglich in ihrer Darstellung.
InteractiveSignature_9=Die Signaturerstellung wird Schritt f\u00FCr Schritt vorgef\u00FChrt und erkl\u00E4rt. 
InteractiveSignature_10=Geben Sie einen Text ein und erhalten Sie sofort eine Signatur.

