#Eclipse modern messages class
CompositeDescriptionMerkleTree=Merkle Signature Scheme (MSS)
CompositeDescriptionXMSS=eXtended Merkle Signature Scheme (XMSS) 
CompositeDescriptionXMSS_MT=XMSS Multi Tree (XMSS^MT)

MerkleTreeView_0=Seed- und Schl\u00fcssel-Erzeugung
MerkleTreeView_1=MerkleTree
MerkleTreeView_2=Signierung
MerkleTreeView_3=Verifikation

MerkleTree_Generation_Info=Bitte erstellen Sie im ersten Reiter einen Seed und die Schl\u00fcsselpaare. Diese werden f\u00fcr die Darstellung des MerkleTree ben\u00f6tigt.
ZestLabelProvider_0=Blatt
ZestLabelProvider_1=Knoten
#ZestLabelProvider_2=Hash des \u00f6ffentlichen Merkle-Schl\u00fcssels
ZestLabelProvider_3=Root
TestLabelProvider_5=1
TestLabelProvider_6=0



ZestLabelProvider_5=Hash von Blatt
ZestLabelProvider_6=Hash des Knotens

MerkleTreeKey_column_0=Schl\u00fcssel Nummer
MerkleTreeKey_column_1=Privater Schl\u00fcssel
MerkleTreeKey_column_2=\u00D6ffentlicher Merkle-Schl\u00fcssel
MerkleTreeKey_Message=Die Schl\u00fcsselpaare wurden erfolgreich erzeugt!

MerkleTreeSign_0=Nachricht definieren
MerkleTreeSign_1=Dies ist ein Beispieltext!\r\nSie k\u00f6nnen dieses Feld mit beliebigen Text f\u00fcllen und ihn mit den von Ihnen erzeugten Schl\u00fcssel signieren.
MerkleTreeSign_2=Nachricht signieren
MerkleTreeSign_4=Fehler bei der Signierung, bitte erzeugen Sie den Baum erneut! (Es wurden bereits alle Bl\u00e4tter verwendet)
MerkleTreeSign_5=Bitte geben Sie eine Nachricht ein, die Sie signieren m\u00f6chten!
MerkleTreeSign_6=Signaturl\u00E4nge:
MerkleTreeSign_7=Aktueller Schl\u00fcsselindex:


MerkleTreeVerify_0=Hier steht die im Reiter "Signierung erzeugte Signatur. Diese kann nur mit dem richtigen Knoten im MerkleTree korrekt verifiziert werden. Initial wird bei der Anzeige gleich der richtige Knoten (gelb) ausgew\u00E4hlt. Sie k\u00f6nnen auch einen anderen (falschen) Knoten ausw\u00E4hlen. Damit schl\u00E4gt die Verifikation dann fehl.
MerkleTreeVerify_1=Verifizieren
MerkleTreeVerify_2=Die Verifikation der Signatur mit dem ausgew\u00E4hlten Knoten war erfolgreich!
MerkleTreeVerify_3=Die Signatur konnte nicht erfolgreich verifiziert werden!
MerkleTreeVerify_4=Bitte klicken Sie Verifizieren um den ausgew\u00E4hlten Knoten zu \u00fcberpr\u00fcfen.
MerkleTree_Signature_Generation_Info=Bitte erstellen Sie im dritten Reiter eine Signatur. Im gew\u00E4hlten Reiter kann diese dann verifiziert werden.

UnsavedChanges=Ungesicherte Änderungen! Änderungen speichern?

Tab0_Head1=Seed
Tab0_Head2=Schl\u00fcsselpaare erzeugen
Tab0_Head3=Bitmaske
Tab0_Head4=Bitmasken-Seed

Tab0_Txt3=Die Bitmaske ist einer der wesentlichen Unterschiede zum MSS-Verfahren. Sie ist ein pseudozuf\u00E4lliger bin\u00E4rer Wert und wir mit einem Pseudozufallsgenerator erzeugt. Hier können Sie den Seed f\u00fcr den Pseudozufallsgenerator erstellen.

Tab0_Button1=Neuen Seed erzeugen
Tab0_Button2=Schl\u00fcsselpaare erzeugen
Tab0_Button3=Neuen Seed f\u00fcr Bitmaske erzeugen

Tab0_Lable1=Anzahl Schl\u00fcsselpaare

