<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
	<HEAD>
		<TITLE>Zeittafel/Zeitreise durch Kryptografie und Kryptoanalyse</TITLE>
		<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
	</HEAD>
	<BODY>
	
		<h1>Zeittafel/Zeitreise durch Kryptografie und Kryptoanalyse</h1>
		<P>Diese <B>Übersicht</B> über die unterschiedlichen <B>kryptografischen</B> <B>Verfahren</B>
			ist eine Zeitreise durch die Geschichte der Kryptologie, deren Anfänge sich 
			bereits in der Antike finden und die im Laufe der Zeit eine ständige 
			Verfeinerung ihrer Methoden erlebte. Die Einträge hier sind natürlich nicht 
			vollständig.</P>
		<P>Menschliche Schrift gibt es seit rund 6000 Jahren; seit über 3000 Jahren wird 
			diese verschlüsselt.</P>
		
		<table cols="2" width="0*" class="pad20">
<tbody>
<tr valign="top">
<td>ca.&nbsp;1900&nbsp;v.&nbsp;Chr.</td>
<td>Un&#252;bliche Zeichen wurden im alten &#196;gypten verwendet.</td>
</tr>
<tr valign="top">
<td>ca. 1500 v. Chr.</td>

<td>Die f&#246;nizier entwickeln ein <strong>Alphabet</strong>.</td>
</tr>
<tr valign="top">
<td>ca. 1000 v. Chr.</td>
<td>Un&#252;bliche Zeichen wurden im alten Mesopotamien verwendet.</td>
</tr>
<tr valign="top">
<td>ca. 600 v. Chr.</td>
<td>In Pal&#228;stina werden Texte mit der einfachen monoalphabetischen            Substitutions-Chiffre <strong>Atbash</strong> verschl&#252;sselt.</td>

</tr>
<tr valign="top">
<td>ca. 500 v. Chr.</td>
<td>Spartaner (Griechenland) verschl&#252;sseln Nachrichten mit Hilfe der <strong>Skytale</strong>.</td>
</tr>
<tr valign="top">
<td>c. 400 BC</td>
<td>In der <strong>Kamasutra</strong> wird eine monoalphabetische Substitutions-Chiffre            beschrieben.</td>

</tr>
<tr valign="top">
<td>ca. 200 v. Chr.</td>
<td>Der Grieche Polybios beschreibt erstmals sein <strong>Polybios-System</strong>.</td>
</tr>
<tr valign="top">
<td>ca. 100 - 44 v. Chr.</td>
<td>Julius C&#228;sar schrieb vertrauliche Botschaften in dem nach ihm benannten <strong>Caesar-Code</strong>.            Dies ist der bekannteste aller monoalphabetischen Algorithmen.</td>

</tr>
<tr valign="top">
<td>ca. 500 - 1400 n. Chr.</td>
<td>In Europa begann die "Dunkle Zeit der Kryptografie". Kryptografie wurde der schwarzen Magie zugeordnet, so dass in dieser Zeit viel Wissen verloren ging. Im Gegensatz dazu bl&#252;hte die Kryptografie im persischen Raum auf.</td>
</tr>
<tr valign="top">
<td>855 n. Chr.</td>
<td>Im arabischen Raum erscheint das erste Buch &#252;ber Kryptologie. Abu 'Abd al-Raham al-Khahil ibn Ahmad ibn'Amr ibn Tammam al Farahidi al-Zadi al Yahamadi (Abu-Yusuf Ya&#8217;qub ibn Ishaq al-Kindi, genannt <strong>Al-Kindi</strong>) beschreibt stolz in seinem Buch unter anderem die gegl&#252;ckte Entschl&#252;sselung eines f&#252;r den byzantinischen Kaiser bestimmten griechischen Codes. Seine L&#246;sung basierte auf H&#228;ufigkeitsanalysen und auf bekanntem (korrekt geratenem) Klartext am Anfang der Nachricht &ndash; eine Standardmethode der Kryptoanalyse, die auch im 2. Weltkrieg gegen Enigma-Nachrichten angewandt wurde.</td>

</tr>
<tr valign="top">
<td>1379</td>
<td>Auf Wunsch des Papstes Clemens VII., der nach Avignon geflohen war, entwickelte sein Sekret&#228;r Gabrieli di Lavinde (Parma) einen neuartige Code, den ersten <strong>Nomenklatur-Code</strong>, eine Kombination von Substitution von Alphabetzeichen und Codeworten: Er erstellte eine Liste von gel&#228;ufigen W&#246;rtern zusammen mit zweibuchstabigen Ersetzungen. W&#246;rter, die nicht in der Liste enthalten waren, wurden durch eine monoalphabetische Substitution verschl&#252;sselt.<br /> Dieser Nomenklatur-Code wurde wegen seiner Einfachheit in den n&#228;chsten 450 Jahren vor allem in diplomatischen Kreisen verwendet.</td>
</tr>

<tr valign="top">
<td>1412</td>
<td>Eine 14-b&#228;ndige arabische Enzyklop&#228;die beschreibt auch kryptografische            Methoden. Dabei wird neben der <strong>Substitution</strong> und der <strong>Transposition</strong> erstmals die Methode der <strong>mehrmaligen Substitution</strong> an einem            Klartextzeichen erw&#228;hnt.</td>

</tr>
<tr valign="top">
<td>15. Jhdt.</td>
<td>Bl&#252;te der Kryptologie in Italien auf Grund regen diplomatischen Lebens.</td>
</tr>
<tr valign="top">
<td>1466</td>
<td>Leon Battista <strong>Alberti</strong>, einer der f&#252;hrenden Kr&#228;fte der italienischen Renaissance, ver&#246;ffentlicht sein Buch "Modus scribendi in ziferas", in dem erstmals die von ihm erfundenen Chiffrierscheiben erw&#228;hnt werden. Er ver&#246;ffentlichte ebenfalls als erster die polyalphabetische Chiffre. Alberti war Sekret&#228;r der Beh&#246;rde, die sich an der r&#246;mischen Kurie (p&#228;pstlicher Hof) mit Geheimschriften befasste. Er wird als "Vater der Kryptografie" bezeichnet.</td>

</tr>
<tr valign="top">
<td>1518</td>
<td>Im deutschsprachigen Raum erscheint das erste gedruckte Buch &#252;ber Kryptologie mit dem Titel "Polygraphia libri sex", in dem zum ersten Mal die polyalphabetischen Chiffren in der heutigen Notation als rechteckige Substitutions-Tabellen beschrieb. Der Verfasser ist der Abt Johannes <strong>Trithemius</strong>.</td>
</tr>
<tr valign="top">
<td>1563</td>
<td>Giovanni Battista <strong>Porta</strong> ver&#246;ffentlicht "De Furtivis Literarum Notis", ein Buch, das Verschl&#252;sselungsverfahren und Kryptoanalyse beschreibt. Darin beschreibt er das erste digraphische Substitutionsverfahren.</td>

</tr>
<tr valign="top">
<td>Ende 16. Jhdt.</td>
<td>Frankreich &#252;bernahm die f&#252;hrende Rolle in der Kryptoanalyse.</td>
</tr>
<tr valign="top">
<td>1577</td>
<td>Der brillante fl&#228;mische Codeknacker <strong>Van Marnix</strong> schrieb europ&#228;ische Geschichte, indem er einen spanischen Brief entschl&#252;sselte, in dem der Plan geschildert wurde, England zu erobern, indem spanische Truppen von den Niederlanden aus geschickt werden.</td>

</tr>
<tr valign="top">
<td>1585</td>
<td>Das 600-seitige Buch "Tracti&#233; de Chiffre" des franz&#246;sischen Diplomaten Blaise de Vigen&#232;re erscheint. Er erfand das erste funktionierende polyalphabetische System mit "Autoschl&#252;ssel" ("Le chiffre ind&#233;chiffrable"). Die sp&#228;ter nach ihm benannte <strong>Vigen&#232;re-Chiffre</strong> ist einfacher gehalten. Dieser Code ist der            bekannteste unter allen polyalphabetischen Algorithmen.<br /> Die Idee der Auto-Keys &#252;berlebte bis heute, z.B. in den DES-Modi CBC und CFB.</td>

</tr>
<tr valign="top">
<td>1586</td>
<td>Das <strong>Babington-Komplott</strong> versuchte, die protestantische englische K&#246;nigin            Elisabeth I. zu ermorden und die schottische K&#246;nigin <strong>Maria Stuart</strong> auf            den englischen Thron zu bringen.<br /> Die erfolgreiche Kryptoanalyse der englischen "Abwehr" brachte nicht nur den sechs Verschw&#246;rern den Tod, sondern f&#252;hrte auch zur Verurteilung von Maria Stuart.<br /> Maria kommunizierte per Brief mit ihren Anh&#228;ngern. Der &#220;berbringer der Botschaften war ein Spion der englischen K&#246;nigin, der genaue Kopien aller Briefe an Francis Walsingham, den Sicherheitsminister von Elisabeth, weiterleitete. Walsingham stellte den erfahrenen Chiffrierungsexperten Thomas <strong>Phelippes</strong> ein, um die verschl&#252;sselten Briefe zu knacken. Die erfolgreiche Entschl&#252;sselung brachte den geplanten Mord an Elisabeth ans Tageslicht. Doch Walsingham wollte zus&#228;tzlich die Namen aller Verschw&#246;rer: Dazu erg&#228;nzte Phelippes die Briefe so, dass Maria verschl&#252;sselt die Namen aller Verschw&#246;rer in die Antwort schrieb.</td>

</tr>
<tr valign="top">
<td>17. Jhdt.</td>
<td>Die &#196;ra der <strong>Schwarzen Kammern</strong> begann. Die meisten Regierungen hatten eine eigene Abteilung mit professionellen Codeknackern, die die verwendeten Nomenklatoren systematisch und industriell knackten.</td>
</tr>
<tr valign="top">
<td>1623</td>
<td>Sir Francis <strong>Bacon</strong> beschrieb eine steganographische Methode: Um eine Nachricht zu verschl&#252;sseln, wird jeder Buchstabe des Klartextes durch eine Gruppe von f&#252;nf der Buchstaben 'A' oder 'B' ersetzt, die in einen normalen Text mit einem unterschiedlichen Font eingestreut werden. Dies ist ein Vorl&#228;ufer der 5-bit Bin&#228;r-Codierung.</td>

</tr>
<tr valign="top">
<td>1628</td>
<td>Antione <strong>Rissignol</strong> wird der erste vollzeitlich angestellte Kryptoanalytiker, nachdem seine Entschl&#252;sselung einer feindlichen chiffrierten Botschaft die Belagerung Realmonts durch die Hugenotten beendete. Seitdem sind Kryptoanalytiker ein fester Bestandteil des Milit&#228;rs.</td>
</tr>
<tr valign="top">
<td>1700</td>
<td>Der russische Zar benutzt eine gro&#223;e Code-Tabelle von 2000-3000 Silben und            Worten zur Chiffrierung seiner Botschaften.</td>

</tr>
<tr valign="top">
<td>1795</td>
<td>Thomas <strong>Jefferson </strong>entwickelte den ersten Chiffrierzylinder namens "wheel cipher". Er benutzte den Zylinder aber nie, so dass er in Vergessenheit geriet bzw. nie der &#214;ffentlichkeit zug&#228;nglich wurde. Deshalb wurde der Chiffrierzylinder parallel dazu an unterschiedlichen Orten nochmals erfunden.</td>
</tr>
<tr valign="top">
<td>1854</td>
<td>Der englische Mathematikprofessor Charles <strong>Babbage </strong>erfindet einen Chiffrierzylinder, &#228;hnlich der "wheel cipher". Und er war der erste, der Vigen&#232;re's Autokey-Chiffre (die "unbreakable cipher" jener Zeit) und die schw&#228;chere (normale) Vigen&#232;re-Chiffre brach: Dies wurde erst bei der Durchsicht seines Nachlasses im 20. Jhdt. bekannt.</td>

</tr>
<tr valign="top">
<td>19. Jhdt.</td>
<td>Die Kryptologie h&#228;lt Einzug in die Literatur: A.C. Doyle, J. Verne, E.A. Poe.</td>
</tr>
<tr valign="top">
<td>1854</td>
<td>Der englische Physiker Charles <strong>Wheatstone </strong>erfindet eine Chiffre, die mit einer 5*5 Matrix arbeitet. Sein Freund Lord Lyon Playfair Baron von St. Andrews machte diese Chiffre in den milit&#228;rischen und diplomatischen Kreisen des viktorianischen Englands bekannt. Die Chiffre bekam so den Namen <strong>Playfair-Chiffre.</strong></td>

</tr>
<tr valign="top">
<td>1863</td>
<td>Friedrich <strong>Kasiski</strong> (1805-1881), ein preu&#223;ischer Infanteriemajor, entwickelte statistische Methoden zur Kryptoanalyse, die die bis dahin als unknackbar geltenden Vigen&#232;re-Chiffre entschl&#252;sselten.</td>
</tr>
<tr valign="top">
<td>1883</td>
<td>"La Cryptographie militaire" von Auguste <strong>Kerckhoffs </strong>von Nieuwendhoff erscheint. Die Abhandlung gilt als Meilenstein in der Kryptografie der Telegraphenzeit. Sie beinhaltet das "Prinzip von Kerckhoff", die Sicherheit eines Verschl&#252;sselungsverfahrens ausschlie&#223;lich auf die Geheimhaltung des Schl&#252;ssels und nicht auf die des Algorithmus zu bauen.</td>

</tr>
<tr valign="top">
<td>1891</td>
<td>Der franz&#246;sische Major Etienne <strong>Bazeries</strong> erfindet einen Chiffrierzylinder: Sein Bazeries-Zylinder war der "wheel cipher" im Prinzip &#228;hnlich. Er ver&#246;ffentlichte das Design, nachdem die franz&#246;sische Armee es abgelehnt hatte.</td>
</tr>
<tr valign="top">
<td>1917</td>

<td>Die Entschl&#252;sselung des <strong>Zimmermann-Telegramms</strong> durch den englischen Geheimdienst (Room 40) f&#252;hrt zum kriegsentscheidenden Eintritt der USA auf Seiten der Alliierten im ersten Weltkrieg.</td>
</tr>
<tr valign="top">
<td>1917</td>
<td>Der Amerikaner Gilbert S. <strong>Vernam </strong>, Mitarbeiter von AT&T, entdeckt            und entwickelt das <strong>"One-time-Pad"</strong>, das einzig nachweisbar sichere            Kryptosystem.</td>

</tr>
<tr valign="top">
<td>1918</td>
<td>Der franz&#246;sische Kryptoanalytiker, Leutenant Georges Painvin, brach die <strong>ADFGVX</strong>-Chiffre, die von den Deutschen am Ende des 1. Weltkrieges eingesetzt wurde. Diese 2-stufige Chiffre f&#252;hrte erst eine Substitution aus (jeder Buchstabe wurde durch ein Digramm mittels einer Tabelle ersetzt), dann wurden diese Digramme in Spalten aufgeteilt und die Spalten nochmal transponiert.</td>
</tr>
<tr valign="top">
<td>1918</td>
<td>Arthur Scherbius und Richard Ritter erfinden die erste <strong>Enigma</strong>. Gleichzeitig mit ihnen wurde die Rotorwalzen-Chiffriermaschine auch von Alexander Koch (Holland) und Arvid Damm (Schweden) erfunden bzw. patentiert.</td>

</tr>
<tr valign="top">
<td>1920</td>
<td>William F. <strong>Friedman</strong> (1891-1969), der Vater der US-Kryptoanalyse, entwickelte, unabh&#228;ngig von Kasiski, statistische Methoden zur Kryptoanalyse des Vigen&#232;re-Codes.</td>
</tr>
<tr valign="top">
<td>1921</td>
<td>Der Kalifornier Edward <strong>Hebern </strong>baut die erste Chiffriermaschine nach dem            Rotor-Prinzip.</td>

</tr>
<tr valign="top">
<td>1922</td>
<td>Thomas Jeffersons "wheel cipher" wird in den USA wieder entdeckt, von der US-Marine weiterentwickelt und fand so bis in den 2. Weltkrieg Anwendung.</td>
</tr>
<tr valign="top">
<td>1923</td>
<td>Vorstellung der vom deutschen Ingenieur Arthur Scherbius entwickelten            Rotormaschine <strong>Enigma</strong> auf dem internationalen Postkongress. Mit der Gr&#252;ndung der "Chiffriermaschinen AG" vermarktet Scherbius seine Enigma in alle Welt.</td>
</tr>

<tr valign="top">
<td>1929</td>
<td>Lester S. Hill ver&#246;ffentlicht den Artikel "Cryptography in an Algebraic            Alphabet". Die <strong>Hill-Chiffre</strong> verwendet Algebra (Matrizenmultiplikation)            zur Verschl&#252;sselung.</td>
</tr>
<tr valign="top">
<td>1940</td>
<td>Mikrofilmpunkte wurden von deutschen Spionen benutzt.</td>
</tr>

<tr valign="top">
<td>1940</td>
<td>Alan <strong>Turing</strong> knackt mit seiner Idee der "Bomben" die Enigma, nach            Vorarbeiten von <strong>Marian Rejewski</strong>.</td>
</tr>
<tr valign="top">
<td>1941</td>
<td>Die japanische Angriffsmeldung f&#252;r den 2. Weltkrieg wurde entschl&#252;sselt. Dieser Erfolg geht auf die Arbeit eines Teams unter der Leitung von William Frederick Friedman zur&#252;ck, das die japanische Purple-Maschine knackte.<br /> Viele Historiker meinen, dass die Kryptoanalyse im 2. Weltkrieg ein Jahr Krieg            erspart hat.</td>

</tr>
<tr valign="top">
<td>1948/1949</td>
<td>Claude <strong>Shannon</strong> legte die mathematischen Grundlagen der Informationstheorie und ver&#246;ffentlichte den Artikel "Communication Theory of Secrecy Systems", in dem er nachwies, dass alle theoretisch unbrechbaren Chiffren die gleichen Anforderungen wie das One-time-Pad erf&#252;llen m&#252;ssen.</td>
</tr>
<tr valign="top">
<td>1973</td>
<td>David Elliott Bell und Len LaPadula entwickelten das <strong>Bell-LaPadula-Modell</strong>, das die Regeln formalisiert f&#252;r den Zugriff auf klassifizierte (eingestufte) Informationen, um Vertraulichkeit zu erreichen.</td>

</tr>
<tr valign="top">
<td>1973-1975</td>
<td>Ellis, Cocks und Williamson entwickelten die Public-Key-Verschl&#252;sselung im            Auftrag der britischen Regierung (<strong>GCHQ</strong>). Diese Entdeckung wurde erst            1997 der &#214;ffentlichkeit bekannt gegeben.<br /> Da diese Verfahren nochmal unabh&#228;ngig und neu von Diffie, Hellman, Rivest, Shamir und Adleman &#246;ffentlich entwickelt wurden, galten diese als die Entdecker der Public-Key-Kryptografie.</td>
</tr>
<tr valign="top">
<td>1975</td>

<td>Diffie und Hellman zeigten, dass <strong>Public-Key-Verfahren</strong> theoretisch            m&#246;glich sind, obwohl sie das Gegenteil beweisen wollten.</td>
</tr>
<tr valign="top">
<td>1976</td>
<td>Whitfield Diffie und Martin Hellman ver&#246;ffentlichten das Paper "New Directions in Cryptography". Darin beschreiben sie eine v&#246;llig neuartige Methode, kryptografische Schl&#252;ssel zu verteilen (auszuhandeln), was eines der fundamentalen Probleme der Kryptografie adressierte (key distribution). Bekannt wurde dies als <strong>Diffie-Hellman Schl&#252;sselaustausch-Protokoll</strong>.</td>

</tr>
<tr valign="top">
<td>1977</td>
<td>Der ab 1975 von IBM entwickelte <strong>DES (Data Encryption Standard)</strong> wird vom            NIST (FIPS PUB-46) zum US-Standardverschl&#252;sselungsverfahren auserkoren.</td>
</tr>
<tr valign="top">
<td>1977</td>
<td>Das nach seinen Entwicklern Ronald Rivest, Adi Shamir und Leonard Adleman            benannte <strong>RSA-Verfahren</strong> wird ver&#246;ffentlicht. Es ist das erste praktisch einsetzbare Public-Key-Verfahren und es gilt als innovativster Beitrag der kryptologischen Forschung des 20. Jahrhunderts.</td>

</tr>
<tr valign="top">
<td>1979</td>
<td><strong>DES</strong> wird zum erstenmal in Geldausgabeautomaten eingesetzt (zur            Verschl&#252;sselung der PINs).</td>
</tr>
<tr valign="top">
<td>1982</td>
<td>Der Physiker Richard Feynman entwickelte das theoretische Modell eines <strong>Quantencomputers</strong>.</td>

</tr>
<tr valign="top">
<td>1984</td>
<td>Charles H. Bennett und Gilles Brassard beschrieben die <strong>Quantenkryptografie</strong> (BB84-Protokoll).</td>
</tr>
<tr valign="top">
<td>1985</td>
<td>Goldwasser, Micali und Racoff stellen das <strong>Zero Knowledge-Verfahren</strong> vor            (Blind Signatures).</td>

</tr>
<tr valign="top">
<td>1986</td>
<td>Unabh&#228;ngig voneinander schlagen Neal Koblitz und Victor Miller vor, <strong>Elliptische              Kurven</strong> im Bereich der Public-Key-Kryptografie einzusetzen.</td>
</tr>
<tr valign="top">
<td>1991</td>
<td>Xueija Lai und James Massey entwickeln in der Schweiz das <strong>IDEA-Verfahren</strong>,            das z.B. in der Kryptologiesoftware <strong>PGP</strong> eingesetzt wird.</td>

</tr>
<tr valign="top">
<td>1991</td>
<td><strong>DSA</strong> wird vom NIST als Standardsignaturalgorithmus auserkoren.</td>
</tr>
<tr valign="top">
<td>1991</td>
<td><strong>PGP</strong> (Pretty Good Privacy) wurde von Phil Zimmermann entwickelt und als Freeware und Open Source zur Verf&#252;gung gestellt, um Dateien hochsicher zu verschl&#252;sseln und auszutauschen. Damit wurde in einem bei Endusern auch heute noch popul&#228;ren Programm zum ersten Mal die Hybridverschl&#252;sselung (Kombination von symmetrischer und asymmetrischer Kryptografie) benutzt. Hauptanwendung war die Verschl&#252;sselung von E-Mail-Anh&#228;ngen (was sp&#228;ter vom S/MIME-Standard mit abgedeckt wurde).</td>


<!--  https://en.wikipedia.org/wiki/Clipper_chip  -->
<tr valign="top">
<td>1993</td>
<td>Der <strong>Clipper-Chip</strong> wurde von der NSA eingeführt und promoted als Hardware, um alle Sprach- und Datennachrichten zu sichern und gleichzeitig eine Hintertür bereit zu halten.</td>
</tr>


</tr>
<tr valign="top">
<td>1994</td>
<td>Peter <strong>Shor</strong> erfindet einen Algorithmus, mit dem ein Quantencomputer gro&#223;e Zahlen faktorisieren k&#246;nnte. Dies war das erste interessante Problem, wo Quantencomputer einen deutlichen Geschwindigkeitsgewinn versprachen, wodurch gro&#223;es Interesse f&#252;r Quantencomputer geweckt wurde.</td>
</tr>
<tr valign="top">
<td>08/1994</td>

<td>Das Verschl&#252;sselungsprotokoll <strong>SSL</strong> 1.0 wird von Netscape Communications ver&#246;ffentlicht &ndash; nur 9 Monate nach dem ersten Release von Mosaic 1.0, dem ersten verbreiteten Webbrowser. SSL-Verschl&#252;sselung wird heute von allen g&#228;ngigen Browsern unterst&#252;tzt. Das Transportprotokoll SSL (TLS) ist nicht auf die Anwendung HTTPS beschr&#228;nkt.</td>
</tr>
<tr valign="top">
<td>10/1995</td>
<td><strong>S/MIME</strong> 1.0, das inzwischen von allen g&#228;ngigen E-Mail-Clients unterst&#252;tzte Standardverfahren f&#252;r sichere E-Mail, wurde als RFC 1847 ver&#246;ffentlicht. S/MIME (Secure/Multipurpose Internet Mail Extensions) beschreibt, wie man sicher (signiert und/oder verschl&#252;sselt) E-Mails senden und empfangen kann, und erweiterte dazu den schon vorher benutzten popul&#228;ren MIME-Standard. S/MIME ist nicht beschr&#228;nkt auf die Verwendung bei E-Mail. <br /> S/MIME und SSL sind die am meisten verwendeten kryptografischen Protokolle im            Internet.</td>

</tr>
<tr valign="top">
<td>17.7.1998</td>
<td>EFF's DES-Cracker (<strong>Deep Crack</strong>) bricht mit einer Known-Plaintext-Attacke den DES erfolgreich in 56 Stunden (DES challenge 2 der RSA Laboratories).</td>
</tr>
<tr valign="top">
<td>19.1.1999</td>
<td>Deep Crack und <strong>distributed.net</strong> brechen zusammen mit einer Known-Plaintext-Attacke den DES in 22 Stunden und 15 Minuten (DES challenge 3 der RSA Laboratories).</td>

</tr>
<tr valign="top">
<td>10/2000</td>
<td>Als <strong>AES (Advanced Encryption Standart)</strong> wird von <strong>NIST</strong> nach einem            5-j&#228;hrigen &#246;ffentlichen Ausschreibungsverfahren der Algorithmus <strong>Rijndael</strong> zum Nachfolger von DES gew&#228;hlt.</td>

</tr>
<tr valign="top">
<td>Ab ca. 2000</td>
<td><strong>Weil Pairing</strong> wurde f&#252;r neuartige Commitment-Schemata wie IBE (identity based encryption, was sich als eher theoretisch denn praktisch interessant erwies) genutzt.</td>
</tr>

<tr valign="top">
<td>08/2004</td>
<td>Auf der <strong>Crypto 2004</strong>-Konferenz verkündeten chinesische Forscher Strukturschwächen in verbreiteten Hashfunktionen (MD5, SHA), die sie gegen <strong>Kollisionsangriffe</strong> anfällig machen. Diese Hashverfahren fanden damals in den meisten kryptografischen Protokollen noch Verwendung.</td>

</tr>
<tr valign="top">
<td>05/2005</td>
<td><strong>Jens Franke</strong> et al. faktorisierten die 663 bit lange Zahl RSA-200.</td>
</tr>
<tr>
<td valign="top">04/2007<br /></td>
<td valign="top">Das WLAN-Verschl&#252;sselungsprotokoll <strong>WEP</strong> wird von drei Forschern der <strong>TU-Darmstadt </strong>gebrochen. Bei entsprechend hohem Datenverkehr ist es m&#246;glich, innerhalb von ca. zwei Minuten 95% der eingesetzten Schl&#252;ssel zu knacken.</td>

</tr>
<tr>
<td valign="top">08/2007<br /></td>
<td valign="top">Auf der <strong>Crypto 2007</strong>-Konferenz wurde ein Verfahren zum Brechen der in vielen Fahrzeugen genutzen <strong>Wegfahrsperren</strong>-Chips vorgestellt. Es wurde gezeigt, wie innerhalb von 48 Stunden mit 50 parallel geschalteten PCs ein Wegfahrschlüssel dupliziert werden konnte.</td>
</tr>
<tr>
<td valign="top">08/2007<br /></td>
<td valign="top">Der von vielen GSM-Netzbetreibern genutzte proprietäre Verschlüsselungsalgorithmus <strong>A5/1</strong> wurde von David Hulton und Joshua Lackey gebrochen. Damit konnten bei den betroffenen Handynetzen selbst kürzeste Gespräche oder SMSe leicht entschlüsselt werden. Dies ist ein gutes Beispiel dafür, dass das Konzept "Security-by-Obscurity" in der Regel nicht funktioniert.</td>

</tr>
<tr>
<td valign="top">12/2007<br /></td>
<td valign="top">Das Authentifikationsverfahren von <strong>Mifare-Chipkarten</strong>, das in Tausenden von Anwendungen mit einer Milliarde ausgegebener Karten benutzt wurde, wurde gebrochen. Die neueste Generation (Mifare DESFire), welche auf DES/3-DES basiert, war hiervon jedoch nicht betroffen.</td>
</tr>


<!--
https://en.wikipedia.org/wiki/Secure_multi-party_computation
-->
<tr>
<td valign="top">2008</td>
<td valign="top">Die erste große und praktische Anwendung von <strong>Multi-Party-Computation</strong> fand in Dänemark statt (bei einer tatsächlichen Auktion).</td>
</tr>


<tr>
<td valign="top">12/2009<br /></td>
<td valign="top">Chris Paget und Karsten Nohl gaben bekannt, dass das <strong>A5/1</strong> Cracking Project 2 Terabyte große Time-Memory Tradeoff-Tabellen für A5/1 erstellte. A5/1 war damit gebrochen.</td>
</tr>

<tr>
<td valign="top">12/2009</td>
<td valign="top">Jens Franke et al. faktorisierten die 768 bit lange Zahl <strong>RSA-768</strong>.</td>
</tr>


<!--
https://en.wikipedia.org/wiki/Homomorphic_encryption
-->
<tr>
<td valign="top">2009<br /></td>
<td valign="top">Craig Gentry beschrieb mit Hilfe von Gitter-basierter Kryptografie  die erste überzeugende Konstruktion eines 'fully homomorphic encryption'-Verfahrens (HE). <strong>Homomorphe Verschlüsselung</strong> erlaubt es, Berechnungen auf verschlüsselten Daten vorzunehmen, ohne sie vorher zu entschlüsseln.</td>
</tr>

<tr>
<td valign="top"> 2012<br /></td>
<td valign="top">NIST wählte den Keccak-Algorithmus zum Gewinner des <strong>SHA-3</strong>-Hashfunktion-Wettbewerbs.</td>
</tr>

<tr>
<td valign="top"> 2013<br /></td>
<td valign="top">Es wurde bekannt, dass der <strong>Dual_EC_DRBG</strong> eine Hintertür für die NSA enthält.</td>
</tr>

<!--
https://en.wikipedia.org/wiki/NIST_Post-Quantum_Cryptography_Competition
https://en.wikipedia.org/wiki/Post-quantum_cryptography
-->
<tr>
<td valign="top"> 2016<br /></td>
<td valign="top">NIST kündigten ein Programm und einen Wettbewerb an, um Post-Quantum-Kryptografie zu standardisieren. <strong>Post-Quantum-Kryptografie</strong> (auch als Quantencomputer-resistente Kryptografie bezeichnet) meint kryptografische Algorithmen, von denen man annimmt, dass sie Angriffen mit einem Quantencomputer standhalten.</td>
</tr>

<tr>
<td valign="top"> 2/2020<br /></td>
<td valign="top">F. Boudot, P. Gaudry, A. Guillevic, N. Heninger, E. Thomé und P. Zimmermann faktorisierten die 829 bit lange Zahl <strong>RSA-250</strong>.</td>
</tr>



<tr>
<td valign="top">...</td>
<td valign="top">...</td>
</tr>


</tbody>
</table>

<P>Weitere Übersichten zur Geschichte der Kryptologie finden sich z.B. unter den 
folgenden Links:</P>

<ul>
<li><a target="_blank" href="http://regenechsen.de/wp/kryptologie/02-02-zeittafel/">Zeittafel der Kryptologie</a></li>
<li><a target="_blank" href="http://www.tronland.net/cryptron/jvk.htm">Jenseits von Kahn &ndash; Die verborgene Geschichte der Codebrecher</a></li>
<li><a target="_blank" href="http://cs-exhibitions.uni-klu.ac.at/index.php?id=192">The History of Cryptography (von der Virtual Exhibitions in Informatics-Seite der Universität Klagenfurth)</a></li>
<li><a target="_blank" href="http://jproc.ca/crypto/crypto_hist.html">A short history of crypto from the Crypto Machines Home page</a></li>
<li><a target="_blank" href="http://users.telenet.be/d.rijmenants/en/timeline.htm">Cipher Machines Timeline</a></li>
<li><a target="_blank" href="http://en.wikipedia.org/wiki/Timeline_of_cryptography">Wikipedia Timeline of cryptography</a></li>
</ul>


<p><br></p>
</BODY>
</HTML>
