#Eclipse modern messages class
#Sun Jan 04 16:41:57 CET 2015
MerkleHellmanView_0=Merkle-Hellman ist ein asymmetrisches Kryptosystem, das auf dem Rucksack-Problem basiert. Um den Algorithmus zu starten, w\u00E4hlen Sie bitte die Anzahl der Elemente f\u00FCr den privaten Schl\u00FCssel und einen Startwert. Ein privater Schl\u00FCssel A wird automatisch zuf\u00E4llig erzeugt. Wenn Sie einen anderen privaten Schl\u00FCssel verwenden wollen, k\u00F6nnen Sie die Werte entweder direkt \u00E4ndern oder Sie klicken auf den Button "Erzeuge privaten Schl\u00FCssel". Danach ist der \u00F6ffentliche Schl\u00FCssel zu generieren\: Dr\u00FCcken Sie dazu auf den Button "Erzeuge \u00F6ffentlichen Schl\u00FCssel".
MerkleHellmanView_00=Um eine Nachricht m zu verschl\u00FCsseln, geben Sie eine nat\u00FCrliche Zahl f\u00FCr m ein und klicken Sie auf den Button "Verschl\u00FCsseln". Jedes Bit im \u00F6ffentlichen Schl\u00FCssel, das einer 1 in der bin\u00E4ren Darstellung des Klartextes entspricht, flie\u00DFt in den Geheimtext c ein (die Bits, die einer 0 entsprechen, werden bei der Konstruktion von c ignoriert). Diese Bits im \u00F6ffentlichen Schl\u00FCssel werden addiert. Die resultierende Summe ist der Geheimtext c \:\= Sum( m(i) * B (i) mod M ).
MerkleHellmanView_000=Um den Geheimtext c zu entschl\u00FCsseln, berechnen wir zuerst c' \= c * U mod M. Nun w\u00E4hlen wir das gr\u00F6\u00DFte Element des privaten Schl\u00FCssels A(i). Falls c' < A(i) ist, dann ist m(i) \= 0; falls c' >\= A(i) ist, dann ist m(i) \= 1. Danach subtrahieren wir A(i) * m(i) von c' so lange, bis die Differenz 0 ist. Falls die Differenz nicht 0 wird, dann wurde versucht, den Geheimtext mit einem falschen Schl\u00FCssel zu entschl\u00FCsseln.
MerkleHellmanView_0000=Merkle-Hellman Rucksack-Verschl\u00FCsselung\r\n
MerkleHellmanView_1=Schl\u00FCsselerzeugung
MerkleHellmanView_10=Bin\u00E4rdarstellung von m\:
MerkleHellmanView_11=Iteration
MerkleHellmanView_12=Gleichung
MerkleHellmanView_13=Verschl\u00FCsseln
MerkleHellmanView_14=Entschl\u00FCsselung
MerkleHellmanView_15=Iteration
MerkleHellmanView_16=Gleichung
MerkleHellmanView_17=Entschl\u00FCsseln
MerkleHellmanView_18=Ergebnis
MerkleHellmanView_19=Die Entschl\u00FCsselung f\u00FChrte zum gleichen Ergebnis wie der urspr\u00FCngliche Klartext.\nDie Bitfolgen sind identisch.\r\n
MerkleHellmanView_2=Anzahl der Elemente (|A|) des privaten Schl\u00FCssels A\:
MerkleHellmanView_20=Der Modul M muss gr\u00F6\u00DFer sein als 
MerkleHellmanView_21=\nBitte geben Sie einen anderen Wert f\u00FCr M ein.
MerkleHellmanView_22a=Der Multiplikator W \= 
MerkleHellmanView_22b=muss kleiner sein als der Modul M \= 
MerkleHellmanView_23=\nBitte geben Sie einen anderen Wert f\u00FCr W oder M ein.
MerkleHellmanView_24=\nDer Modul M und der Multiplikator W sind nicht teilerfremd: 
MerkleHellmanView_24a=\nBitte w\u00E4hlen Sie andere Werte.
MerkleHellmanView_25=Der Modul M mu\u00DF gr\u00F6\u00DFer sein als 
MerkleHellmanView_26=\nBitte geben Sie einen anderen Wert f\u00FCr M ein.
MerkleHellmanView_27=Der Multiplikator W muss kleiner sein als der Modul M \= 
MerkleHellmanView_28=\nBitte geben Sie einen anderen Wert f\u00FCr W oder M ein. 
MerkleHellmanView_29=Der Modul M und der Multiplikator W sind nicht teilerfremd: ggT(M,W) \= 
MerkleHellmanView_3=Startwert (f\u00FCr die Wahl des ersten Elements des privaten Schl\u00FCssels A)\:
MerkleHellmanView_30=Die Entschl\u00FCsselung f\u00FChrte leider nicht zum gleichen Ergebnis wie der urspr\u00FCngliche Klartext.\nDie Bitfolgen sind nicht identisch.\r\n
MerkleHellmanView_31=ggT (M,W) \= 1 und 1 <\= W < M
MerkleHellmanView_32=ggT(M,W) \= 
MerkleHellmanView_33=Gr\u00F6\u00DFte gemeinsame Teiler
MerkleHellmanView_34=\nBitte w\u00E4hlen Sie andere Werte.
MerkleHellmanView_35=Warnung
MerkleHellmanView_36=Frage
MerkleHellmanView_37=M\u00F6chten Sie die eingegebenen Werte f\u00FCr den privaten Schl\u00FCssel \u00FCbernehmen?\nDer eingegebene private Schl\u00FCssel ist nicht stark wachsend.
MerkleHellmanView_4=Erzeuge privaten Schl\u00FCssel
MerkleHellmanView_5=Privater Schl\u00FCssel A
MerkleHellmanView_6=\u00D6ffentlicher Schl\u00FCssel B\: B(i) \= A(i) * W mod M, 1 <\= i < 
MerkleHellmanView_7=Erzeuge \u00F6ffentlichen Schl\u00FCssel
MerkleHellmanView_8=\u00D6ffentlicher Schl\u00FCssel B
MerkleHellmanView_9=Verschl\u00FCsselung
MerkleHellmanView_lblBinaryRepresentationOf_text=Bin\u00E4rdarstellung von c\:
