MerkleHellmanView_0=Merkle Hellman\r\nDer Merkle-Hellman ist ein asymmetrisches Kryptosystem, das auf dem Rucksack-Problem basiert. Um den Algorithmus zu starten w\u00E4hlen Sie bitte die Anzahl der Elemente f\u00FCr den privaten Schl\u00FCssel und einem Startwert. Der private Schl\u00FCssel wird zuf\u00E4llig erzeugt. Wenn Sie eine andere private Schl\u00FCssel wollen, k\u00F6nnen Sie die Werte \u00E4ndern oder klicken Sie einfach auf den Button Generieren privaten Schl\u00FCssel. Danach k\u00F6nnen Sie den Public Key erzeugen, indem Sie auf den Button Erzeuge den Public Key zu erstellen.
MerkleHellmanView_00=Merkle Hellman\r\nUm eine Nachricht p zu verschl\u00FCsseln geben Sie einen Wert f\u00FCr p ein und klicken Sie auf den Button Verschl\u00FCsseln. Jedes Bit in dem \u00F6ffentlichen Schl\u00FCssel, der einer 1 in der bin\u00E4ren Darstellung des Klartextes entspricht, ist ein Element des Chiffretexts c, die Bits, die einer 0 entsprechen werden in der Konstruktion von c ignoriert. Diese Elemente der Bits werden addiert und die resultierende Summe des Chiffretexts ist c := Sum( p(i) ∑ B (i) mod M ).
MerkleHellmanView_000=Merkle Hellman\r\nUm den Geheimtext c zu entschl\u00FCsseln, berechnen wir zuerst c' = c * U mod M. Nun w\u00E4hlen wir das gr\u00F6ﬂte Element des privaten Schl\u00FCssels A(i). Falls c' < A(i) ist, dann ist p(i) = 0, falls c' >= A(i) ist, dann ist p(i) = 1. Danach subtrahieren wir A(i) * p(i) von c' bis die Differenz 0 ist. Falls die Differenz nicht 0 ist, dann wurde versucht, den Text mit einem falschen Schl\u00FCssel zu entschl\u00FCsseln.
MerkleHellmanView_1=Schl\u00FCsselerzeugung
MerkleHellmanView_10=Bin\u00E4rdarstellung von p\:
MerkleHellmanView_11=Iteration
MerkleHellmanView_12=Gleichung
MerkleHellmanView_13=Verschl\u00FCsseln
MerkleHellmanView_14=Entschl\u00FCsselung
MerkleHellmanView_15=Iteration
MerkleHellmanView_16=Gleichung
MerkleHellmanView_17=Entschl\u00FCsseln
MerkleHellmanView_18=Ergebnis
MerkleHellmanView_19=Die Bitfolgen sind identisch.\r\n
MerkleHellmanView_2=W\u00E4hle die Anzahl der Elemente (|A|) f\u00FCr den Private key A\:
MerkleHellmanView_20=M muﬂ gr\u00F6ﬂer sein als 
MerkleHellmanView_21=\nBitte gebe einen anderen Wert f\u00FCr M ein.
MerkleHellmanView_22=W muﬂ kleiner sein als M = 
MerkleHellmanView_23=\nBitte gebe einen anderen Wert f\u00FCr W ein.
MerkleHellmanView_24=\nM und W sind nicht teilerfremd.\nBitte w\u00E4hle andere Werte.
MerkleHellmanView_25=M muﬂ gr\u00F6ﬂer sein als 
MerkleHellmanView_26=\nBitte gebe einen anderen Wert f\u00FCr M ein.
MerkleHellmanView_27=W muﬂ kleiner sein als M = 
MerkleHellmanView_28=\nBitte gebe einen anderen Wert f\u00FCr W ein.
MerkleHellmanView_29=\nM und W sind nicht teilerfremd.\nBitte w\u00E4hle andere Werte.
MerkleHellmanView_3=W\u00E4hle einen Startwert\:
MerkleHellmanView_30=Die Bitfolgen sind nicht gleich.\r\n
MerkleHellmanView_4=Erzeuge den Private Key
MerkleHellmanView_5=Private Key A
MerkleHellmanView_6=Public Key B\: B(i) \= A(i) * W mod M, 1 <\= i < 
MerkleHellmanView_7=Erzeuge den Public Key
MerkleHellmanView_8=Public Key B
MerkleHellmanView_9=Verschl\u00FCsselung
