#Eclipse modern messages class
#Mon Jan 23 20:25:50 CET 2012
KeyViewer_cryptoversion=Version f\u00fcr kryptographische Verwendung - z. B. zur Entschl\u00fcsselung, etc.
KeyViewer_invertback=Den Schl\u00fcssel zur\u00fcck-invertieren (Ausgangszustand)
KeyViewer_invertdescription=Den Schl\u00fcssel invertieren (Der inverse Schl\u00fcssel ist das exakte Gegenst\u00fcck zum Original. Eine aufeinanderfolgende Verschl\u00fcsselung mit dem Schl\u00fcssel und dann mit dem Inversen des Schl\u00fcssels resultiert im Ausgangstext.)
KeyViewer_invertone=Invertieren
KeyViewer_prettyversion="H\u00fcbsche Version" - f\u00fcrs Kopieren in Text, o. \u00e4.
ReadDirectionChooser_0=Spaltenweise
ReadDirectionChooser_1=Zeilenweise
TranspAnalysisUI_Export=Export
TranspAnalysisUI_Results=Ergebnisse
TranspAnalysisUI_btnCheckButton_text=Die gew\u00e4hlte Texttransformation anwenden (%s)
TranspAnalysisUI_btnOpenTextWizard_text=Text laden
TranspAnalysisUI_description=Das Plug-in hilft bei der Entzifferung eines Geheimtextes, welcher mit dem einfachen Transpositionsverfahren verschlüsselt wurde.
TranspAnalysisUI_decipher=Den aktuellen Vorschau-Text in einen neuen Editor schreiben
TranspAnalysisUI_grpEditText=Bearbeiten des eingelesenen Textes durch das Festlegen der Spaltenzahl und Umordnung der Spalten
TranspAnalysisUI_keyfound=Transpositionsschl\u00fcssel (entspricht Spaltenanordnung):
TranspAnalysisUI_keypreview_zerocolumns=[Kann nur mit einer Spaltenanzahl > 0 ermittelt werden]
TranspAnalysisUI_keyviewer=Schl\u00fcssel
TranspAnalysisUI_lbl_params_mask=\n- Einleserichtung des Textes in die Transpositionstabelle: %s\n- Ausleserichtung des Textes in der Transpositionstabelle: %s\n- Alphabet: "Printable ASCII"
TranspAnalysisUI_lblChooseAnotherText=<a>(einen anderen Text laden)</a>
TranspAnalysisUI_lblColumnCount_text_1=Spaltenanzahl\:
TranspAnalysisUI_lblTheseTextSettings_text=Diese Text-Einstellungen zeigen an, dass bei der Verschl\u00fcsselung Spaltenweises Ein- oder Auslesen benutzt wurde, und dass die letzte Zeile der Transpositionstabelle dabei nicht mit Platzhaltern aufgef\u00fcllt wurde. Aufgrund dessen ist es _vielleicht_ nicht m\u00f6glich, mit diesem Plug-in den Text zu knacken.\nW\u00e4hlen Sie andere Einstellungen, falls Sie nicht sicher sind, dass die aktuellen richtig sind. 
TranspAnalysisUI_lblHoweverTheColumn_text=Hierzu ben\u00f6tigen Sie zuerst die richtige Spaltenanzahl. Um die richtige Kombination (aus Spaltenanordnung und Spaltenanzahl) zu finden, beginnen Sie mit dem Umordnen der Spalten nur hinsichtlich der ersten Zeile. Wenn die anderen Zeilen hierbei nie etwas Sinnvolles ergeben, stellen Sie eine andere Spaltenanzahl ein, und versuchen Sie es erneut.
TranspAnalysisUI_lblLoadedTextwith_text=Eingelesener Text (mit verschiebbaren Spalten):
TranspAnalysisUI_lblNewLabel_1_text=Parameter des Verfahrens\:
TranspAnalysisUI_lblReadinmode=Einleserichtung des gew\u00e4hlten Textes in die Tabelle: 
TranspAnalysisUI_view_description=<a>Hier k\u00f6nnen Sie von Hand die Analyse durchf\u00fchren, um einen mit der einfachen Spalten-Transposition verschl\u00fcsselten Geheimtext zu knacken.</a>
TranspAnalysisUI_lblTryToRecover_text=Versuchen Sie, den Klartext durch Umordnen der Tabellenspalten wiederherzustellen.
TranspAnalysisUI_lblYouHaveSelected_text=Ihr Eingabetext\:
TranspAnalysisUI_link_text=<a>Schl\u00fcssel manuell eingeben</a>
TranspAnalysisUI_preview=Vorschau (entschl\u00fcsselter Text):
TranspAnalysisUI_read_out_mode_label=Ausleserichtung des Textes aus der Tabelle:
TranspAnalysisUI_tooltipParams=Die Einlese-/Ausleserichtungs-Parameter sind in der Form angegeben, wie sie \nim Assistenten der Transpositionsverschl\u00fcsselung im JCrypTool angegeben werden m\u00fcssen: aus Verschl\u00fcsselungssicht. \nDie Einleserichtung f\u00fcr die Maske im Assistenten ist die Ausleserichtung \nin dieser Analyse, und andersherum, da diese Analyse aus der Entschl\u00fcsselungsperspektive blickt.
TranspAnalysisUI_view_title=Transpositions-Analyse
