PluginBtnListener_check_sig_arch_path=icons/minica_check.jpg
PluginBtnListener_create_cert_arch_path=icons/minica_create_cert.jpg
PluginBtnListener_rev_cert_arch_path=icons/minica_revoke.jpg
PluginBtnListener_strcmp_check_sig=Signatur \u00fcberpr\u00fcfen
PluginBtnListener_strcmp_continue=Weiter zum Plugin
PluginBtnListener_strcmp_create_cert=Zertifikat erzeugen
PluginBtnListener_strcmp_rev_cert=Zertifikat widerrufen
SideBarListener_strcmp_get_cert=Neues Zertifikat anfordern
SideBarListener_strcmp_manage_cert=Zertifikate verwalten
SideBarListener_strcmp_rev_cert=Zertifikat widerrufen
SideBarListener_strcmp_sign_data=Text oder Datei signieren
TabItemListener_exp_txt_ca_tab0=Die "Certification Authority" (CA) hat zwei Aufgaben in einer PKI: Einerseits bearbeitet sie von der RA verifizierte Zertifikatsanfragen und stellt darin beantragte Zertifikate aus. Andererseits unterh\u00e4lt sie eine "Certificate Revocation List" (CRL). M\u00f6chte der Zertifikatsbesitzer, dass sein Zertifikat nicht l\u00e4nger g\u00fcltig ist, so f\u00fcgt die CA das betroffenen Zertifikat dieser CRL hinzu. Der Zertifikatswiderruf, m\u00f6gliche Gr\u00fcnde und seine Auswirkungen werden in der Ansicht "Benutzer" genauer behandelt. Die CA muss lediglich daf\u00fcr sorgen, Widerrufsanfragen zeitnahe zu bearbeiten und die CRL auf dem neuesten Stand zu halten.\n
TabItemListener_exp_txt_ca_tab1=\u00c4hnlich zum CSR ist das Format der CRL im X.509 Standard festgeschrieben. Mehr dazu lesen Sie in der Onlinehilfe.\n\n
TabItemListener_exp_txt_ca_tab2=Linkerhand finden Sie eine Liste an Zertifikatsanfragen (CSRs, von engl. "Certificate Signing Request") und Widerrufsanfragen (RRs, von engl. "Revocation Request"). Wenn Sie eine Zertifikatsanfrage annehmen, so wird dem Antragsteller ein Zertifikat ausgestellt. Sie k\u00f6nnen dieses dann in der Benutzer-Ansicht einsehen und verwenden. Wenn Sie eine Widerrufsanfrage annehmen, so wird das betroffene Zertifikat der CRL hinzugef\u00fcgt.\n
TabItemListener_exp_txt_ca_tab3=Mehr zu den technischen Hintergr\u00fcnden von Zertifikatsausstellung und CRLs lesen Sie in der Onlinehilfe.
TabItemListener_exp_txt_ra_tab0=Die "Registration Authority" (RA) ist die Entit\u00e4t einer PKI, die daf\u00fcr zust\u00e4ndig ist, festzustellen, ob Zertifikatsanfragen authentisch sind oder nicht. Im Zusammenhang mit einem pers\u00f6nlichen Zertifikat wie in diesem Fall bedeutet das, dass der Antragsteller auch wirklich die Person ist, f\u00fcr die das Zertifikat beantragt wird.\n\n
TabItemListener_exp_txt_ra_tab1=Linkerhand finden Sie eine Liste von Zertifikatsanfragen. Darunter befinden sich die Anfragen, die Sie selbst in der Ansicht "Benutzer" erstellt haben. Mittels "Identit\u00e4t verifizieren" k\u00f6nnen Sie diese als korrekt erkl\u00e4ren und an die CA weiterleiten. Doch vorsicht, es befinden sich auch Anfragen darunter, die nicht mit den jeweiligen Ausweisen \u00fcbereinstimmen. Achten Sie darauf, keine dieser Anfragen an die CA weiterzuleiten\!\n\n
TabItemListener_exp_txt_ra_tab2=Die T\u00e4tigkeit der RA ist f\u00fcr das Funktionieren einer PKI absolut entscheidend. Nur durch die ausf\u00fchrliche und korrekte Pr\u00fcfung der RA kann verhindert werden, dass sich etwa Personen mit kriminellen Absichten als andere Personen ausgeben k\u00f6nnen. Es ist also f\u00fcr jeden PKI-Betreiber notwendig, hier gr\u00f6ﬂte Vorsicht und Genauigkeit walten zu lassen. Mehr \u00fcber die T\u00e4tigkeit einer RA und zu verschiedenen Verfahren, die von PKI-Betreibern in der realen Welt angewandt werden, um die Identit\u00e4t eines Antragstellers sicherzustellen, finden Sie in der Onlinehilfe.
TabItemListener_exp_txt_sec_user_tab0=In dieser Ansicht haben Sie die M\u00f6glichkeit, die von Ihnen in der Ansicht "Benutzer" erstellen Signaturen zu \u00fcberpr\u00fcfen.\n
TabItemListener_exp_txt_sec_user_tab1=Linkerhand k\u00f6nnen Sie Texte oder Dateien ausw\u00e4hlen, f\u00fcr die Sie in der Ansicht "Benutzer" Signaturen erstellt haben. Der Text oder Dateiname wird anschlieﬂend zusammen mit der dazugeh\u00f6rigen Signatur angezeigt. Mittels "Signatur \u00fcberpr\u00fcfen" k\u00f6nnen Sie pr\u00fcfen, ob diese Signatur g\u00fcltig und vertrauensw\u00fcrdig ist.\n
TabItemListener_exp_txt_sec_user_tab2=Achten Sie aber darauf, dass standardm\u00e4ﬂig nicht gepr\u00fcft wird, ob das Zertifikat, mit dem Sie diese Signatur pr\u00fcfen, widerrufen wurde. Das ist hier so, weil auch viele Anwendungen (wie E-Mail-Clients oder Webbrowsern) standardm\u00e4ﬂig nicht \u00fcberpr\u00fcfen, ob ein Zertifikat widerrufen wurde. Dies muss oft vom Benutzer selbst eingestellt werden.\n
TabItemListener_exp_txt_sec_user_tab3=Beachten Sie auﬂerdem, dass Signaturen, die erstellt wurden, bevor das Zertifikat widerrufen wurde, ihre G\u00fcltigkeit behalten. Ein Widerruf hat nur zur Folge, dass keine weiteren g\u00fcltigen Signaturen mehr erstellt werden k\u00f6nnen. Mehr \u00fcber den Widerruf von Zertifikaten und technische Hintergr\u00fcnde zur Signaturpr\u00fcfung lesen Sie in der Onlinehilfe.
TabItemListener_exp_txt_user_tab0=In der Ansicht "Benutzer" haben Sie die M\u00f6glichkeit, ein neues Zertifikat anzufordern, Ihre bereits ausgestellten Zertifikate zu verwalten sowie Texte oder Dateien mit dem zu einem Ihrer ausgestellten Zertifikate geh\u00f6rigen privaten Schl\u00fcssel zu signieren.\n\n
TabItemListener_exp_txt_user_tab1=W\u00e4hlen Sie eine der Aktionen aus, um fortzufahren und weitere Informationen dazu zu erhalten.\nWenn Sie dieses Plugin zum ersten Mal ausf\u00fchren, empfiehlt es sich, mit "Neues Zertifikat anfordern" zu beginnen.
