CAListener_msgbox_text_cert_created=Gratuliere, Sie haben ein Zertifikat erstellt. Dieses finden Sie nun in der Ansicht "Benutzer" unter "Eigene Zertifikate verwalten."
CAListener_msgbox_text_cert_not_created=Sie haben den CSR abgelehnt. Wechseln Sie bitte in die Ansicht "Benutzer" um erneut einen CSR zu erstellen.
CAListener_msgbox_text_cert_not_revoked=Das Zertifikat wurde nicht widerrufen.
CAListener_msgbox_text_cert_revoked=Sie haben erfolgreich Ihr Zertifikat widerrufen.
CAListener_msgbox_title_cert_created=Zertifikat erstellt
CAListener_msgbox_title_cert_revoked=Zertifikat widerrufen
CAListener_msgbox_title_cert_not_created=Zertifikat nicht erstellt
CAListener_msgbox_title_cert_not_revoked=Zertifikat nicht widerrufen
CreateCertListener_msgbox_text_csr_to_ca=Ihr CSR wurde an die RA weitergeleitet. Damit sind Sie in der Ansicht "Benutzer" zun\u00E4chst einmal fertig. Bitte wechseln Sie in die Ansicht "Registration Authority."
CreateCertListener_msgbox_text_not_all_fields_set=Bitte f\u00FCllen Sie alle Felder aus.
CreateCertListener_msgbox_title_csr_to_ca=CSR abgeschickt
CreateCertListener_msgbox_title_not_all_fields_set=Leeres Feld\!
CSRListener_msgbox_text_csr_rejected=Sie haben den CSR abgelehnt. Wechseln Sie bitte in die Ansicht "Benutzer" um erneut einen CSR zu erstellen.
CSRListener_msgbox_text_csr_to_ca_sent=Der CSR wurde an die Certification Authority weitergeleitet. Damit sind Sie in der Ansicht "Registration Authority" zun\u00E4chst fertig. Bitte wechseln Sie in die Ansicht "Certification Authority".
CSRListener_msgbox_text_fake_csr_rejected=Sehr gut\! Dieser CSR war gef\u00E4lscht. Sie haben ihn abgelehnt und dadurch verhindert, dass sich diese Person als eine andere ausgeben k\u00F6nnte.
CSRListener_msgbox_text_fake_csr_to_ca_sent=Sie h\u00E4tten gerade einen gef\u00E4lschten CSR weitergeleitet und dem Antragsteller somit erm\u00F6glicht, sich als eine andere Person auszugeben. Das darf einem echten PKI-Betreiber nicht passieren\!
CSRListener_msgbox_title_csr_rejected=CSR abgelehnt
CSRListener_msgbox_title_csr_to_ca_sent=CSR weitergeleitet
CSRListener_msgbox_title_fake_csr_rejected=Gratulation\!
CSRListener_msgbox_title_fake_csr_sent_to_ca=Vorsicht\!
PluginBtnListener_archpic_check_explain=Will der Empf\u00E4nger signierter Daten (in diesem Beispiel einer E-Mail) die Authentizit\u00E4t dieser pr\u00FCfen, so muss daf\u00FCr im Groben zwei Schritte durchf\u00FChren. Zun\u00E4chst muss er \u00FCberpr\u00FCft, ob die Signatur der E-Mail tats\u00E4chlich von dem privaten Schl\u00FCssel stammt, der zum Zertifikat des Empf\u00E4ngers geh\u00F6rt. Anschlie\u00DFend muss er die CRL der ausstellenden CA anfordern und pr\u00FCfen, ob das Zertifikat vom Inhaber widerrufen wurde. Befindet sich das Zertifikat auf der CRL, so ist die Signatur nur dann g\u00FCltig, wenn das Datum der Signatur vor dem Datum des Widerrufs liegt.
PluginBtnListener_archpic_create_explain=M\u00F6chte ein Benutzer beweisen, dass ein \u00F6ffentlicher Schl\u00FCssel tats\u00E4chlich zu einem privaten Schl\u00FCssel in seinem Besitz geh\u00F6rt, kann er sich ein Zertifikat ausstellen lassen. Dazu erstellt der Benutzer einen "Certificate Signing Request" (CSR) f\u00FCr seinen \u00F6ffentlichen Schl\u00FCssel und leitet diesen zusammen mit einem Identit\u00E4tsnachweis (beispielsweise einer Ausweiskopie) an eine "Registration Authority" (RA) weiter. Die RA \u00FCberpr\u00FCft, ob es sich beim Antragsteller auch tats\u00E4chlich um die Person handelt, f\u00FCr die das Zertifikat ausgestellt werden soll. Wenn dies der Fall ist, leitet sie den CSR an die "Certification Authority" (CA) weiter. Die CA f\u00FCgt dem CSR dann ihre eigene Signatur hinzu, wodurch der CSR zu einem von dieser CA ausgestellten Zertifikat wird. Das Zertifikat geht zur\u00FCck an den Antragsteller. Die RA, die CA und die damit verbundenen Prozesse werden auch als "Public-Key-Infrastruktur" (PKI) bezeichnet.
PluginBtnListener_archpic_revoke_explain=Es gibt mehrere Gr\u00FCnde, warum ein Zertifikat widerrufen werden muss, noch bevor es seine G\u00FCltigkeitsdauer \u00FCberschritten hat. Diese Gr\u00FCnde k\u00F6nnen Sie im Detail in der Onlinehilfe nachlesen. Will der Zertifikatsinhaber sein Zertifikat widerrufen, so muss er daf\u00FCr einen "Revocation Request" (RR) erstellen. Dieser RR geht \u00E4hnlich wie ein CSR zun\u00E4chst an die RA zur Pr\u00FCfung. Erkl\u00E4rt die RA diesen Request als authentisch, so wird er an die CA weitergeleitet. Die CA verwaltet eine "Certificate Revocation List" (CRL), also eine Liste aller Zertifikate, die von ihr ausgestellt wurden und ihr G\u00FCltigkeitsdatum noch nicht \u00FCberschritten haben, aber vom Zertifikatsinhaber als ung\u00FCltig erkl\u00E4rt wurden. Wenn eine CA einen RR erh\u00E4lt, so f\u00FCgt sie das betroffene Zertifikat dieser CRL hinzu.
PluginBtnListener_visual_intro_text=Dieses Plugin stellt die grundlegende Funktionsweise einer Public-Key-Infrastruktur (PKI) dar. Sie k\u00F6nnen ein Schl\u00FCsselpaar und eine dazugeh\u00F6rige Zertifikatsanfrage erstellen. Anschlie\u00DFend k\u00F6nnen Sie verfolgen, welche Stationen Ihre Anfrage durch die verschiedenen Teile der PKI durchl\u00E4uft. Nach Ausstellung eines Zertifikats haben Sie die M\u00F6glichkeit, Signaturen zu erstellen und zu \u00FCberpr\u00FCfen. Jeder Schritt wird von Erkl\u00E4rungstexten begleitet. Ausf\u00FChrliche Hintergrundinformationen zu PKIs finden Sie zus\u00e4tzlich in der Onlinehilfe.
SecondUserListener_msgbox_text_badsig=Die Signatur ist nicht korrekt.
SecondUserListener_msgbox_text_revoked=Die Signatur wurde nach dem Ablauf des Zertifikats erstellt
SecondUserListener_msgbox_text_signed_before_revoke=Die Signatur ist korrekt. Das Zertifikat wurde zwar widerrufen, die signatur wurde aber vor dem Widerruf erstellt.
SecondUserListener_msgbox_text_was_not_revoked=Die Signatur ist korrekt. Somit kann man sicher sein, dass die Nachricht nicht verändert wurde und tatsächlich vom Absender stammt\!
SecondUserListener_msgbox_text_was_revoked=Die Signatur wurde nach dem Widerruf des Zertifikats erstellt\!
SecondUserListener_msgbox_title_badsig=Signatur falsch
SecondUserListener_msgbox_title_revoked=Zertifikat abgelaufen
SecondUserListener_msgbox_title_success=Erfolg
SecondUserListener_msgbox_title_was_revoked=Zertifikat widerrufen
SigVisPluginOpenListener_enter_text_to_sign=Text zum Signieren eingeben...
SigVisPluginOpenListener_msgbox_text_signed_msg_was_sent=Die signierte Nachricht wurde versendet\!
SigVisPluginOpenListener_msgbox_title_success=Erfolg
TabItemListener_tab_ca_explain=Die "Certification Authority" (CA) hat zwei Aufgaben: Einerseits bearbeitet sie von der RA verifizierte Zertifikatsanfragen und stellt darin beantragte Zertifikate aus. Andererseits unterh\u00E4lt sie eine "Certificate Revocation List" (CRL). M\u00F6chte der Zertifikatsbesitzer, dass sein Zertifikat nicht l\u00E4nger g\u00FCltig ist, so f\u00FCgt die CA das betroffene Zertifikat dieser CRL hinzu. Der Zertifikatswiderruf, m\u00F6gliche Gr\u00FCnde und seine Auswirkungen werden in der Ansicht "Benutzer" genauer behandelt. Die CA muss lediglich daf\u00FCr sorgen, Widerrufsanfragen zeitnahe zu bearbeiten und die CRL auf dem neuesten Stand zu halten.\n\nLinkerhand finden Sie eine Liste an Zertifikatsanfragen (CSRs, von engl. "Certificate Signing Request") und Widerrufsanfragen (RRs, von engl. "Revocation Request"). Wenn Sie eine Zertifikatsanfrage annehmen, so wird dem Antragsteller ein Zertifikat ausgestellt. Sie k\u00F6nnen dieses dann in der Rolle "Benutzer" in der Benutzeransicht einsehen und verwenden. Wenn Sie eine Widerrufsanfrage annehmen, so wird das betroffene Zertifikat der CRL hinzugef\u00FCgt.\n\nMehr zu den technischen Hintergr\u00FCnden von Zertifikatsausstellung und CRLs lesen Sie in der Onlinehilfe.
TabItemListener_tab_ra_explain=Die "Registration Authority" (RA) ist der Teil einer PKI, der f\u00FCr die Identit\u00E4tspr\u00FCfung eines CSR zust\u00E4ndig ist. Im Zusammenhang mit einem pers\u00F6nlichen Zertifikat wie in diesem Fall muss also gepr\u00FCft werden, ob der Antragsteller auch wirklich die Person ist, auf die das Zertifikat  ausgestellt werden soll.\n\nLinkerhand sehen Sie eine Liste von Zertifikatsanfragen. Wenn Sie eine Anfrage daraus ausw\u00E4hlen, k\u00F6nnen Sie diese pr\u00FCfen, indem Sie auf den Button "Identit\u00E4tspr\u00FCfung vornehmen" klicken. Sobald Sie das gemacht haben, k\u00F6nnen Sie den CSR entweder ablehnen oder an die CA weiterleiten.\n\nMehr \u00FCber die T\u00E4tigkeit der RA erfahren Sie in der Onlinehilfe.
TabItemListener_tab_secuser_explain=In dieser Ansicht k\u00F6nnen Sie die von Ihnen in der Rolle "Benutzer" erstellten Signaturen zu \u00FCberpr\u00FCfen. Linkerhand k\u00F6nnen Sie Texte oder Dateien ausw\u00E4hlen, f\u00FCr die Sie in der Ansicht "Benutzer" Signaturen erstellt haben. Der Text oder Dateiname wird anschlie\u00DFend zusammen mit der dazugeh\u00F6rigen Signatur angezeigt. Mittels "Signatur \u00FCberpr\u00FCfen" k\u00F6nnen Sie pr\u00FCfen, ob diese Signatur g\u00FCltig und vertrauensw\u00FCrdig ist. Achten Sie aber darauf, dass standardm\u00E4\u00DFig nicht gepr\u00FCft wird, ob das Zertifikat, mit dem Sie diese Signatur pr\u00FCfen, widerrufen wurde. Das ist hier so, weil auch viele Anwendungen (wie E-Mail-Clients oder Webbrowsern) standardm\u00E4\u00DFig nicht \u00FCberpr\u00FCfen, ob ein Zertifikat widerrufen wurde. Dies muss oft vom Benutzer selbst eingestellt werden.\nBeachten Sie au\u00DFerdem, dass Signaturen, die erstellt wurden, bevor das Zertifikat widerrufen wurde, ihre G\u00FCltigkeit behalten. Ein Widerruf hat nur zur Folge, dass keine weiteren g\u00FCltigen Signaturen mehr erstellt werden k\u00F6nnen. Mehr \u00FCber den Widerruf von Zertifikaten und technische Hintergr\u00FCnde zur Signaturpr\u00FCfung lesen Sie in der Onlinehilfe.
TabItemListener_tab_user_explain=In der Ansicht "Benutzer" haben Sie die M\u00F6glichkeit, neue Zertifikate anzufordern, bereits ausgestellte Zertifikate zu verwalten sowie Texte oder Dateien zu signieren.\n\nW\u00E4hlen Sie eine Aktion aus, um fortzufahren und weitere Informationen zu erhalten. Wenn Sie dieses Plugin zum ersten Mal ausf\u00FChren, empfiehlt es sich, mit "Neues Zertifikat anfordern" zu beginnen.
UserShowCertsListener_btn_revoke_cert=Zertifikat widerrufen
UserShowCertsListener_btn_revoke_cert_was_revoked=Zertifikat wurde bereits widerrufen
UserShowCertsListener_not_part_of_cert=<nicht Teil des Zertifikats>
